{
  "category": "Marketing",
  "scraped_at": "2025-10-07T11:54:21.133864",
  "total_articles": 38,
  "articles": [
    {
      "title": "Why brands should stand firm on their values despite the fear of backlash",
      "description": "Executives discussed the importance of brand values in growing loyalty and the future of inclusive strategies during Advertising Week New York.",
      "url": "https://www.marketingdive.com/news/why-brands-should-stand-firm-on-their-values-despite-fear-backlash/802193/",
      "source": "marketingdive.com",
      "category": "Marketing",
      "published_date": "Tue, 07 Oct 2025 10:16:00 -0400",
      "author": "Jessica Hammers",
      "content": "Executives at Advertising Week New York discussed the importance of brand values in growing loyalty and the future of inclusive strategies. Credit: Shutterstock for Advertising Week New York NEW YORK — Brand values have experienced significant transformation in recent years. Diversity, equity and inclusion initiatives from marketers that were once a priority have moved to the back burner, with many brands retreating from such strategies amid a shifting — and increasingly tense — political landscape. Similarly, brands that once championed values like sustainability have fallen under fire for failing to deliver on their promises. Consumers simultaneously have become more vocal in expressing their support or opposition for the stances brands rally behind. Still, it remains critical for brands to stand firm on their values for the sake of their business, even despite the fear of backlash, according to executives at an Advertising Week New York panel on Monday (Oct. 6). “I think the brands that are very clear on their values and are clear on their audience and their consumers are the ones who ultimately are going to be able to see the growth,” said Erika Lewis, head of cultural partnerships at TikTok. “There’s a lot of fear, but sometimes you have to do it afraid, and when you do it afraid you may make a misstep, but it doesn’t mean that it’s the end — hopefully — of the world.” The panel, titled “Brand Values Must Be Unshakeable,” also included Shetellia Riley Irving, founder and CEO of A11Even Sports and Sheila Marmon, CEO and founder of multicultural media company Mirror Digital, and was moderated by God-is Rivera, chief strategy officer at Burrell Communications Group Worldwide. The talk addressed the importance of clear brand values for the sake of consumer loyalty, the value of inclusive marketing strategies and the future of such strategies in a fraught landscape. Some brands have been unapologetic in their values for years, from Ben & Jerry’s, which dedicates a section of its website to highlighting its social mission , to Chick-fil-A, which bases its business on Biblical principles . While taking a firm position in today’s climate may feel high risk, brand values remain key to forming an authentic consumer relationship, explained Marmon. “Brands mean something to the consumer,” said Marmon. “A brand you identify with or want to associate with says you feel says something about you, so understanding what that value is and knowing that it, as a consumer of that brand in some way, connects to who you are as part of your self-identification — that’s something brands have to keep top of mind as they say one thing or say another thing.” Identifying those core values can also help brands develop a better understanding of their consumers and build a more effective marketing strategy, Lewis added. However, just as important as defining brand values is sticking to them. Earlier this year, Target announced the end of some of its diversity efforts , citi..."
    },
    {
      "title": "From keyword to dialogue: How Hyundai optimizes for AI-driven search",
      "description": "The shift from keyword search to prompt driven-search is opening up new opportunities for brands, according to Greg Johns of Canvas Worldwide.&nbsp;",
      "url": "https://www.marketingdive.com/news/how-hyundai-optimizes-for-ai-driven-search/802204/",
      "source": "marketingdive.com",
      "category": "Marketing",
      "published_date": "Tue, 07 Oct 2025 08:44:23 -0400",
      "author": "Sara Karlovitch",
      "content": "How AI is changing search marketing and how the industry can adapt was the topic of a session at Advertising Week. Credit: Shutterstock for Advertising Week New York NEW YORK — Hyundai is taking a more conversational approach to its marketing in order to keep up with the proliferation of artificial intelligence (AI). This comes as the industry experiences major disruptions to search-based marketing in favor of AI-driven search, according to an executive from Canvas Worldwide, the auto manufacturer's media agency of record, who spoke during an Advertising Week New York panel on Monday. “Our main goal is to rethink how we are approaching consumers. It's less about search distribution, it's more about search engagement,” said Greg Johns, chief product officer and executive vice president, Canvas Worldwide. Johns, who took the place of Hyundai Motors America CMO Sean Gilpin on the panel, was joined by Costanza Ghelfi, chief product officer at Making Science, and Marta Martinez, managing director Americas, Google marketing platform at Google. The panel was moderated by Nikhil Lai, senior analyst, Forrester and introduced by Jason Downie, chief revenue officer, AI technology, Making Science. The roll out of AI search and AI mode on Google has led to an increase in “zero click searches,” where consumers may not click on a link at all. Sixty-five percent of U.S. searches are now clickless, according to Ghelfi. As consumers get more familiar with using AI tools for search, they are abandoning keywords in favor of natural language prompts. This means search is becoming a lot more specific and a lot more conversational, according to panelists. A car is typically a “high consideration” purchase, meaning consumers tend to do a lot of research before making a decision. Word of mouth is a key factor for many automotive buyers, according to Johns. Prior to the rapid expansion of AI search, marketers didn’t really have the ability to participate in those personal, word-of-mouth conversations. AI opens that door for marketers because consumers are talking to AI the same way they talk to friends. “We have the ability, through AI and how consumers are starting to really become trusting of it, to engage that offline conversation we aren't visible to. All of a sudden, we're going to be a part of that,” said Johns. While conversational AI-driven search may lead to less traffic to Hyundai’s website overall, it will lead to a more informed and engaged consumer, according to Johns. Software such as Ad Machina from Making Science, allows brands to find the right AI conversation for them. The idea is to enable brands to engage with consumers in a fashion akin to talking with a friend, similar to how many are already using the technology. The simplicity of search marketing is one of the big reasons it grew so quickly. The model was simple: marketers only paid if the consumer clicked. That’s all about to get a lot more complex, according to Johns. In order to be successful in..."
    },
    {
      "title": "Kraft Heinz CMO on being culturally nimble without losing brand equity",
      "description": "At Advertising Week, Todd Kaplan said marketers should think of brand building like pointillism and not rush to jump on every viral opportunity.",
      "url": "https://www.marketingdive.com/news/kraft-heinz-cmo-being-culturally-nimble-without-losing-brand-equity/802187/",
      "source": "marketingdive.com",
      "category": "Marketing",
      "published_date": "Tue, 07 Oct 2025 08:00:00 -0400",
      "author": "Peter Adams",
      "content": "From a condiment collaboration with hip-hop producer Mustard to a Weinermobile race, Todd Kaplan tries to keep activations rooted in insights. NEW YORK — Keeping a brand relevant with consumers takes a lot of work. Todd Kaplan has to manage 70. The executive, who joined packaged foods giant Kraft Heinz as CMO last year, spoke at Advertising Week New York Monday about the delicate balance marketers must strike as the pressure to capitalize on pop culture trends necessary for relevance collides with established brand perceptions. Despite the breakneck pace of the industry, marketers should stay focused on big-picture thinking, even for work lacking substantial paid media investment, according to Kaplan, who was interviewed at the show by marketing executive David “Shingy” Shing. Kaplan cautioned against activating around every viral opportunity, arguing that small decisions add up over time. “Brand building is a bit like pointillism ... Every time you activate your brand, you’re placing a dot in somebody’s brain,” said Kaplan, explaining that those individual dots cluster over time to form richer perceptions of a brand. Marketers who have a strong grasp of such perceptions can act with confidence on whether and how to deploy their brands in different cultural contexts while those who don’t may simply create more noise. “If you have a consistent point of view and a consistent brand architecture, you can tell multiple different stories … but it all needs to ladder back to that same brand idea,” said Kaplan. Kaplan for years has been an evangelist for the power of earned media and organic social media , marketing tactics that more CPGs have prioritized as they try to modernize . Several times during the Advertising Week discussion, the CMO emphasized success that came despite comparatively little traditional media spend. The talk covered a range of efforts the executive has steered in the roughly 14 months since he jumped from Pepsi to Kraft Heinz , including: A collaborative Heinz condiment developed with hip-hop producer Mustard ; a name, image and likeness deal struck between Ore-Ida and Richie Saunders just days after the college basketball player revealed his great-grandfather co-founded the brand and is credited with inventing Tater Tots; cartons carrying Jet-Puffed marshmallows that Kraft Heinz debuted around Easter in response to record-high egg prices ; and a race ahead of the Indy 500 that pitted six of Oscar Meyer’s Wienermobiles against each other on the track. In each case, Kaplan’s team moved quickly to respond to a trending topic, whether it was a meme inspired by a Kendrick Lamar song or a sporting event tied to Memorial Day weekend. But the CMO and his collaborators were also deliberate in making sure these activations were guided by insights drawn from consumers (price pressure in the grocery aisle), brand history (Saunders’ familial connection to Ore-Ida) or some combination of the two. “A lot of these really come down to just simpl..."
    },
    {
      "title": "Huge expands AI creative capabilities with Both&Yes acquisition",
      "description": "Agencies are preparing for a world in which generative AI-powered experiences are expected to play a dominant role.",
      "url": "https://www.marketingdive.com/news/huge-expands-ai-creative-capabilities-with-bothyes-acquisition/801834/",
      "source": "marketingdive.com",
      "category": "Marketing",
      "published_date": "Mon, 06 Oct 2025 10:47:00 -0400",
      "author": "Aaron Baar",
      "content": "Agencies are preparing for a world in which generative AI-powered experiences are expected to play a dominant role. Both&Yes has worked with brands such as Robinhood and Harry’s on creative innovation while its co-founders bring extensive experience in merging design and technology. Huge’s acquisition of Both&Yes continues a trend of agencies preparing for a world in which generative AI-powered experiences and information are expected to play a dominant role. “This acquisition underscores Huge’s commitment to leading the industry through creativity and technology,” said Jim Coleman, executive chairman of Huge, in a statement. The deal also reflects a broader reshuffling in the agency space as Omnicom gets closer to its proposed $13 billion acquisition of IPG to become the world’s largest holding company. M&A activity has increased as the prospect gets closer of a giant agency holding company with a vast array of resources. A number of recent industry maneuverings point to how agencies are ramping up their strategic activities and see AI as a key pillar for their businesses moving forward. Last week, Horizon Media Holdings and Havas launched Horizon Global , a joint venture that will focus on U.S.-centric global clients using a combined media platform. In announcing the venture, executives heralded Horizon Global as the first agency network built in the AI era, while also acknowledging the “dynamic moment” the ad industry is currently in. Earlier in September, Empower Media and Ocean Media merged to create Empower Ocean Media Group , an agency with $1.5 billion in billings. The industry is “at an inflection point,” noted Empower CEO Ashlee Clarke, in an e-mail Q&A with Marketing Dive. The merged media company is intended to present an alternative to the holding companies that “are still pushing one-size-fits-all buying models to prop up their bottom line(s),” the executive also noted. Get the free daily newsletter read by industry experts With global ad spending set to surpass $1 trillion, marketers must navigate myriad challenges, including an uncertain regulatory landscape, with finesse. Culture has become a central part of brand strategy for companies like Diageo even as definitions remain fuzzy, executives said at an event on April 2."
    },
    {
      "title": "Inside CeraVe’s social-first partnership with the NBA",
      "description": "The L&rsquo;Or&eacute;al-owned brand will promote the alliance, which includes experiential and digital activations, with a social-based teaser phase.",
      "url": "https://www.marketingdive.com/news/inside-ceraves-social-first-partnership-with-the-nba/801806/",
      "source": "marketingdive.com",
      "category": "Marketing",
      "published_date": "Mon, 06 Oct 2025 09:16:00 -0400",
      "author": "Chris Kelly",
      "content": "The L’Oréal-owned brand will promote the alliance, which includes experiential and digital activations, with a social-based teaser phase. CeraVe today (Oct. 6) has been named the official skin care and hair care partner of the NBA, per details shared with Marketing Dive. The L’Oréal-owned brand will promote the partnership, which includes experiential and digital activations, with a social-first teaser phase that’s inline with its other culture-hacking marketing efforts. The partnership brings together the number one dermatologist-recommended skin care brand in the U.S., per survey data cited by CeraVe, and the sports league that is perhaps the most-digitally engaged in the U.S. — two “powerhouses” with diverse audiences and fans, said Jasteena Gill, vice president of marketing at CeraVe U.S. “Something that we've prided ourselves on is that we've always been able to step outside the traditional skincare box and capture moments of culture and be at the forefront of culture,” the executive said. “The NBA is a testament to how sports can transcend the sports world and impact culture, fashion and skincare, and have so much influence on people's lifestyles.” Along with a “Care For All” philanthropic program that offers dermatology check-ups and skin health education at Jr. NBA clinics, CeraVe will be integrated into NBA events like the Emirates NBA Cup and within video game NBA 2K. The brand has dabbled in gaming as a part of culture that resonates across demographic lines. “It's not about coming to life in a more traditional way. It's about finding our way in and creating a world with skincare in the NBA 2K universe,” Gill said. “We're still working through what that looks like.” To tease the tie-up, CeraVe will team up with #NBATwitter favorite @NBACentel for the parody account’s first brand partnership. CeraVe will also roll out a takeover of its own social channels with content inspired by NBA cultural moments to encourage speculation and engage with fans. The multi-stage teaser strategy has helped CeraVe amplify campaigns, as it did with its Super Bowl debut in 2024. “We like to flip the script on how make things come to life,” Gill said. “We're going to start to activate with players and influencers, keeping this socially native.” The tie-up grew out of CeraVe’s “ Head of CeraVe ” campaign that featured NBA All-Star Anthony Davis, alongside WNBA star Paige Beuckers and TikTok personality Charli D’Amelio. The goal was to bring authenticity to an effort around the brand’s anti-dandruff shampoo and conditioner with actual users of the product. “We saw great interaction and engagement with being able to bring an NBA player and CeraVe together with a real educational insight about dandruff, and also having the dermatologist at the heart of that campaign to really bring that skincare education forward,” Gill said. Founded in 2005 and acquired by L’Oréal in 2017, CeraVe has become a $2 billion brand by leaning on its devoted customer base. In the last..."
    },
    {
      "title": "American Express debuts ad network boasting contextual targeting prowess",
      "description": "Tumi, which piloted Amex Ads, saw return on ad spend 30% higher than its targets while reaching more Gen Z and millennial customers.",
      "url": "https://www.marketingdive.com/news/american-express-debuts-ad-network-boasting-contextual-targeting-prowess/801805/",
      "source": "marketingdive.com",
      "category": "Marketing",
      "published_date": "Mon, 06 Oct 2025 09:00:00 -0400",
      "author": "Peter Adams",
      "content": "This marks the second major payments firm to unveil an ad network in under a week in another sign that commerce media is booming. Payments giants are staking a larger claim in the booming field of commerce media, with American Express and Mastercard unveiling competing ad networks within a week of each other. Both of these bets seek to build on the firms’ existing offers businesses, where they help brands better tailor rewards and content to cardholders, with the addition of new ad formats and the kinds of sophisticated measurement tools that are expected from digital platforms with scale. In American Express’ case, the news helps to kick off Advertising Week, a major industry gathering. American Express said its offers segment drove $15 billion in spending last year, with the lion’s share stemming from the U.S. market. That provides a solid foundation upon which Amex Ads can expand, starting with American Express’ travel website before pushing into other platforms that carry high-intent audiences. Marriott and Tumi piloted the network earlier this year with contextual campaigns that showed positive results. In Marriott’s case, it was looking to reach American Express customers who had already booked a flight but not a hotel via AmexTravel.com. By tapping into Amex Ads’ travel-booking and transaction data, the hospitality chain realized a return on investment 300% above its target. Meanwhile, Tumi ran ads angled at customers during and after their travel-booking experience, including in post-booking emails from Amex Travel, generating a return on ad spend 30% higher than benchmarks while tapping into a fresh set of young buyers. “We were particularly impressed by how targeted our campaign was, allowing us to reach a new millennial and Gen Z audience, in addition to our core brand fans,” said Jill Krizelman, senior vice president of global marketing and e-commerce at Tumi, in a statement. While those use cases represent advertisers endemic to travel, American Express said its network can also assist non-endemic advertisers in tracking sales lift both online and in store thanks to its end-to-end view into customer journeys. Keeping content within American Express’ “four walls” additionally ensures brand safety, privacy and that ads are appearing in premium environments, the company claims. American Express and Mastercard doubling down on their advertising bets comes as a range of industries, including financial services , travel and hospitality and ride-hailing , adopt the media network model first popularized by retailers . U.S. ad spending on retail media is expected to close in on $100 billion by 2028, according to eMarketer forecasts, speaking to the large opportunity that other verticals see in monetizing their first-party data. That said, retail media today is viewed as a category overcrowded with platforms that lack differentiation, and some experts believe it is primed for contraction . Whether that pattern will repeat with media networks i..."
    },
    {
      "title": "Beyond Black Friday: Maximizing holiday performance through affiliate marketing",
      "description": "Holiday 2025 has new rules. See what will really move the needle this peak season.",
      "url": "https://www.marketingdive.com/spons/beyond-black-friday-maximizing-holiday-performance-through-affiliate-marke/761152/",
      "source": "marketingdive.com",
      "category": "Marketing",
      "published_date": "Mon, 06 Oct 2025 05:00:00 -0400",
      "author": "Rakuten Advertising",
      "content": "Holiday 2025 won’t be decided by a single tentpole or a coupon code. Shoppers are discovering differently and moving from inspiration to purchase with fewer detours—and higher expectations. Based on Rakuten Advertising’s proprietary consumer and network data across key categories and retail moments, several shifts stand out. They point to strategies that prize clarity, credibility, and channel fit over a singularly promotion-focused plan and consumers are seeking value over all. Discovery is moving from keywords to context. Consumers want confidence and curation, turning to trusted publisher environments, creator content, and assistive AI that surfaces recommendations in the moments that matter. According to Similarweb guide traffic averaged 13.1K weekly clicks Oct–Jan, outpacing Uncommon Goods (12.4K) and Amazon (10.8K), while “gifts for men” ‑type queries draw 500K+ monthly clicks in peak season. In our holiday report , learn how you can update your strategy to capture this change in consumer behavior. Value looks different by audience and moment. For some, it’s sharp pricing on essentials; for others, it’s convenience, quality assurance, exclusivity, or confidence in origin. Blanket promotions can move units, but compress margin and teach the wrong behaviors. Based on Rakuten Advertising’s proprietary consumer data, over half of consumers report struggling with necessities, and 42% are adjusting spending to afford gifts, while 47% say tariffs will impact their purchasing. Casual browsing is giving way to decisive visits. Now is the time to showcase your products with clarity; offer transparent availability, smart bundles, and strong assurances to win decisive shoppers. Based on data from Similarweb, marketplaces now draw the largest audiences in ecommerce and continue to grow YoY; while margins can be thinner, conversion rates are often higher; use that momentum without diluting brand equity. Traditional publishers, affiliate collaborators, creators, and deal-focused communities influence different moments—from early inspiration to last- ‑ mile reassurance. Leaders who combine data- ‑ driven decision-making and creative solutions with people ‑ -driven partnerships are getting and staying ahead this holiday season. Influencer impact is not uniform, food creators sway purchase intent most (65.7%), with beauty, health & fitness, and fashion close behind, according to Rakuten Advertising consumer research. It’s mission-critical to assign clear roles to each partner type and reward contribution throughout the consumer journey. Just as important: protecting the path to purchase during peak spikes with real ‑ time, AI- ‑ powered tools that guard against ad hijacking and fraud. This season rewards a clear, adaptable strategy that meets customers where they are and backs the partners and surfaces that actually drive incremental demand. The edge won’t come from spending more, but from showing up in the right places with the right promise—and committing ..."
    },
    {
      "title": "Starbucks ties in-store experiences, rewards to new Taylor Swift album",
      "description": "The chain has outfitted a Nashville store with a pop-up vinyl shop, photo booth and more, and claims it is throwing&nbsp;&ldquo;the largest global listening party.&rdquo;",
      "url": "https://www.marketingdive.com/news/starbucks-ties-in-store-experiences-rewards-to-new-taylor-swift-album/801905/",
      "source": "marketingdive.com",
      "category": "Marketing",
      "published_date": "Fri, 03 Oct 2025 10:35:00 -0400",
      "author": "Peter Adams",
      "content": "The chain is seizing on hype for “The Life of a Showgirl” by outfitting a Nashville store with a vinyl pop-up shop, photo booths and more. Starbucks is rolling out the red — or orange — carpet for Taylor Swift’s latest album release this weekend with several in-store and digital experiences catering to fans of the pop star, according to a press release . To celebrate “The Life of a Showgirl,” the coffee chain is hosting what it bills as “the largest global listening party” for the new record, Swift’s twelfth original studio album. Participating stores will play both “The Life of a Showgirl” and a curated Starbucks Lovers playlist. In Nashville, Tennessee, a city that has factored heavily into Swift’s career, the QSR is also outfitting a location with Starbies branding, along with a pop-up vinyl shop, photo booth and Swiftie-tailored offerings like friendship bracelets — a fixture on the star’s recent Eras Tour — and glitter-dusted cold foam drinks (glitter and the color orange are visual themes of “The Life of a Showgirl”). On the digital front, the brand shared social posts around the “The Life of a Showgirl” with hidden Easter eggs. The first 113,000 members of Starbucks Rewards who spotted the Swift references unlocked a free drink, another bid to drive traffic around the much-hyped Oct. 3 album drop. Starbucks previously partnered with Swift around “Red (Taylor’s Version)” in 2021, a promotion that included a custom latte order favored by the “Karma” singer, as well as themed stickers and e-gift cards. Swift album cycles have dependably become marketing frenzies for brands that view the artist’s wide, dedicated fandom as a means to bolster online engagement and spur sales. Reese’s turned around an ad in under 24 hours after Swift unveiled “The Life of a Showgirl ” in August on the “New Heights” podcast, which the candy marketer sponsors. The spot, which promoted a collaboration with Oreo and featured nods to Swift, quickly racked up millions of views. In Starbucks’ case, the pop culture-forward activation comes amid a larger turnaround push that has seen the coffee giant invest more in marketing and revamping its brick-and-mortar experience. The company in September said it would close roughly 400 company-operated stores and enacted another round of corporate job cuts. Get the free daily newsletter read by industry experts With global ad spending set to surpass $1 trillion, marketers must navigate myriad challenges, including an uncertain regulatory landscape, with finesse. Culture has become a central part of brand strategy for companies like Diageo even as definitions remain fuzzy, executives said at an event on April 2."
    },
    {
      "title": "Inside WebexOne 2025: Cisco’s Big CX and AI Announcements Explained",
      "description": "Standing in the sunshine outside the Marriott Marquis on San Diego Marina, with palm trees swaying and thousands of attendees weaving through the conference center in search of their next big session, one thing became clear at this year’s WebexOne: AI isn’t just helping anymore; it’s starting to think for itself. For CX leaders, that [&#8230;]",
      "url": "https://www.cxtoday.com/event-news/inside-webexone-2025-ciscos-big-cx-and-ai-announcements-explained/",
      "source": "cxtoday.com",
      "category": "Marketing",
      "published_date": "Tue, 07 Oct 2025 14:19:49 +0000",
      "author": "Rob Scott",
      "content": "Webex Contact Center, supervisor-grade AI, industry integrations, and real-world results. Standing in the sunshine outside the Marriott Marquis on San Diego Marina, with palm trees swaying and thousands of attendees weaving through the conference center in search of their next big session, one thing became clear at this year’s WebexOne : AI isn’t just helping anymore; it’s starting to think for itself. For CX leaders, that means a new generation of agentic AI—intelligent systems that don’t just assist employees but anticipate customer needs and take meaningful action. Welcome to the age of Connected Intelligence . Cisco unveiled Webex AI Quality Management (QM) , a supervisor tool that unifies coaching and improvement across both human agents and AI agents in a single platform. It combines AI-assisted scoring, real-time insights, and personalized coaching for humans with actionable recommendations and optimization for AI agents—all natively in Webex Contact Center. Planned GA: Q1 2026 . Why it matters: Moves beyond compliance checklists to continuous experience improvement and de-risks AI adoption with a single supervisory view. Related coverage: Agentic AI in the Contact Center: How Cisco Is Redefining Service Webex AI Agent enables autonomous and guided self-service, tapping tools, systems, and experts as needed—created and tuned in the new AI Agent Studio . Cisco AI Assistant boosts live-agent productivity with suggested responses, real-time transcription, and summaries mid-call and at wrap-up. These are available for cloud and on-prem customers, with a beta for 50 + languages targeted for Q4 2025 . Starting in Q1 2026 , Webex plans support for multi-agent collaboration via A2A and Model Context Protocol (MCP) —so Webex AI Agents can interoperate with third-party agents and external data sources under enterprise controls. Why it matters: Faster, more accurate resolutions with AI that can act, not just advise—while preserving governance. Related coverage: How Enterprises Are Using Webex AI to Drive Real CX Results As part of Salesforce’s BYO CCaaS program, Webex Contact Center for Salesforce deepens the integration so organizations can orchestrate experiences using combined Webex and CRM data. Interactions can be managed inside Salesforce via Service Cloud Voice and Bring Your Own Channel , powered by Webex AI and Agentforce. Early access now; planned GA Q1 2026 . Why it matters: Reduces swivel-chair workflows and gives agents contextual, AI-enriched insights where they already work. Watch: Webex and Salesforce Redefine CX Integration Integration with Amazon Lex (the same tech behind Alexa) lets teams build natural voice and chat interfaces for Webex Contact Center and Contact Center Enterprise. Use cases include AI receptionist capabilities to deflect / route calls, improved intent recognition, and acceleration of live-agent resolutions. Available now . Why it matters: Accelerates self-service design and improves containment while maintaining ..."
    },
    {
      "title": "Qualtrics to Snap Up Press Ganey Forsta in $6.75BN Deal, Consolidate the VoC Market",
      "description": "Qualtrics has agreed to acquire Press Ganey Forsta for $6.75BN. Press Ganey Forsta, often referred to as &#8220;PG Forsta&#8221;, is a rising force in the voice of the customer (VoC) space, rivaling Qualtrics. Indeed, it recently placed as a Leader in the market's latest Gartner Magic Quadrant for VoC. In doing so, PG Forsta ranked [&#8230;]",
      "url": "https://www.cxtoday.com/voice-of-the-customer/qualtrics-to-snap-up-press-ganey-forsta-in-6-75bn-deal-consolidate-the-voc-market/",
      "source": "cxtoday.com",
      "category": "Marketing",
      "published_date": "Tue, 07 Oct 2025 12:27:44 +0000",
      "author": "Nicole Willing",
      "content": "Home → Voice of the Customer The moves comes shortly after PG Forsta rollup another big VoC player: InMoment Qualtrics has agreed to acquire Press Ganey Forsta for $6.75BN. Press Ganey Forsta, often referred to as “PG Forsta”, is a rising force in the voice of the customer (VoC) space, rivaling Qualtrics. Indeed, it recently placed as a Leader in the market’s latest Gartner Magic Quadrant for VoC . In doing so, PG Forsta ranked alongside InMoment, which it later rolled up in May . As such, this latest acquisition brings together three of the VoC space’s biggest brands. Yet, Qualtrics is one of the market’s two most prominent names, with Medallia the other. The acquisition will extend its market leadership and help consolidate the space. Nevertheless, it will also boost Qualtrics’ industry-specific offerings, with PG Forsta widely deployed in the healthcare space and other highly-regulated sectors. Across these industries, it offers advanced journey visualizations and templates, simplifying feature adoption. PG Forsta is also well-known for its strong support services and differentiated AI solutions for front-line, customer-facing employees. As such, it can offer many more bows to Qualtrics’ quiver, with the deal marking the VoC giant’s largest investment since it was taken private by Silver Lake in 2023. “Bringing Qualtrics and Press Ganey Forsta together will accelerate the adoption of AI and create the most comprehensive platform for improving the human experience,” said Zig Serafin, CEO of Qualtrics . Combining Qualtrics’ AI platform with Press Ganey Forsta’s trusted analytics and deep expertise creates an opportunity to deliver exceptional value and measurable outcomes for our customers. The combined companies are expected to generate nearly $3BN in annual revenue. The cash and stock transaction is expected to close in the coming months, and the two companies will continue to operate independently in the meantime. But beyond size, Patrick T. Ryan, Chairman and CEO of Press Ganey Forsta, stressed that the real differentiator is the ability to turn massive data into smarter, faster decisions powered by AI. “AI is rapidly transforming every industry, and organizations need proven, innovative solutions grounded in deep expertise to move from insight to impact faster,” he said. This investment ignites our ability to deliver.” Qualtrics has already been making strides in AI with tools like Conversational Feedback, Qualtrics Assist, synthetic research platform Edge Audiences, and Experience Agents. According to the company, more than one-third of customers have adopted these AI features, and 90 percent of their top 50 enterprise clients are already using them. Now, with Press Ganey Forsta’s benchmarking data and advisory services in the mix, Qualtrics aims to help clients move from insights to impact faster. As Bill Staikos, Founder and Managing Partner of Be Customer Led, put it in a LinkedIn post : In the quickly consolidating CXM space, this is t..."
    },
    {
      "title": "Oracle’s Role-Based AI Agents Promise to Boost Revenue",
      "description": "Oracle has released role-based AI agents for Marketing, Sales, and Service. Available within Oracle Fusion Cloud Applications, the agents are designed to help CX leaders unlock fresh revenue opportunities. According to Oracle, the agents achieve this by allowing users to “operate faster and make better decisions.” With the ability to enhance automation processes and analyze [&#8230;]",
      "url": "https://www.cxtoday.com/conversational-ai/oracle-launches-role-based-ai-agents-to-help-boost-roi/",
      "source": "cxtoday.com",
      "category": "Marketing",
      "published_date": "Tue, 07 Oct 2025 11:30:04 +0000",
      "author": "Rhys Fisher",
      "content": "The prebuilt AI agents are specifically designed for Marketing, Sales, and Service Oracle has released role-based AI agents for Marketing, Sales, and Service. Available within Oracle Fusion Cloud Applications, the agents are designed to help CX leaders unlock fresh revenue opportunities. According to Oracle, the agents achieve this by allowing users to “operate faster and make better decisions.” With the ability to enhance automation processes and analyze connected data, the solutions promise to equip CX leaders with the tools to deliver more personalized experiences and strengthen customer loyalty. Chris Leone , EVP of Applications Development at Oracle , claims that the AI agents will “unlock new revenue opportunities with intelligent insights and agentic automation. AI agents are transforming customer engagements from reactive, manual, and cumbersome processes into highly valuable and proactive strategies that enable organizations to scale quality experiences to win more business and keep customers happy. The agents are powered by Oracle Cloud Infrastructure and benefit from being natively integrated within Oracle Fusion Applications. In addition, agents can be embedded directly within an organization’s existing workflows. It is clear that Oracle is placing a great deal of stock in its latest release, but can these role-based AI agents deliver on their promise? In a conversation with CX Today, Martin Schneider, VP and Principal Analyst of Constellation Research, shared some insights on what makes an AI agent successful and whether Oracle’s offering can live up to the hype. For Schneider, the driving force behind a strong AI agent is precision data, which he views as being integral to training agents and enabling them to execute on agentic workflows. He believes that Oracle ticks these boxes, stating: Oracle offers the breadth of business applications – and the integration and data management capabilities – to generate a more inclusive and accurate view of the customer in order to unlock agentic AI value. Schneider also commended the vendor for making it more seamless for users to start working with agentic tools, due to the fact that a lot of their AI offerings come free of charge with existing Oracle license fees. “This allows CX leaders to work with (or in some cases without) IT to start developing agentic flows that improve the customer experience with lower risk and cost,” he explained. With each of Oracle’s prebuilt, role-based AI agents offering different capabilities, the vendor outlined how certain agents are best suited for Marketing, Sales, and Service: For Marketers, the new AI agents are designed to deliver data-driven decisions about where to focus their efforts. The Account Product Fit Agent applies predictive scoring and Ideal Customer Profile data to determine which accounts are most likely to buy, giving marketers a clearer view of where to allocate resources. The Buying Group Definition Agent, on the other hand, focuses on ma..."
    },
    {
      "title": "Salesforce Responds to User Backlash Over Replacing Help Search with Agentforce",
      "description": "Salesforce has committed to bringing the dedicated search function back to its help portal in a statement to CX Today. The news comes after users expressed their frustration at the replacement of its classic search bar with an Agentforce AI assistant on September 29. Instead of being able to type a keyword to get a [&#8230;]",
      "url": "https://www.cxtoday.com/crm/salesforce-responds-to-user-backlash-over-replacing-help-search-with-agentforce/",
      "source": "cxtoday.com",
      "category": "Marketing",
      "published_date": "Tue, 07 Oct 2025 10:47:27 +0000",
      "author": "Nicole Willing",
      "content": "CRM giant vows to restore search functionality after users criticize AI assistant for slowing down support experience Salesforce has committed to bringing the dedicated search function back to its help portal in a statement to CX Today. The news comes after users expressed their frustration at the replacement of its classic search bar with an Agentforce AI assistant on September 29. Instead of being able to type a keyword to get a list of matching articles, documentation, or guides, the only option was to ask the AI‑powered conversational assistant questions. Frustrated at the loss of the familiar tool, many users took to Salesforce’s IdeaExchange forum and social media to request its return, saying that it was faster, more predictable, and more reliable. Yet, Salesforce has listened and is now bringing the search bar back in response to the feedback. Bernard Slowey, SVP of Digital Success at Salesforce , said: First and foremost, I want to thank you. The passion and feedback you’ve shared on IdeaExchange about the removal of the site search bar has been heard loud and clear. Your willingness to use this platform to let us know where we can improve is invaluable, and I have personally read every single one of your comments. We truly appreciate it. Slowey added that the company had decided to remove the search bar as part of a data-driven effort to streamline the user experience and shift focus toward Agentforce, but acknowledged that the move underestimated how essential traditional search still is for a core group of users. “We know how important Salesforce Help is to your daily work,” he continued. “The decision to remove the search bar was based on data analysis that showed an average of only 1.7% of Help sessions engaging with search, with trends pointing down. With our focus on enhancing the Agentforce experience and a belief that we could streamline the customer journey, we felt this was a logical step forward.” You’ve made clear that even with low usage, the search bar is a critical tool for many of you, and that removing it created friction in your workflow. We hear you. Because of your feedback, we are committing to bringing back a dedicated search capability to Salesforce Help – this is a top priority. Slowey indicated that rather than reverting to the traditional search bar completely, Salesforce will combine search and conversational AI with search functionality built into or accessible via Agentforce. “Over time, our vision is to enable search functionality directly in Agentforce on Salesforce Help, and we’ll be sure to consult our customers and community,” Slowey said. “In the meantime, we will be reaching out to a few of you to engage directly. Thank you again for your candid feedback and for helping us make Salesforce better.” Pushing ahead with Agentforce is part of Salesforce’s bigger bet on agentic AI to handle simple customer queries. Salesforce is taking a “customer zero” approach, essentially testing its own tools on itself ..."
    },
    {
      "title": "Discord Joins List of Companies Hit by CRM Breaches After Attack on Its Zendesk Implementation",
      "description": "Discord has confirmed a significant security breach of its third-party customer service platform. That platform was Zendesk, according to security researchers, cited by Cyber Kendra. The breach follows a spate of breaches across many competitive CRM and helpdesk systems, with social engineering still the most common means of poaching customer information. Yet, many other types of [&#8230;]",
      "url": "https://www.cxtoday.com/crm/discord-joins-list-of-companies-hit-by-crm-breaches-after-attack-on-its-zendesk-implementation/",
      "source": "cxtoday.com",
      "category": "Marketing",
      "published_date": "Tue, 07 Oct 2025 10:24:32 +0000",
      "author": "Francesca Roche",
      "content": "Numerous Discord users were notified last week that their customer service-related data had been breached by cyber-attackers Discord has confirmed a significant security breach of its third-party customer service platform. That platform was Zendesk, according to security researchers, cited by Cyber Kendra. The breach follows a spate of breaches across many competitive CRM and helpdesk systems, with social engineering still the most common means of poaching customer information. Yet, many other types of attack are emerging. In a blog post divulging the attack , Discord shared more details. It noted: The unauthorized party… gained access to information from a limited number of users who had contacted Discord through our Customer Support and/or Trust & Safety teams. Discord also suggested the attackers were targeting their third-party customer support servers to “ extort a financial ransom from Discord” . In an email to the affected users, Discord notified its users that personal information was released in the attack, including: A small number of government-issued ID images were also swept up in the process, increasing the danger of identity theft. However, Discord has emphasized that data such as f ull credit card numbers or CCV codes, messages beyond discussions with customer support, or passwords were not involved in the cyberattacks. Additionally, the company says it has notified the relevant data protection authorities and is proactively working with law enforcement to investigate the attacks, reviewing its threat detection and security systems, as well as continuing to audit its third-party systems. Discord has also warned the affected users to be aware of any suspicious messages or communications, deploying more service agents to handle any additional support or queries. Across social media, many industry commentators have weighed in on the breach. One account on LinkedIn said, “When [a] data breach happens, it will be your company name on the news headlines… not the name of the third-party provider.” Another said, “We can no longer afford a reactive approach to cybersecurity.” Meanwhile, Baker Johnson, Chief Business Officer at UJET , told CX Today: “This isn’t just a data breach; it’s a fundamental break in the customer relationship. When a customer reaches out for help, it’s a relational moment. A security failure like this turns that moment of trust into a broken, dangerous transaction. The Discord attack is the latest in a long line of data breaches on CRM systems. In September, Salesforce made headlines after the FBI released an alert warning the public of cybercriminal attacks on Salesforce’s platforms, following a string of its customers’ announcements of data breaches and stolen information . Earlier in the month, SalesLoft’s Drift Bot was also temporarily shut down due to an issue that allowed attackers to backdoor their way into Salesforce records. Meanwhile, only last week, the luxury department store, Harrods, released a stateme..."
    },
    {
      "title": "Qualtrics Finds Cynicism Around AI Threatens Customer Loyalty",
      "description": "Many businesses are enthusiastically deploying AI-powered chatbots and agents as the front line of their customer engagement, but a growing number of consumers are hitting the brakes. The benefits for businesses are clear. AI chatbots and agents are always on, never tired, and cost a fraction of a human support team, promising speed, scale, and [&#8230;]",
      "url": "https://www.cxtoday.com/voice-of-the-customer/qualtrics-finds-cynicism-around-ai-threatens-customer-loyalty/",
      "source": "cxtoday.com",
      "category": "Marketing",
      "published_date": "Tue, 07 Oct 2025 04:01:06 +0000",
      "author": "Nicole Willing",
      "content": "Home → Voice of the Customer Consumers are growing frustrated with AI-driven support, fearing they'll never reach a real person — and it's costing brands their trust Many businesses are enthusiastically deploying AI-powered chatbots and agents as the front line of their customer engagement, but a growing number of consumers are hitting the brakes. The benefits for businesses are clear. AI chatbots and agents are always on, never tired, and cost a fraction of a human support team, promising speed, scale, and efficiency. But many consumers simply don’t want to talk to robots, and, worryingly for brands, this is threatening customer loyalty as well as sales, Qualtrics found in its Customer Experience Trends 2026 report. The survey found that 95% of UK consumers would prefer not to deal with chatbots at all. The reason is rooted in trust. Consumers remain skeptical about interacting with AI across their customer experience, with around 80% responding that they haven’t dealt with AI-based customer service help or support recently. While some AI chatbots have improved considerably, there’s still a widespread perception that AI can’t match the nuance or empathy of a human conversation. Around 33% of UK customers don’t trust the information provided by AI, while just 35% globally say AI customer support actually solves their problem, Qualtrics found. AI service tools have yet to close the gap between brands’ expectations that they will help improve customer interactions and consumers’ concerns that they won’t. More than half of UK consumers worry they won’t be able to reach a human to resolve their issues when companies automate their interactions with AI. After all, around 46% of UK customers cite convenience as the main reason they choose a particular brand over another. So the idea that AI won’t deliver a smooth experience is enough to push consumers away from brands that rely on it too heavily. What’s more, communication breakdowns are still one of the biggest reasons customers walk away unhappy, causing 42% of all bad experiences in the UK. But businesses may not get the insights they need to understand churn and improve the experience for the customer. Around 31% of UK consumers do not communicate with a company directly after they have a poor experience. But with 44% of bad experiences leading customers to reduce their spending with the company, brands are losing loyalty — and revenue — without being able to understand why. As Isabelle Zdatny, Head of Thought Leadership at Qualtrics XM Institute, told CX Today: Silence from consumers is one of the biggest challenges for UK brands right now as they try to manage shifting customer expectations and needs. “Increasingly, customers don’t tell companies about bad experiences – they just act, with roughly half reducing their spending. Companies can be left guessing where they went wrong,” Zdatny said. “Brands need to recognize that every missed signal, whether it’s a dropped call, an abandoned shopping c..."
    },
    {
      "title": "SAP Connect 2025: The Top 10 Announcements (So Far!)",
      "description": "SAP’s push into AI agents with Joule and its fast-tracked cloud migrations mean that one major conference a year no longer suffices. In addition to the annual SAP Sapphire, it has rebranded and expanded its SuccessConnect event, so practitioners, partners, and execs can keep their finger on the pulse. At this year’s event, that pulse [&#8230;]",
      "url": "https://www.cxtoday.com/event-news/sap-connect-2025-the-top-10-announcements-so-far/",
      "source": "cxtoday.com",
      "category": "Marketing",
      "published_date": "Mon, 06 Oct 2025 18:24:15 +0000",
      "author": "Charlie Mitchell",
      "content": "Flick through all the major announcements from SAP’s rebranded Las Vegas event SAP’s push into AI agents with Joule and its fast-tracked cloud migrations mean that one major conference a year no longer suffices. In addition to the annual SAP Sapphire, it has rebranded and expanded its SuccessConnect event, so practitioners, partners, and execs can keep their finger on the pulse. At this year’s event, that pulse raced, with many massive announcements including AI agent advancements, a new engagement platform, and much more. Celebrating the event’s many headlines, Muhammad Alam, Member of the Executive Board of SAP SE, SAP Product & Engineering , said: Our announcements today demonstrate the power of SAP Business Suite, where AI, data, and applications come together in an experience to propel smarter decisions, faster execution, and scalable transformation. That suite envelops the enterprise, yet its customer experience portfolio is a key cornerstone. Given that, here’s a rundown of the event’s biggest news, with extra emphasis on CX. SAP has announced the next step in its Joule and AI agent journey: role-aware AI assistants. These assistants partner with a person in a specific business role to support them in fulfilling tasks across the SAP Business Suite. In doing so, they spot tasks the employee needs to accomplish and tap AI agents to get the job done, configuring, orchestrating, and managing them. SAP also unveiled an array of new Joule Agents to support these Assistants in getting those role-specific tasks done. For instance, it gave the example of a People Manager Assistant, which may evoke a People Intelligence Agent to isolate and solve compensation anomalies and similar issues. Critically, the assistants complete tasks that cross various SAP systems, breaking down silos. The company’s next move is likely to have them operate across SAP and third-party systems that customers often integrate with. In the future, the Assistants in Joule may even perform new tasks based on specific brand goals and engage in self-reflection. After all, that’s the future for AI agent technology. The SAP Business Data Cloud (BDC) Connect is the next big launch from the event. It links with third-party, partner platforms to “enable a bidirectional flow of business-ready data products”. In other words, the tech giant will work with adjacent tech providers to build bridges from their platforms to the SAP Business Data Cloud, enabling better data sharing and cross-platform AI agent applications. With zero-copy sharing, SAO ensures data stays securely in its systems, yet is accessible from other tech solutions, to preserve business context with copies. Databricks and Google Cloud are the first big-name brands to partner on SAP BDC Connect. However, the tech giant promises that more will soon follow. The big customer experience news from SAP Connect 2025 is the debut of the SAP Engagement Cloud, which the company describes as a “unified system of engagement”. Aligned ..."
    },
    {
      "title": "Salesforce Launches Agentforce Service, Claims “Era of Reactive Customer Support is Over”",
      "description": "Salesforce is aiming to combat rising customer demands with the release of Agentforce Service. The vendor claims that its latest solution is “directly addressing the surge in customer support demand” by equipping service reps, leaders, and customers with agentic capabilities. Technically, Agentforce Service is a revamped version of Salesforce’s longstanding Service Cloud customer service and [&#8230;]",
      "url": "https://www.cxtoday.com/conversational-ai/salesforce-launches-agentforce-service-claims-era-of-reactive-customer-support-is-over/",
      "source": "cxtoday.com",
      "category": "Marketing",
      "published_date": "Mon, 06 Oct 2025 12:26:34 +0000",
      "author": "Rhys Fisher",
      "content": "The reimagined Service Cloud platform promises to “slash support costs and deepen customer loyalty” Salesforce is aiming to combat rising customer demands with the release of Agentforce Service. The vendor claims that its latest solution is “directly addressing the surge in customer support demand” by equipping service reps, leaders, and customers with agentic capabilities. Technically, Agentforce Service is a revamped version of Salesforce’s longstanding Service Cloud customer service and support platform. However, in an official company blog, Kishan Chetan , EVP & GM of Agentforce Service , emphasized that the platform is more than a new name and some fresh features, stating: It’s not just an upgrade; it’s a reboot of customer service itself, turning every support interaction from a reactive and costly one into a strategic engine for driving customer loyalty and business growth. This assertion appears to be backed up by results, with Salesforce reporting that Agentforce Service is able to offload up to 72% of routine inquiries to AI agents. Moreover, the company also claims that its latest solution delivers 32% faster resolution times and enhances customer satisfaction score by approximately 33%. But how exactly does it achieve this? At the most basic level, Agentforce Service allows AI agents and humans to work together more seamlessly and effectively. The solution is built directly into the Salesforce platform and benefits from what the company describes as a “combined approach” thanks to support from Agentforce and Data Cloud. The platform is able to bring together real-time customer data and automated workflows, which allows it to help service teams deliver faster and more relevant experiences across every channel. The approach allows organizations to respond to rising expectations for speed, empathy, and personalization, while reducing manual effort and improving decision-making. “Service leaders are being asked to do more with less—while customer expectations keep rising,” Chetan explained. With Agentiforce Service, we’re putting AI, real-time data, and fast deployment in every service team’s hands. “This is what the future of customer service looks like—personal, predictive, and scalable.” In support of the promise that Agentforce Service can improve performance across every channel, Chetan specifically discussed how the solution can deliver for supervisors, service reps, and customers. Agentforce Service introduces a unified command center designed to give supervisors full visibility into customer operations across channels. The platform provides live data from service, sales, and marketing, allowing teams to monitor key metrics, customer sentiment, and performance in one view. Supervisors can observe both AI and human-led interactions in real time, identify when escalation is needed, and intervene directly when required This level of visibility supports a more proactive approach to service management, helping teams resolve issues befor..."
    },
    {
      "title": "Blog & Articles | Digital Marketing Institute",
      "description": "Blog & Articles page of DMI, the global certification standard in digital marketing education.",
      "url": "https://digitalmarketinginstitute.com/blog",
      "source": "digitalmarketinginstitute.com",
      "category": "Marketing",
      "published_date": null,
      "author": "",
      "content": "Web Design, CRO and UX Showing 1 - 24 of 1316 Articles 9 Marketing Tips for Black Friday Email Marketing Skills That Boost Open & Click Rates How To Find a Digital Marketing Job in 2025 PPC & Paid Media Skills That Multiply ROI Content Marketing Skills That Turn Readers Into Customers Google Algorithm Updates: What do They Mean for Brands and Marketers? Top SEO Skills Every Digital Marketer Needs in 2025 How Hello Sunshine Mastered Content Marketing The Ultimate Guide to Marketing Automation Why LinkedIn Feels Like Facebook in 2017 How to Use Substack as a Marketing Tool for Your Business 8 Steps to a Digital Marketing Strategy for Small Businesses How to Make your Digital Marketing More Inclusive for Neurodivergent Consumers Paid vs Organic Search – How to Find the Right Balance Premium Content - Professional Members Only Apple: A Masterclass in Style and Branding Link Detoxing: Improve Your Backlink Profile Through Backlink Removal How to Write A Marketing Email Why First-Party Data is Important and How Marketers Can Collect and Use it 10 Digital Skills That Can Make Students Instantly Employable in 2025 10 Steps to Building Your Personal Brand on Social Media White Hat and Black Hat SEO Best Practices in the Age of AI 10 Strategies for a Successful UX Project 4 Lessons Digital Marketers Can Take From Taylor Swift's Marketing Strategy"
    },
    {
      "title": "Blog & Articles | Digital Marketing Institute",
      "description": "Blog & Articles page of DMI, the global certification standard in digital marketing education.",
      "url": "https://digitalmarketinginstitute.com/blog/category/digital-strategy",
      "source": "digitalmarketinginstitute.com",
      "category": "Marketing",
      "published_date": null,
      "author": "",
      "content": "Web Design, CRO and UX Showing 1 - 24 of 199 Articles 9 Marketing Tips for Black Friday Google Algorithm Updates: What do They Mean for Brands and Marketers? The Ultimate Guide to Marketing Automation How to Make your Digital Marketing More Inclusive for Neurodivergent Consumers 4 Lessons Digital Marketers Can Take From Taylor Swift's Marketing Strategy What are the Best Drop Shipping Business Ideas for Your Brand? How to Use X for Business The Unstoppable Success of Netflix What Are the Most Effective Digital Marketing Strategies? How to Do a Competitive Analysis in Digital Marketing 12 Examples of Powerful Brand Collaborations How to use the 7Ps Marketing Mix From Reviews to Real Time Strategy: Optimum Nutrition's AI Framework for Measuring Success 16 Brands Doing Corporate Social Responsibility Successfully The Creative Journey: From Idea to Impact What are the Digital Marketing Trends for 2025? Is Your Website Working For Your Business? How to Use AI Agents for Your Digital Marketing What is Greenwashing in Marketing? The Marketer’s Guide to Running a Successful Customer Loyalty Program SWOT Analysis for Digital Marketing: Guide and Template How to Conduct a Successful Digital Marketing Audit"
    },
    {
      "title": "Blog & Articles | Digital Marketing Institute",
      "description": "Blog & Articles page of DMI, the global certification standard in digital marketing education.",
      "url": "https://digitalmarketinginstitute.com/blog/category/digital-marketing",
      "source": "digitalmarketinginstitute.com",
      "category": "Marketing",
      "published_date": null,
      "author": "",
      "content": "Web Design, CRO and UX Showing 1 - 24 of 108 Articles How to Use Substack as a Marketing Tool for Your Business Why First-Party Data is Important and How Marketers Can Collect and Use it Which Countries Have the Most Demand for Digital Marketers? 5 Key Elements of a Killer LinkedIn Summary (& 5 Great Hacks) How to Build Links for SEO How to Successfully Set & Manage PPC Budgets 5 Classic Examples of How Not to Do Digital Marketing How to Do a Competitive Analysis in Digital Marketing 8 Digital Skills That Will Increase Your Salary Your Handy Guide to Wage Negotiation How Much Can a Freelance Digital Marketer Make? How to use the 7Ps Marketing Mix What is Audience Listening & How Can You Do It Effectively? 8 Essential Skills Every Digital Marketer Needs How to Create a Summer Marketing Campaign that Cuts Through the Noise How to Choose the Best Social Media Channels for Your Business 16 Brands Doing Corporate Social Responsibility Successfully What are the Digital Marketing Trends for 2025? AI in Digital Marketing - The Ultimate Guide The State of Higher Education - 21 Statistics You Should Know in 2025 10 Eye Opening AI Marketing Stats in 2025 How to Generate High-Quality Leads"
    },
    {
      "title": "LinkedIn Login, Sign in | LinkedIn",
      "description": "Login to LinkedIn to keep in touch with people you know, share ideas, and build your career.",
      "url": "http://www.linkedin.com/shareArticle?mini=true&url=https://digitalmarketinginstitute.com/digital-marketing-trends-2025&source=digitalmarketinginstitute.com",
      "source": "digitalmarketinginstitute.com",
      "category": "Marketing",
      "published_date": null,
      "author": "",
      "content": "Click on the link to sign in instantly to your LinkedIn account. If you don’t see the email in your inbox, check your spam folder. By clicking Continue, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy ."
    },
    {
      "title": "Digital Marketing Courses Online | Flexible Study, All Levels | DMI",
      "description": "Meet the change makers from top global brands who help shape our courses.",
      "url": "https://digitalmarketinginstitute.com/blog/courses",
      "source": "digitalmarketinginstitute.com",
      "category": "Marketing",
      "published_date": null,
      "author": "",
      "content": "Meet the change makers from top global brands who help shape our courses. Join our passionate team empowering marketers around the world. Recent press and media releases to delve into about DMI’s latest developments. Contact us anytime, anywhere. We are here to help. Partner with us to provide your students with industry-validated content and certifications. Partner with us to add globally recognised digital marketing certifications to your portfolio. Discover the organisations preparing their students for career success. Learn how our partners gained a competitive edge with our digital programs. ✓ Courses recommended based on your results ✓ Compare to peers ✓ Takes 15mins Showing 6 of 30 Courses We’ve been delivering high quality Digital Marketing Training for businesses for over 12 years. Get team access to elite digital marketing training. ⭧ Sale On | Get Up To 30% OFF | Meet the change makers from top global brands who help shape our courses. Join our passionate team empowering marketers around the world. Recent press and media releases to delve into about DMI’s latest developments. Contact us anytime, anywhere. We are here to help. Partner with us to provide your students with industry-validated content and certifications. Partner with us to add globally recognised digital marketing certifications to your portfolio. Discover the organisations preparing their students for career success. Learn how our partners gained a competitive edge with our digital programs. ✓ Courses recommended based on your results ✓ Compare to peers ✓ Takes 15mins Showing 6 of 30 Courses We’ve been delivering high quality Digital Marketing Training for businesses for over 12 years. Get team access to elite digital marketing training."
    },
    {
      "title": "Blog & Articles | Digital Marketing Institute",
      "description": "Blog & Articles page of DMI, the global certification standard in digital marketing education.",
      "url": "https://digitalmarketinginstitute.com/blog-topics",
      "source": "digitalmarketinginstitute.com",
      "category": "Marketing",
      "published_date": null,
      "author": "",
      "content": "Discover what's happening in Digital Marketing."
    },
    {
      "title": "Ahora puedes escanear documentos en WhatsApp en segundos y enviarlos como PDF: así puedes hacerlo paso a paso - Applesfera",
      "description": "Ahora puedes escanear documentos en WhatsApp en segundos y enviarlos como PDF: así puedes hacerlo paso a paso&nbsp;&nbsp;ApplesferaPaso a paso: cómo escanear documentos en WhatsApp para enviarlos como PDF&nbsp;&nbsp;La NaciónCómo funciona la nueva herramienta de WhatsApp para escanear documentos y mandarlos como PDF&nbsp;&nbsp;AmbitoLa guía para escanear un PDF con WhatsApp desde el celular, paso a paso&nbsp;&nbsp;TyC SportsAdiós al cibercafé: WhatApp ya te deja escanear documentos y mandarlos en segundos sólo en estos celulares; as&nbsp;&nbsp;MILENIO",
      "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxPNHZ5MHVnWFg5alBtLVJXdU9rVWVDYUFXWUJEXzdWWnZJTVlOV2htTGFBLTBDZTBBODBsS0c1VUZuYVRtb25WeEotTHRYc3dmSEdTd2lBTDl4MFIzd0lfTVNKV0RhVmRmbHNTTmdFa2hKOXMxX215X09nU3VJTzZvd1VqaS1BTzJIWXJyb2FIZnowNHU2Tk01d2NBekJ3OHc4N2NUWUh2R2ZoZVVMaHNiRmZGT3VUeGNCSGtjcWR0UV9FZEZzVWNwbFpJWnVNLU9aMWxreg?oc=5",
      "source": "news.google.com",
      "category": "Marketing",
      "published_date": "Mon, 06 Oct 2025 10:00:45 GMT",
      "author": null,
      "content": ""
    },
    {
      "title": "Sora 2, al detalle: cómo usar la polémica app viral de OpenAI que permite poner tu cara en cualquier video - Clarin.com",
      "description": "Sora 2, al detalle: cómo usar la polémica app viral de OpenAI que permite poner tu cara en cualquier video&nbsp;&nbsp;Clarin.comOpenAI promete reforzar los derechos de autor en los videos de Sora&nbsp;&nbsp;La NaciónSora, la app de OpenAI que genera videos hiperrealistas, también puede crear deepfakes de ti mismo&nbsp;&nbsp;InfobaeLa nueva red social de OpenAI promete dominar el algoritmo de la fantasía&nbsp;&nbsp;La GacetaLa batalla por tu atención: cómo Google, Meta y OpenAI compiten por fabricar la realidad&nbsp;&nbsp;Rosario3",
      "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxPRHR5Mk14YXRBd0R0QjhCU283dktiVmYxUlE3clZYVjh0OGQyOHpIVVFSZGFyUVZRczJVM3RrQUZ2Yk1HV2tiN05sVHIzSVpKRnB1dWY0dWo4TXZhZkxqZDlYMmM0S3RTS0Fta1BLWVdHN252SE9jdlc3dVNQMFFWaDJyOWVpbW9uejBPYVlaeC1lbDZDZGhmbVl1ZUtwX05fMGhBQXplaFNwQlJUYjByRUY4djRzX05oajNOQ1RTRFIxd195ZzBCdGZncW7SAdIBQVVfeXFMT3RUS1VRYU5INldfSnMzbWNia3podWQ1NUo3MURXaE1waU0wUFduZWV0RmstMGRwYllDT0ZJbXFuX3JMbUt0UThMd0Q0ZC1KMGxyVkpEeUFYNTliY19hcEhmbGl2QlFRRDVrbWhpa0lVSVBraTJwMEREOWQ3d0VvbkNaYnRiMTNyTWk4OWM2eFBQZ0FPcUVWYTdxSnJQT21zOFRUNE1OVVFOQU4zSWx4YWFkQmxQbUg2LXR2TkJTaFRSX3JaeVN6Q190aEtJSmdYREl3?oc=5",
      "source": "news.google.com",
      "category": "Marketing",
      "published_date": "Mon, 06 Oct 2025 08:45:23 GMT",
      "author": null,
      "content": ""
    },
    {
      "title": "Un asteroide del tamaño de un sofá pasó a solo 400 km de la Tierra - Rosario3",
      "description": "Un asteroide del tamaño de un sofá pasó a solo 400 km de la Tierra&nbsp;&nbsp;Rosario3¿Dormías el 1 de octubre a las 2.49 de la madrugada? Un asteroide casi impacta en la Tierra&nbsp;&nbsp;National Geographic EspañaLa NASA lo confirma: un asteroide pasó a escasos 400 km de la Tierra hace solo una semana y el sistema de defensa planetaria no lo detectó&nbsp;&nbsp;El ConfidencialUn pequeño asteroide pasó muy cerca de la Tierra y fue detectado horas después&nbsp;&nbsp;El EspectadorAsí es el inesperado asteroide que habría 'rozado' la Tierra en los últimos días&nbsp;&nbsp;El Debate",
      "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxOTnBvaDNVNXBOZUhUMm1LTDE3Z01VNWNYRExsbFA0QkVtaWktSS0yMXVxcHdyeENKTDBaQ21YNy15WThrTUVtbFFCd2FWalB6amY5dFBhYk8wODBtQUFHSWVmblRpTlhuOElnZnNnMFRfdWMtR1Q5emJMUWw4akp0dmx5aC1PaEZ3VDBQYklael9IbEhNMUhOaDAwZWtCWG8xbnI2VlBZVEs2ME9lZnJUM0xIcGpzZ0V6M1hLMVQxbFZDMVV3c3I2cNIByAFBVV95cUxOTnBvaDNVNXBOZUhUMm1LTDE3Z01VNWNYRExsbFA0QkVtaWktSS0yMXVxcHdyeENKTDBaQ21YNy15WThrTUVtbFFCd2FWalB6amY5dFBhYk8wODBtQUFHSWVmblRpTlhuOElnZnNnMFRfdWMtR1Q5emJMUWw4akp0dmx5aC1PaEZ3VDBQYklael9IbEhNMUhOaDAwZWtCWG8xbnI2VlBZVEs2ME9lZnJUM0xIcGpzZ0V6M1hLMVQxbFZDMVV3c3I2cA?oc=5",
      "source": "news.google.com",
      "category": "Marketing",
      "published_date": "Tue, 07 Oct 2025 10:41:00 GMT",
      "author": null,
      "content": ""
    },
    {
      "title": "Cómo conectarse a una red WiFi sin saber la contraseña: las formas más fáciles y rápidas - Infobae",
      "description": "Cómo conectarse a una red WiFi sin saber la contraseña: las formas más fáciles y rápidas&nbsp;&nbsp;Infobae",
      "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxNay0wQ2JVOUxSY2RMNEtId25TQ1NtcGt3amxBTGhFaUd6dm5PTkRsbU8tNUJpcmZ4TzV1VGc5RFNWMzNYSkV3MWxINzN4NXRIOTR0M1pzSjc1cWI4THJWX0dlS2RxTGN6YmFaUFVHLW1hUHlvbHBmUDVxbHJ3R0dhdEo2ekhMTlpTdHJxNC01M2FkLUd2Y2lLNnktSEJzY29vNzJ4eE1LRFhxX0VpUFJOM3ZXRWxNYjg2X2ZNNFFpZHUtVlZndUZlTNIB4wFBVV95cUxPRnlvQUNOT19ES3h4LTdxbVdOYWYzQUNnRThkWU1qYW1GaGlUWHVwUHI0MUFINS1sUmh2TjI2TjVHbnV1UWx6SHZuSTRac1dvRDMyd05Wc09pVE0xVDR5dmF3UjRKZENVMmpaTkVwT0dHLUtyU0NfcFhBY1BSWkZra0Zjc0d1VEVwanFsaUJFZTFPMFZmOGJFVHdjeG1lcjNNX2Y0eVVUVmZWdzdkYzVtd3VoZk9TV2k4MDJGWGYteFRPU29LYWx3ZVREdlZfSmIwY2pTYmlvQmFuMi1mT05yVVUwNA?oc=5",
      "source": "news.google.com",
      "category": "Marketing",
      "published_date": "Mon, 06 Oct 2025 19:05:00 GMT",
      "author": null,
      "content": ""
    },
    {
      "title": "Marte tuvo la mejor vista del cometa 3I/ATLAS: así observaron las misiones espaciales al tercer visitante interestelar de la historia | MAG - El Comercio Perú",
      "description": "Marte tuvo la mejor vista del cometa 3I/ATLAS: así observaron las misiones espaciales al tercer visitante interestelar de la historia | MAG&nbsp;&nbsp;El Comercio Perú3I/ATLAS, el extraño cometa que desconcierta a los astrónomos y dispara teorías alienígenas&nbsp;&nbsp;Clarin.comEl cometa 3I/ATLAS, un enigma interestelar que desafía las fronteras del sistema solar&nbsp;&nbsp;LaSexta3I/Atlas, el cometa que desconcierta a la ciencia, podría provenir de la frontera más “salvaje” de la galaxia&nbsp;&nbsp;La GacetaAvi Loeb explica la forma “cilíndrica” de 3I/ATLAS: NASA guarda silencio&nbsp;&nbsp;Eme Equis",
      "url": "https://news.google.com/rss/articles/CBMi5gFBVV95cUxNZ0Q1c3VUbWFrb1VHYW9PQmFESjFhREJKbWtBazZRY2M4YXpZdTVpWTFHQmtpSy0tbGhaZGh1Tk00WjVENUc4UUNMS3dOR3lEWVhuMEdMV2ZqM0VFY05iOE1MZjRrZkdTRG51NVNhcTdqY2NKUTRRQ1ViaEJFYVFaZkFwTjhjdnNhVnpCbGktYzJqNG5HdmJfMU93TTNhT0pBRi1uZVB1cXhoaVczRU8tZnZtOTJ0MHB1UmNjSzdvaVlQLUc5X1YxMjJDVHVJbGlIeGlUMm42WXZaMll2bHJXbDBkWEF0UQ?oc=5",
      "source": "news.google.com",
      "category": "Marketing",
      "published_date": "Mon, 06 Oct 2025 13:29:50 GMT",
      "author": null,
      "content": ""
    },
    {
      "title": "Un santiagueño participó del evento mundial “Observe the Moon” promovido por la NASA - Diario Panorama",
      "description": "Un santiagueño participó del evento mundial “Observe the Moon” promovido por la NASA&nbsp;&nbsp;Diario PanoramaRío Gallegos se sumó a la Noche Internacional de Observación de la Luna 2025&nbsp;&nbsp;Tiempo SurGualeguaychú se suma a la Noche Internacional de Observación de la Luna&nbsp;&nbsp;El Día de GualeguaychúCentro de Ciencias de Sinaloa celebra la Noche Internacional de Observar la Luna&nbsp;&nbsp;www.noroeste.com.mxAficionados a la astronomía celebran la Noche Internacional de Observación de la Luna&nbsp;&nbsp;Universidad Politécnica de Cartagena",
      "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQdkNZcFozc0MzT1AyZ2xqWE5DRzBMc3pQdnBkLU80RHRnU3NKb1dCU0lWMl9feEYwX0tLYXV3Z2FPZ1RjTDNrNzlqT3R2QVhFTkoyQTV5cENyV2VVU2F0T0lwZmxMNC05SmhXQndmUmxGZ1dGSzNoUmx2TXRfOXlENEhTR294LTMwRmlGN1VpbnB0U2U5dHJfLTFBLVhPcTY1RFMxdlJhbEs5cEVqWjBTZVY2MGQ?oc=5",
      "source": "news.google.com",
      "category": "Marketing",
      "published_date": "Mon, 06 Oct 2025 22:52:24 GMT",
      "author": null,
      "content": ""
    },
    {
      "title": "¿Cómo duplicar la pantalla del celular en el Smart TV sin cables? - TyC Sports",
      "description": "¿Cómo duplicar la pantalla del celular en el Smart TV sin cables?&nbsp;&nbsp;TyC SportsVer cobertura completa en Google Noticias",
      "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxPbzFJb2dtVWduaGdUOXAtbUZRY3J2MnpMT1ZqYlFUdFZNWlN6N0QzaTczNXZhU2dwYzhUQUh5MGV6eGFLSmQwNU5naDNKUDEwcmgyRFVoWWNfQ01LM2lKV3ZvUXRvWE9MZm5aRHpYZ08waGxjWlAxNTBwZmZ3Y1lCekVyNXdCeWZ5TXR6ZjFZSkdvYUtVVk1nOE5mb1hQMC0tX0JPQ1ljUEt3eEdOdmEtdHE5MFFQNVZsZHhZ?oc=5",
      "source": "news.google.com",
      "category": "Marketing",
      "published_date": "Mon, 06 Oct 2025 10:39:02 GMT",
      "author": null,
      "content": ""
    },
    {
      "title": "El cambio más esperado de Windows 11 por fin es una realidad: la forma de ver la interfaz cambia para siempre - Hipertextual",
      "description": "El cambio más esperado de Windows 11 por fin es una realidad: la forma de ver la interfaz cambia para siempre&nbsp;&nbsp;HipertextualWindows 11 va a cambiar para siempre: el nuevo modo oscuro es justo lo que llevábamos años pidiendo a Microsoft&nbsp;&nbsp;MSNEl modo oscuro de Windows se renovará muy pronto y es justo lo que pedíamos desde hace años&nbsp;&nbsp;Computer HoyWindows 11 finalmente arregla los últimos temas de luz en el modo oscuro del explorador de archivos&nbsp;&nbsp;elpueblo.pePowerToys soluciona una de las mayores quejas para la interfaz de Windows con su nueva herramienta&nbsp;&nbsp;SoftZone",
      "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxOYVhzaUdLc2RPYkE0VmZOS2R5TFBRX2FMVEZfLTNaUXA3bVd0cEdhVTFwcE93ODRhdzl2bHlicHNGbHFxeHIwZ0NQZmhJUUlYWkFSMndNUkhweThsR2Q1WkdDUjk5ZzJDVFhlQWFPRWNKZlZOd1VnX2xpOGRYa0c1YW9SZ0lVQmtMZTNfN045bDVYdEhTZElmcmtzc0xsZDR4SnRaMFVVMUQycGJPTkozeWZBdG8tWWdqNFp6NC1kb3BUSmxVQUpMaHZhelQtVTBtbGx2bkE2LWlZMUk?oc=5",
      "source": "news.google.com",
      "category": "Marketing",
      "published_date": "Mon, 06 Oct 2025 11:27:30 GMT",
      "author": null,
      "content": ""
    },
    {
      "title": "Dollar Tree expands distribution network in Arizona and Oklahoma",
      "description": "Dollar Tree Inc. is expanding its logistics network with two major distribution center projects in Arizona and Oklahoma, adding more than 2 million square feet of capacity and 800 jobs. The projects reflect the company’s strategy to strengthen regional supply chain resilience and support store growth across the U.S. The retailer has purchased a 1.25-million-square-foot [&#8230;] The post Dollar Tree expands distribution network in Arizona and Oklahoma appeared first on Digital Commerce 360.",
      "url": "https://www.digitalcommerce360.com/2025/10/06/dollar-tree-expands-distribution-network-in-arizona-and-oklahoma/",
      "source": "digitalcommerce360.com",
      "category": "Marketing",
      "published_date": "Mon, 06 Oct 2025 14:54:20 +0000",
      "author": "Mark Brohan",
      "content": "Dollar Tree Inc. is expanding its logistics network with two major distribution center projects in Arizona and Oklahoma, adding more than 2 million square feet of capacity and 800 jobs. The projects reflect the company’s strategy to strengthen regional supply chain resilience and support store growth across the U.S. The retailer has purchased a 1.25-million-square-foot facility in Litchfield Park, Arizona, west of Phoenix. The modern, climate-controlled site—located in the Park303 industrial corridor—is scheduled to open in spring 2026 and employ about 400 people. It will serve Dollar Tree and Family Dollar stores across Arizona, Colorado, Nevada, New Mexico, and Utah. “Our new distribution center will strengthen our supply chain in the Southwest, enabling us to serve stores with greater speed and efficiency,” said Roxanne Weng, Dollar Tree’s chief supply chain officer. “It ensures that the value our customers count on—and the exciting new treasures they look forward to—are always in stock.” Dollar Tree paid about $147 million for the property, according to public filings. Local officials say the investment reinforces the Phoenix area’s position as a key Western distribution hub. In Marietta, Oklahoma, the company broke ground on a new 1-million-square-foot distribution center that will replace a facility destroyed by a tornado in 2024. The new center is expected to open in spring 2027 and employ about 400 people while serving approximately 700 stores across the West and Southwest. “Our rebuilt distribution center demonstrates our commitment to the region, inspired by the community’s strength and resiliency,” said Mike Creedon, Dollar Tree’s chief executive officer. “We look forward to welcoming back many of our former associates, creating hundreds of new jobs, and continuing to strengthen our foundation for the future.” Dollar Tree operates more than 16,000 Dollar Tree and Family Dollar stores across the U.S. and Canada. The two projects bring their total distribution network to more than 30 facilities. Retail analysts say the expansions reflect a broader industry push to diversify logistics operations and build redundancy against disruptions. By investing in both Arizona and Oklahoma, Dollar Tree is increasing its operational flexibility while supporting community recovery and long-term growth. The Litchfield Park center is slated to open in 2026, followed by the Marietta rebuild in 2027, two milestones that mark a renewed focus on efficiency and resilience for the $30 billion retailer. Sign up for a complimentary subscription to Digital Commerce 360 B2B News . It covers technology and business trends in the growing B2B ecommerce industry. Contact Mark Brohan, senior vice president of B2B and Market Research, at mark@digitalcommerce360.com . Follow him on Twitter @markbrohan. Follow us on LinkedIn , X (formerly Twitter) , Facebook and YouTube ."
    },
    {
      "title": "Roadrunner launches AI delivery system to speed up ecommerce logistics",
      "description": "Roadrunner is taking another step in its transformation from turnaround story to technology-driven carrier, announcing the full rollout of its new enterprise-wide pick-up and delivery (P&#38;D) software. The system, which integrates advanced track-and-trace functionality, aims to virtually eliminate missed pickups and give shippers e-commerce-grade visibility into long-haul freight. Once considered one of the least reliable [&#8230;] The post Roadrunner launches AI delivery system to speed up ecommerce logistics appeared first on Digital Commerce 360.",
      "url": "https://www.digitalcommerce360.com/2025/10/06/roadrunner-launches-ai-delivery-system-to-speed-up-ecommerce-delivery/",
      "source": "digitalcommerce360.com",
      "category": "Marketing",
      "published_date": "Mon, 06 Oct 2025 14:52:50 +0000",
      "author": "Mark Brohan",
      "content": "Roadrunner is taking another step in its transformation from turnaround story to technology-driven carrier, announcing the full rollout of its new enterprise-wide pick-up and delivery (P&D) software. The system, which integrates advanced track-and-trace functionality, aims to virtually eliminate missed pickups and give shippers e-commerce-grade visibility into long-haul freight. Once considered one of the least reliable carriers in the less-than-truckload (LTL) market, Roadrunner struggled with nearly 30% missed pickups early in the 2020s. Company leaders say that rate has now dropped below half a percent, thanks to investments in routing, automation, and network redesign. The new software, deployed across all of Roadrunner’s brick-and-mortar terminals, represents the next phase of that digital overhaul — extending the visibility that parcel, and ecommerce companies have long offered into the traditionally slower-moving LTL segment. David Rumpf, Roadrunner’s vice president of technology, said the platform uses artificial intelligence to optimize driver routes using algorithms modeled on the “traveling salesman problem,” balancing efficiency with predictable service windows. The software adds real-time tracking, automated text and email notifications, and a pilot program for self-service appointment scheduling. Customers can view shipment status in real time and see precise pickup and delivery times through the company’s website. The goal is to close the visibility gap between LTL freight and the consumer delivery experience. As retailers and distributors increasingly rely on omnichannel logistics, carriers are under pressure to match the transparency of ecommerce networks that give end users live updates from warehouse to doorstep. Roadrunner executives said the system’s track-and-trace layer is designed to bring that same expectation to the long-haul freight sector, providing shippers with the ability to monitor freight movement and make data-driven scheduling decisions. Tomasz Jamroz, Roadrunner’s president and chief operating officer, said the new tools not only enhance shipper visibility but also benefit the company’s network of owner-operators. By reducing idling and unnecessary miles, the AI-powered routing helps drivers complete more jobs in less time and with lower fuel costs. Those gains, he said, translate into faster, more reliable service for customers, an increasingly important factor for ecommerce sellers managing regional distribution centers or direct-to-consumer fulfillment. The rollout caps a period of rapid reinvention for Roadrunner, which has invested heavily in digital systems after years of restructuring. While the company’s leadership continues to frame its comeback as complete, the competitive pressure remains intense. Larger carriers such as Old Dominion, XPO, and FedEx Freight have also poured resources into automation and digital visibility tools, particularly as e-commerce shipments blur the traditional lines between ..."
    },
    {
      "title": "Omnichannel B2B buyers want their digital voices heard",
      "description": "A recent study by Hokodo, the B2B Ecommerce Association, and Greenwood Consulting surveyed 300 buyers and underscored the growing dominance of ecommerce in the B2B sector. Three-quarters (73%) of respondents said webstores, online marketplaces, and mobile apps are now their preferred purchasing channels. The findings also revealed that 97% of buyers view a fast, simple, [&#8230;] The post Omnichannel B2B buyers want their digital voices heard appeared first on Digital Commerce 360.",
      "url": "https://www.digitalcommerce360.com/2025/10/06/omnichannel-b2b-buyers-want-their-digital-voices-heard/",
      "source": "digitalcommerce360.com",
      "category": "Marketing",
      "published_date": "Mon, 06 Oct 2025 14:50:20 +0000",
      "author": "Mark Brohan",
      "content": "A recent study by Hokodo, the B2B Ecommerce Association, and Greenwood Consulting surveyed 300 buyers and underscored the growing dominance of ecommerce in the B2B sector. Three-quarters (73%) of respondents said webstores, online marketplaces, and mobile apps are now their preferred purchasing channels. The findings also revealed that 97% of buyers view a fast, simple, and accurate online experience as essential. Yet, despite the strength of digital commerce, buyers are not ready to abandon human interaction entirely. In 2025, expectations have shifted toward integrated omnichannel experiences, with 84% of buyers saying it is important for sellers to operate across multiple online and offline channels, according to data and analysis contained in the recently published 2025 The State of B2B Omnichannel Best Practices Report from Digital Commerce 360. In a reversal of pandemic-era trends, face-to-face sales are regaining traction. More than half (56%) of respondents said they still buy in physical stores, and 23% expressed a clear preference for in-person engagement. The study also highlighted shifting payment behaviors. Many buyers are moving away from credit cards due to inefficiencies and fees—80% now prefer bank transfers, and 57% favor direct debit. Payment terms remain a decisive factor: 78% of buyers consider them essential when selecting suppliers, and two-thirds have abandoned purchases when no terms were offered. “Our research found that 84% of B2B buyers want suppliers to be active across several different sales channels, while just 7% consider it unimportant,” the report noted. “The vast majority of buyers (94%) agree that an omnichannel sales model is as effective as—or more effective than—previous sales models.” Taken together, the results highlight a clear message for B2B organizations: digital engagement alone is no longer enough. Buyers now expect seamless, frictionless experiences that span web, mobile, and physical environments—supported by flexible payment and service options. Companies that fail to deliver on these expectations risk losing market share to competitors with stronger omnichannel capabilities. Bay Fastening Systems is one distributor responding to this shift. The New York-based master distributor—known for engineered fasteners such as rivets, bolts, threaded inserts, and tools—serves industries ranging from renewable energy to construction and manufacturing. Through its Bay Supply division, the company operates the Fastener Source & Supply Network, an online marketplace that connects more than 44,000 registered buyers with supplier inventories. The platform supports “Buy Now” transactions, automated quoting, and buyer request-for-quote syndication. Digital sales now account for 34% of Bay’s revenue, a share that continues to rise as the company deepens its omnichannel strategy. Sign up for a complimentary subscription to Digital Commerce 360 B2B News . It covers technology and business trends in the growing B2B ec..."
    },
    {
      "title": "DoorDash debuts new fulfillment services and delivery robot for retailers",
      "description": "DoorDash is pushing beyond its roots as a delivery app, rolling out new tools, including a delivery robot, to help retailers move products to customers faster. At its Dash Forward 2025 event on Sept. 30, the company introduced DashMart Fulfillment Services. Those services are already in use at CVS and Party City, with Kroger slated [&#8230;] The post DoorDash debuts new fulfillment services and delivery robot for retailers appeared first on Digital Commerce 360.",
      "url": "https://www.digitalcommerce360.com/2025/10/03/doordash-dot-delivery-robot/",
      "source": "digitalcommerce360.com",
      "category": "Marketing",
      "published_date": "Fri, 03 Oct 2025 21:23:33 +0000",
      "author": "Beth Duckett",
      "content": "DoorDash is pushing beyond its roots as a delivery app, rolling out new tools, including a delivery robot, to help retailers move products to customers faster. At its Dash Forward 2025 event on Sept. 30, the company introduced DashMart Fulfillment Services. Those services are already in use at CVS and Party City, with Kroger slated to follow. The company also announced Dot, DoorDash’s first delivery robot, which was developed entirely in-house. According to DoorDash, DashMart Fulfillment Services, a logistics service for retailers, manages inventory, packing and last-mile delivery. All of this is done at DoorDash-operated hubs, known as DashMarts. Dot, meanwhile, adds an automated option for short delivery trips. It slots into the same system that powers the rest of the company’s network. Together, the launches signal DoorDash’s push to evolve from a meal delivery marketplace into an end-to-end logistics partner. “Our journey began with restaurant delivery, and over the past several years we have evolved into a global, multi-product, multi-line of business company that is shaping the future of local commerce,” said Tony Xu, co-founder and CEO of DoorDash, in the announcement. For retailers, that shift is already underway through DashMart Fulfillment Services. The model handles storing, packing, and delivering products from DashMart locations, which are delivery-focused hubs owned and operated by DoorDash. The company describes the service as a way for retailers to sell online. They can do so either through DoorDash or their own channels, without managing inventory or last-mile logistics themselves. Orders are fulfilled directly from more than 100 DashMart sites using its fleet of Dashers, a setup DoorDash says operates with “near-perfect order accuracy.” So far, adoption includes CVS Pharmacy and Party City, with Kroger set to join soon. Party City, which filed for bankruptcy in 2024, has continued operating online through channels such as PartyCity.com , Walmart and Amazon. The retailer is already using DashMart Fulfillment Services to reach consumers in most major metro areas, with its party supplies delivered the same day from either its own site or the DoorDash app. In addition, DashMart is carrying healthcare essentials from CVS Pharmacy, which customers can order at any time as the 24/7 hubs run continuously, even on holidays, the company said. At the same time, Kroger is set to join DashMart Fulfillment Services, though DoorDash has not disclosed where it will begin using the model. The company says the partnership will eventually bring a “wide selection of groceries and household essentials” to shoppers through DashMart. Separately, Kroger on Sept. 29 said it is expanding its DoorDash partnership to Kroger’s 2,700 U.S. stores . The companies first partnered in 2022 for limited delivery of sushi, flowers and prepared meals. With this broader rollout, DoorDash is taking on a larger share of Kroger’s third-party delivery mix, which also incl..."
    },
    {
      "title": "Kroger adds DoorDash delivery for thousands of its stores",
      "description": "Grocery giant Kroger announced a partnership this week with DoorDash on Sept. 29, bringing approximately 2,700 grocery stores to the delivery service's platform immediately. The fulfillment option will expand Kroger's grocery delivery offerings, which have already seen billions of dollars committed to robotic ecommerce fulfillment centers through work with the U.K.-based Ocado Group. Kroger ranks No. [&#8230;] The post Kroger adds DoorDash delivery for thousands of its stores appeared first on Digital Commerce 360.",
      "url": "https://www.digitalcommerce360.com/2025/10/03/kroger-adds-doordash-delivery-for-thousands-of-its-stores/",
      "source": "digitalcommerce360.com",
      "category": "Marketing",
      "published_date": "Fri, 03 Oct 2025 18:04:17 +0000",
      "author": "Kevin Williams",
      "content": "Grocery giant Kroger announced a partnership this week with DoorDash on Sept. 29, bringing approximately 2,700 grocery stores to the delivery service’s platform immediately. The fulfillment option will expand Kroger’s grocery delivery offerings, which have already seen billions of dollars committed to robotic ecommerce fulfillment centers through work with the U.K.-based Ocado Group. Kroger ranks No. 6 in Digital Commerce 360’s Top 2000 Database . The database ranks North America’s largest online retailers by their annual ecommerce sales. Kroger is No. 1 in the database’s Food & Beverage category . However, it also competes with Mass Merchants — including Walmart, Target and Costco — that rank higher in the Top 2000 for online grocery sales. Digital Commerce 360 projects that Kroger online sales will reach $19.98 billion in 2025. “Customers are looking for more convenient ways to shop at their local Kroger store, and delivery is an increasingly important way they engage with us,” said Yael Cosset, executive vice president and chief digital officer for Kroger. “We want to provide customers what they want, how they want it, without asking them to compromise on value.” This is one of Cosset’s first big initiatives since he was tapped to helm Kroger’s new ecommerce division earlier this year. A spokesman for Kroger did not return a request for additional comments or context about the partnership with DoorDash. DoorDash heralded the new arrangement. “With Kroger now on DoorDash nationwide, millions of customers can shop the largest grocer on our platform with the convenience of on-demand delivery,” said Prabir Adarkar, president and chief operating officer of DoorDash. DoorDash’s delivery infrastructure contrasts with the grocer’s robotics- and fulfillment center-oriented partnership with Ocado Group. Meanwhile, there has been some speculation that Kroger is rethinking its robotics investment. Nevertheless, one industry analyst assessed that the two methodologies can live together in the same portfolio. Joe Serrano, global managing partner of retail and CPG at the global technology firm HTEC, assessed that while Kroger has its own delivery channels, DoorDash brings millions of active users to them who may never download the Kroger app. “Thin margins are a trade Kroger will make,” Serrano said. “In grocery, volume and velocity beat margin purity.” And while Kroger is expanding its use of robotics internally, DoorDash is turnkey and quick. “Ocado gave Kroger robotics and centralized efficiency, but it is slow and capital heavy, where DoorDash gives instant reach, flexible last mile, and consumer visibility overnight,” Serrano noted. Serrano said that Kroger is playing it smart by developing a diverse portfolio of channels. “Use robots where they pay off,” Serrano said. “Use gig networks where they scale.” He credited Ocado with bringing robotics and Kroger’s 84.51° division for data science. “All of that now feeds into DoorDash’s last-mile infrastructur..."
    },
    {
      "title": "MAI launches AI agents for digital ads with $25 million investment",
      "description": "Marketing technology startup MAI has launched an artificial intelligence platform designed to autonomously run digital ad campaigns, while also announcing a $25 million seed funding round led by Kleiner Perkins with participation from Gaorong Ventures, UpHonest Capital and others. The San Francisco company said its AI agents are already generating results for ecommerce clients, driving [&#8230;] The post MAI launches AI agents for digital ads with $25 million investment appeared first on Digital Commerce 360.",
      "url": "https://www.digitalcommerce360.com/2025/10/03/mai-launches-ai-agents-for-digital-ads-with-25-million-investment/",
      "source": "digitalcommerce360.com",
      "category": "Marketing",
      "published_date": "Fri, 03 Oct 2025 17:13:45 +0000",
      "author": "Mark Brohan",
      "content": "Marketing technology startup MAI has launched an artificial intelligence platform designed to autonomously run digital ad campaigns, while also announcing a $25 million seed funding round led by Kleiner Perkins with participation from Gaorong Ventures, UpHonest Capital and others. The San Francisco company said its AI agents are already generating results for ecommerce clients, driving 40% higher sales, and managing millions of dollars in Google Ads spending each month. The funding will be used to grow MAI’s engineering staff and accelerate product development. Founded by former Google and Instacart engineers Yuchen Wu and Jian Wang, MAI is pitching itself as a way for small and mid-sized businesses to access enterprise-level ad tools without the cost of agencies or the burden of manual campaign management. “Digital advertising is one of the hardest growth levers for businesses to master,” Wu, MAI’s co-founder and CEO. “Our agents do the heavy lifting, driving results autonomously, so business owners can focus on building their companies.” MAI’s agents use real-time optimization to adjust bids, budgets and creative assets around the clock, the company said. They also integrate with a retailer’s inventory and customer data to detect issues such as stockouts or broken promotions before campaigns waste budget. Early customers include Dreo, DrWoof, Fanka, Flamingo, NutritionFaktory, Patpat, Velotric and Vivaia. Investors say the technology could help level the playing field for smaller brands. “Performance marketing is the lifeblood of modern commerce, yet for too long the tools that drive scale have only been available to the largest enterprises,” said Josh Coyne, partner at Kleiner Perkins. MAI began collaborating with pilot customers in late 2024 and has since doubled its client base, reflecting what the company says is growing demand among direct-to-consumer brands and consumer apps facing higher competition for online customer acquisition. Sign up for a complimentary subscription to Digital Commerce 360 B2B News . It covers technology and business trends in the growing B2B ecommerce industry. Contact Mark Brohan, senior vice president of B2B and Market Research, at mark@digitalcommerce360.com . Follow him on Twitter @markbrohan. Follow us on LinkedIn , X (formerly Twitter) , Facebook and YouTube ."
    },
    {
      "title": "Farmers Business Network spins off crop protection arm",
      "description": "Farmers Business Network, a Silicon Valley-backed agriculture technology company that operates one of the largest digital marketplaces for farmers, has spun off its crop protection and logistics subsidiary into a new independent business called Global Crop Solutions. The move creates two distinct companies with different missions. Farmers Business Network, better known as FBN, will focus [&#8230;] The post Farmers Business Network spins off crop protection arm appeared first on Digital Commerce 360.",
      "url": "https://www.digitalcommerce360.com/2025/10/03/farmers-business-network-spins-off-crop-protection-arm/",
      "source": "digitalcommerce360.com",
      "category": "Marketing",
      "published_date": "Fri, 03 Oct 2025 15:53:58 +0000",
      "author": "Mark Brohan",
      "content": "Farmers Business Network, a Silicon Valley-backed agriculture technology company that operates one of the largest digital marketplaces for farmers, has spun off its crop protection and logistics subsidiary into a new independent business called Global Crop Solutions. The move creates two distinct companies with different missions. Farmers Business Network, better known as FBN, will focus squarely on its role as a technology-driven marketplace and farmer-to-farmer network. Global Crop Solutions (GCS) will operate as a wholesale supplier of post-patent crop protection products, serving retailers, cooperatives, and distributors across North America. “This separation marks a pivotal moment for FBN, allowing us to operate as a pure technology platform dedicated to bringing farmers more choice, savings, and convenience,” said Diego Casanello, CEO of FBN. “By digitalizing distribution and retail of farm goods and services and opening our network to more sellers and financial partners, we are solving one of the hardest problems for innovators in ag: cost-efficient market access to the farm gate.” Founded in 2014, FBN has built a membership of more than 120,000 farmers managing over 190 million acres. The company offers a range of inputs, financing, sustainability services, crop marketing tools, and last-mile delivery. Its marketplace gives farmers access to products from multiple suppliers while reducing distribution costs. The spin-off, FBN executives said, will enable the company to operate more efficiently as a digital platform, allowing third-party sellers to manage placement, pricing, and promotion directly with farmer customers. GCS launches with a portfolio of more than 250 U.S. and Canadian registrations for post-patent crop protection products, making it one of the largest independent players in the space. The company will run an asset-light supply chain model designed to support wholesale, retail, and co-op partners. “Global Crop Solutions launches today as an independent powerhouse,” said Amy Yoder, CEO of GCS. “For the first time, our extensive portfolio and efficient global supply chain are fully available to all partners. Our independence unlocks immense growth potential and allows us to be a reliable and collaborative partner to the agricultural industry.” Although the two companies are separating, they will maintain a commercial relationship. GCS will continue to sell products to FBN members through its marketplace, ensuring access to exclusive brands such as Willowood USA. Industry analysts say the move reflects a broader trend in agribusiness: companies segmenting operations to sharpen focus and adapt to growing digitalization. With the spin-off, FBN is positioning itself as a leading technology platform for farmers, while GCS aims to expand its reach as an independent supplier across North America’s fragmented crop protection market. Sign up for a complimentary subscription to Digital Commerce 360 B2B News . It covers technology and bu..."
    },
    {
      "title": "63% of SMEs are looking to use AI for Global Trade: Here’s how you can get in on the action",
      "description": "Sponsor content is created on behalf of and in collaboration with Alibaba.com by DigitalCommerce360. Our editorial staff is not involved in the creation of the sponsored content. SMEs worldwide are exploring AI and digital tools to overcome trade barriers and build resilient supply chains Small and medium-sized enterprises (SMEs) have always been the heart of [&#8230;] The post 63% of SMEs are looking to use AI for Global Trade: Here's how you can get in on the action appeared first on Digital Commerce 360.",
      "url": "https://www.digitalcommerce360.com/2025/10/03/63-of-smes-are-looking-to-use-ai-for-global-trade-heres-how-you-can-get-in-on-the-action/",
      "source": "digitalcommerce360.com",
      "category": "Marketing",
      "published_date": "Fri, 03 Oct 2025 14:43:08 +0000",
      "author": "Digital Commerce 360 Staff",
      "content": "Sponsor content is created on behalf of and in collaboration with Alibaba.com by DigitalCommerce360. Our editorial staff is not involved in the creation of the sponsored content. SMEs worldwide are exploring AI and digital tools to overcome trade barriers and build resilient supply chains Small and medium-sized enterprises (SMEs) have always been the heart of global commerce, but never before have they had the digital tools to truly compete with multinational giants, until now. At Alibaba.com ’s third annual CoCreate flagship event in Las Vegas (Sept 4–5, 2025), over 3,500 business leaders, suppliers, and entrepreneurs came together to share insights, solutions and success stories. The overarching theme? SMEs can, and are , becoming global players thanks to AI, data-driven platforms, and strategic digital transformation. SMEs Go Global: The Micro-Multinational Era Alibaba.com President Kuo Zhang described a pivotal shift in global trade, noting that “ The businesses thriving today are those that combine the agility of SMEs with the technological capabilities that were once the exclusive domain of large multinationals. ” That sentiment set the tone for the summit, where AI was presented as a powerful equalizer, allowing small and medium-sized enterprises to operate with the efficiency and reach of global companies. The summit introduced the term “micro-multinational” as small businesses or solopreneurs that leverage digital tools to break into global markets with precision and agility. Alibaba.com’s research backs this up: 63% of SMEs are now actively adopting AI to enhance cross-border trade. These businesses aren’t waiting for conditions to stabilize – they’re using tech to forge ahead. Solving the Classic Challenges of Global Trade Global sourcing has long faced hurdles: language barriers, supplier verification issues, and market intelligence gaps. At CoCreate, many micro-multinational entrepreneurs noted that AI and digital tools are directly addressing these pain points at scale by eliminating multilingual communication to bridge cross-border gaps and provide AI-powered risk analysis to improve decision-making with real-time data to replace guesswork with actionable insights. Rather than requiring full digital overhauls, these solutions allow SMEs to upgrade specific pain points in their supply chains, producing fast, measurable impact. Accio Agent: A Game-Changer for Global Sourcing A key innovation showcased at the summit was Accio Agent , an AI assistant designed specifically for small businesses navigating the complexities of global sourcing. Powered by data from 1 billion product listings and 50 million supplier profiles, Accio automates up to 70% of routine workflows – including product prototyping, regulatory compliance, and supplier selection. Unlike other AI tools, Accio is designed for ease of use. It understands both long-form text and image-based queries. Entrepreneurs can upload product sketches, photos, or even handwritten notes..."
    }
  ]
}