{
  "category": "Marketing",
  "scraped_at": "2025-10-01T13:38:26.753996",
  "total_articles": 38,
  "articles": [
    {
      "title": "Mastercard makes bigger grab for commerce media dollars with new network",
      "description": "In its bid for advertisers&rsquo; dollars,&nbsp;the payments giant draws on existing technology and partnerships with firms like WPP, Citi and Microsoft.&nbsp;",
      "url": "https://www.marketingdive.com/news/mastercard-bigger-grab-commerce-media-dollars-new-network/761568/",
      "source": "marketingdive.com",
      "category": "Marketing",
      "published_date": "Wed, 01 Oct 2025 10:57:00 -0400",
      "author": "Peter Adams",
      "content": "Mastercard Commerce Media draws on the payments giant’s existing technology and partnerships with firms like WPP, Citi and Microsoft. Mastercard is making a bigger grab for advertisers’ dollars with its new digital media network, which leverages complementary capabilities from across the payment firm’s portfolio, such as card-linking technology, personalization from Dynamic Yield and media optimization from its marketing services division. While investments in commerce media have steadily accelerated, measurement and attribution are widely regarded as pain points. Mastercard is touting its view into permissioned data linked to 160 billion annual transactions as a way to improve precision and personalization for brands. That data lets the network identify the right audience for an advertiser's offer, with Mastercard able to attribute any purchases made directly to the content. The company claims that its network produces up to 22-times return on ad spend for verticals including retail, travel, entertainment and dining. Mastercard Commerce Media does not replace the company’s existing offers business, according to a spokesperson. Instead, it looks to build on a foundation created by those services, which have accrued large advertiser and enrolled consumer bases over the past decade-plus. Mastercard plans to bring the media network offering into new distribution channels, including point of sale and digital wallets, along with additional markets moving forward. At launch, the network operates in Mastercard’s owned channels and through global bank and publishing outlets. “The capability is evolving to be a full-scale media network to address common pain points — whether the goal is to spark awareness through a digital ad, drive conversion with a well-timed incentive, or something in between, Mastercard Commerce Media is a flexible solution that helps advertisers meet consumers wherever they are in the purchasing lifecycle,” the spokesperson said in emailed comments to Marketing Dive. Along with leaning on Mastercard’s own technology, the commerce media network has several partnerships to round out its appeal. A tie-up with Citi grants the network greater scale and Mastercard is working with Microsoft to embed the offering in Copilot Studio amid the rise of artificial intelligence-powered commerce. Mastercard is also deepening its collaboration with ad-holding group WPP to engage brands and buyers around traditional media. Mastercard named WPP Media as its global media partner in August in a major win for the agency. Get the free daily newsletter read by industry experts Though spending forecasts are bleak, value-focused messaging and smart social media plays could help brands transcend the turbulence. Ten-figure acquisitions, new agency experiments and organizational changes are underway, but the real key may be relinquishing a sense of control."
    },
    {
      "title": "Top marketing conferences to attend in 2026",
      "description": "Organizers including the Association of National Advertisers and the Consumer Technology Association have already started to map out their plans.",
      "url": "https://www.marketingdive.com/news/top-marketing-events-2026/760286/",
      "source": "marketingdive.com",
      "category": "Marketing",
      "published_date": "Wed, 01 Oct 2025 09:29:00 -0400",
      "author": "Jessica Hammers",
      "content": "A convenient list of must-attend events for advertising professionals, from trade organization symposiums to expos around innovation and technology. Today’s marketing landscape continues to evolve at a rapid pace, requiring industry executives to stay attuned to the latest innovations if they hope to successfully build their brands and grow consumer loyalty. For those looking to refine their strategies, several industry conferences are slated to return in 2026, offering executives a chance to network and share fresh ideas. Major organizers including the Association of National Advertisers and the Consumer Technology Association have already started to map out their conference plans for the coming year. Forthcoming events are likely to touch on the advertising industry’s buzziest trends, like artificial intelligence (AI) in marketing, social media’s growing influence, retail media and the continued rise of connected TV (CTV). Below, Marketing Dive has compiled some of the most notable 2026 conferences that have been announced so far. We’ll plan to continue updating this list as new events arise and more information becomes available. Before this year comes to a close, be sure to also check out the top conferences that remain in 2025 . The Consumer Electronics Show is a trade-only event for professionals affiliated with the consumer technology industry. The event, which is hosted by the Consumer Technology Association, is a space for global brands to meet new partners, unveil innovative releases and engage with various activations and demos. The most recent iteration of the trade show saw over 142,000 attendees and more than 4,500 exhibitors. The annual SXSW Conference & Festivals bring together global professionals across the music, tech, film and television industries for networking, learning and professional development. The event features conference sessions, film and TV festival screenings, music festival showcases, exhibitions, competitions, awards and more. For the upcoming show, which marks the 40th iteration of the event, SXSW is lowering badge prices from 2025’s rates and streamlining access for participants. April 27-29 Miami Beach, Florida Possible is a three-day event that features interactive sessions, curated meetups and immersive environments for marketers of all levels to foster connections and refine their strategies. The conference was co-founded by MMA’s Greg Stuart and Christian Muche, the co-founder of DMEXCO, and was launched in 2023. In 2025, the show attracted over 5,000 attendees and offered nearly 350 speakers. Of attendees, 33% were brand marketers and 66% were vice president level and above. The Association of National Advertisers’ (ANA) Brand Masters Conference assembles leading brands and chief marketing officers from around the globe to discuss various trends and branding strategies. The 2025 event featured speakers from companies including Poppi, True Religion and Diageo. The IAB NewFronts bills itself as the world’..."
    },
    {
      "title": "Target plots retail, marketing blitz around ‘Stranger Things’ final season",
      "description": "Target is the only retailer running a national campaign&nbsp;developed directly with Netflix and featuring on-screen talent from the show.",
      "url": "https://www.marketingdive.com/news/target-retail-marketing-blitz-stranger-things-final-season/761526/",
      "source": "marketingdive.com",
      "category": "Marketing",
      "published_date": "Wed, 01 Oct 2025 08:00:00 -0400",
      "author": "Peter Adams",
      "content": "The brand is the only retailer running a national campaign developed directly with Netflix and featuring on-screen talent from the show. Target is going all-out on “Stranger Things” to capitalize on what’s expected to be one of the major pop culture moments of the 2025 holidays. Netflix is releasing the final season in three installments — on Nov. 26, Christmas and New Year’s Eve — giving Target multiple opportunities to capture the interest of fans at the height of a critical shopping period. The blockbuster-sized partnership comes as Target tries to turn around its business following a run of flagging performance and consumer backlash . The holidays are shaping up to be a test for a retail industry that is contending with tariffs and people cutting back on discretionary spending due to the shaky state of the economy. Dedicated retail spaces for “Stranger Things” promise to go beyond simple brick-and-mortar store displays and will carry a broad assortment of items, many of which are exclusive to Target. Categories span Halloween costumes, clothing, food and beverage, home decor and toys and collectibles. The first wave of goods hits store shelves Oct. 5, with future drops timed to the show’s release schedule. On Oct. 12, Target is also rolling out a national campaign that was developed with Netflix and some of the minds behind “Stranger Things.” Few details were shared about the creative, other than that it will star on-screen talent and “blurs the line between nostalgia and storytelling” in bringing consumers back to the late ‘80s and a carefully recreated Target store. It was not immediately clear whether Target factors into the narrative of the fifth season of “Stranger Things,” though the series has previously set key scenes in malls and department stores like JCPenney. Other brands are already ramping up marketing activity in anticipation of season five, with Doritos earlier this week announcing a retro telethon event trotting out ‘80s icons like David Hasselhoff, Paula Abdul and ALF. “Stranger Things” has long been a magnet for legacy brands that view its ‘80s setting as a prime canvas to draw on their heritage and consumer nostalgia, an increasingly common marketing tactic. Netflix for its part has been trying to strike more robust brand deals, including through co-branded campaigns , as its ad-supported business grows. Target’s comparable sales, an important measure of retail health, fell 1.9% year over year in Q2, a period that also saw a 1.2% slide in merchandise sales . Longtime CEO Brian Cornell, who is credited with helping turn Target into a $100 billion company, in August announced he would step down from his post in early 2026. Get the free daily newsletter read by industry experts Planning around tariff disruption echoes the pandemic, a moment the industry did not always meet with agility or savvy investment decisions. Expanding into offsite media like open-web programmatic could alleviate supply pressures but opens a whole new ..."
    },
    {
      "title": "ChatGPT lets shoppers buy products within the platform",
      "description": "Launching first in partnership with Etsy and Shopify, the Instant Checkout functionality has the potential to rival Amazon and Google, one expert said.",
      "url": "https://www.marketingdive.com/news/openai-chatgpt-instant-checkout-agentic-commerce-etsy-shopify/761518/",
      "source": "marketingdive.com",
      "category": "Marketing",
      "published_date": "Tue, 30 Sep 2025 16:30:00 -0400",
      "author": "Dani James",
      "content": "Launching first in partnership with Etsy and Shopify, the Instant Checkout functionality has the potential to rival Amazon and Google, one expert said. As consumers turn to AI for shopping recommendations, OpenAI just announced a function that aims to keep the buying process on its ChatGPT platform. The company on Monday debuted Instant Checkout for U.S. ChatGPT Plus, Pro and Free users. Such users can now buy directly in the platform from U.S. Etsy sellers and will soon have the same option for over a million Shopify merchants (including Glossier, Skims, Spanx and Vuori). \"As a marketplace of over 5 million creative entrepreneurs, it’s our job to remove barriers for shoppers so they can easily discover and be delighted by our sellers’ special items,\" Etsy Chief Product and Technology Officer Rafe Colburn said in a separate company post . The Instant Checkout functionality currently supports single-item purchases, but OpenAI plans to add multi-item carts as an option and expand the service to additional regions. Merchants pay a fee on purchases, though the service does not come at an additional cost to ChatGPT users, and items with Instant Checkout are not preferred in product results, per OpenAI. However, the tech company said in its announcement that it does consider several factors — such as the enablement of Instant Checkout, quality and price — when ranking merchants that sell the same product. The new feature is powered by the Agentic Commerce Protocol, which the technology company says was built with Stripe and other partners. In addition to this initial Instant Checkout rollout, OpenAI has open-sourced its Agenetic Commerce Protocol for merchants to start building their own integrations. Businesses can then apply to have their products available to buy through ChatGPT. \"OpenAI is taking its first big step into commerce with Instant Checkout,” Emarketer senior analyst Zak Stambor said in emailed comments. “The feature still has some wrinkles to iron out, but embedding checkout for hundreds of millions of users could turn ChatGPT into a true commerce destination. If OpenAI can streamline the experience, it could challenge Amazon and Google and carve out a lucrative new revenue stream.\" The news from OpenAI comes as shoppers turn to AI to ask for product suggestions on anything from everyday essentials to holiday gifts. The impact means that some consumers are shifting away from the search engines retailers have long focused on and changing the nature of their searches to be more complex , even directly on a company’s e-commerce site. GEO, or generative engine optimization, is the future of SEO, Target’s Vice President of Digital Product Management Ranjeet Bhosale told an audience at ShopTalk Fall 2025 earlier this month. “It’s not just about giving them the right products. It’s also about how you showcase the product,” Bhosale said. “When they are searching for a summer party, rather than just showcasing tableware they are expecting us to n..."
    },
    {
      "title": "Godiva taps Leighton Meester for brand reset ahead of 100th anniversary",
      "description": "The Belgian chocolate brand is refreshing its identity with a refined logo, new design system and global campaign featuring the &ldquo;Gossip Girl&rdquo; star.",
      "url": "https://www.marketingdive.com/news/godiva-taps-leighton-meester-for-brand-reset-ahead-of-100th-anniversary/761443/",
      "source": "marketingdive.com",
      "category": "Marketing",
      "published_date": "Tue, 30 Sep 2025 10:00:00 -0400",
      "author": "Chris Kelly",
      "content": "The “Gossip Girl” star is the first person to portray Lady Godiva for the Belgian chocolate brand as part of a fresh campaign. Godiva is preparing for its centennial with a revitalization of its brand and a new, celebrity-powered campaign. In a cinematic 60-second video, Meester navigates a web of alarm-linked lasers (a la “Entrapment” and “Ocean’s Twelve”) to break into an art museum where she deposits Godiva chocolate and admires a portrait of Lady Godiva before escaping on the legend’s iconic white horse. The effort marks the first time in at least 15 years that Godiva has undertaken a brand reset, including a new logo that more cleanly integrates the icon of Lady Godiva on a horse. Other elements include modernized packaging, refreshed product offerings and reformulations of select products. “This reset isn’t just a visual update — it’s a transformation of how we show up in the world,” said Steve Lesnard, president at Godiva, in a statement shared with Marketing Dive. “We’re stepping into our second century with more purpose, passion, and power than ever. From our partnership with Leighton Meester to the iconic products we’re spotlighting, this is a brand ready to lead the premium chocolate industry again.” The campaign was created by agency Lippe Taylor and produced by FELA, with short-form videos directed by Adrian Villagomez. The video starring Meester will debut on YouTube and run across social, with other campaign elements appearing across CTV, OOH, billboards, digital and social platforms, demonstrating the range of channels that marketers need to employ in a tough economic climate . The selection of Meester, best known for her role on millennial-favorite “Gossip Girl,” comes as the show has found renewed interest since returning to Netflix last year . The actor will also appear in the upcoming season of romantic sensation “ Nobody Wants This ,” also on the platform. Godiva’s campaign demonstrates how Netflix shows and their stars remain shortcuts for brands looking to engage with pop culture . Godiva in 2024 was fully integrated into parent company Pladis' portfolio of snack brands. Global premium chocolate market was forecast to grow by $20.8 billion from 2024 to 2028 according to Technavio data, but the U.S. market has been unsettled by the Trump administration's tariffs on foreign imports. Get the free daily newsletter read by industry experts Ten-figure acquisitions, new agency experiments and organizational changes are underway, but the real key may be relinquishing a sense of control. With global ad spending set to surpass $1 trillion, marketers must navigate myriad challenges, including an uncertain regulatory landscape, with finesse."
    },
    {
      "title": "DraftKings bets on NBCU’s wide sports reach with multiyear ad deal",
      "description": "The deal grants the betting platform exclusive integrations and digital sponsorships across sports properties including the NFL and NBA.",
      "url": "https://www.marketingdive.com/news/draftkings-nbcu-enter-multiyear-advertising-agreement/761412/",
      "source": "marketingdive.com",
      "category": "Marketing",
      "published_date": "Tue, 30 Sep 2025 09:42:00 -0400",
      "author": "Jessica Hammers",
      "content": "The deal grants the sportsbook exclusive integrations and digital sponsorships across NBCUniversal sports properties including the NFL and NBA. DraftKings is strengthening its foothold in sports broadcasting through its partnership with NBCU, a move that could redefine how betting platforms and broadcasters work together to boost their reach and revenue. The tie-up comes on the heels of a banner year for NBC Sports, which delivered its most-watched year since 2016 in 2024. Through the deal, DraftKings will be featured across NBCU properties including the NFL, PGA Tour, Ryder Cup golf competition, Premier League, NCAA football and basketball, NBA, WNBA and more. The platform will also have a presence at major events including the Super Bowl, which in its most recent iteration achieved its largest viewership to date , according to Nielsen. FanDuel, which is the largest U.S. sportsbook by market share , reported that wagering on the 2024 Super Bowl peaked at nearly 70,000 bets per minute. With the deal, DraftKings also has exclusive rights to receive integrations and purchase digital sponsorships in a number of categories, including online sports betting, online lottery products, daily fantasy sports, iGaming and online horse wagering categories. The partnership additionally will foster opportunities for DraftKings to work with NBCU talent to help the platform develop immersive entertainment experiences. The deal spans NBCU’s linear, streaming and digital ecosystems and marks one of DraftKings’ largest multiplatform agreements to date, per release details. The partnership arrives as interest in sports betting continues to grow, with Americans having bet nearly $150 billion on sports in 2024. Revenue within the sports betting industry is expected to top $17 billion this year. Sports betting, which became possible in May 2018, is now legalized in 38 states , along with the District of Columbia and Puerto Rico. Beyond FanDuel, other sportsbooks and competitors to DraftKings include BetMGM, ESPN Bet and Fanatics, however, DraftKings and FanDuel currently command over 70% market share. Beyond its deal, DraftKings has been an active marketer. In March, the sportsbook launched a multimillion-dollar responsible gaming campaign that riffed on Kenny Rogers’ classic tune “The Gambler.” Prior, the platform utilized a new ad format for connected TV from ad-tech company Perion that dynamically integrates brand ads into live events. Get the free daily newsletter read by industry experts Though spending forecasts are bleak, value-focused messaging and smart social media plays could help brands transcend the turbulence. The decision to not move forward with an opt-out option arose out of an “evolution” of the industry and regulatory environments, said a Google official."
    },
    {
      "title": "Horizon Media, Havas form joint venture to woo global marketers",
      "description": "Horizon Global will focus on U.S.-centric global clients and bring together Horizon&rsquo;s Blu and Havas&rsquo; Converged.AI platforms.",
      "url": "https://www.marketingdive.com/news/horizon-media-havas-form-joint-venture-to-woo-global-marketers/761382/",
      "source": "marketingdive.com",
      "category": "Marketing",
      "published_date": "Mon, 29 Sep 2025 13:06:00 -0400",
      "author": "Chris Kelly",
      "content": "Horizon Global will focus on U.S.-centric global clients and bring together Horizon’s Blu and Havas’ Converged.AI platforms. The formation of Horizon Global comes at a “dynamic moment” for the ad industry, according to Bob Lord, interim CEO of the new joint venture. Agencies are contending not only with the rise of technology like generative AI, but also increased category consolidation that is lending competitors even greater scale. Omnicom Group and Interpublic Group, for example, are on the path to forming the world’s largest ad-holding group after agreeing to a finalized consent order from the Federal Trade Commission on Friday. “We intentionally designed Horizon Global to usher in a new chapter of connected intelligence, innovation, and client value,” said Lord in a statement around the joint venture. “Through the BluConverged Platform, and together with our teams and partners, we can now meet the growing demands for performance-based media models and drive enduring growth for the incredible brands we are privileged to represent.” BluConverged, the combination of both companies’ AI-powered platforms, is at the center of the new venture, with Horizon Global promising that AI will help drive insights, outcomes and transparency for global clients. Apart from the U.S.-centric global clients that Horizon Global is looking to serve, Horizon Media and Havas Media Network will operate independently, with separate client portfolios, brand profiles and new business pitches. Interim CEO Lord in January was named Horizon Media’s first president , a role he will maintain. The executive previously worked for nearly a decade at IBM and served as the company’s first chief digital officer. In addition, Renata Spackova has been appointed to the role of global chief operating officer and will lead the “strategic deployment” of Horizon Global across more than 100 global markets. The joint venture is not the only move in the media agency space that seeks to better position companies in advance of the Omnicom-IPG merger. Empower Media and Ocean Media this month merged to create Empower Ocean Media Group , putting $1.5 billion in media billings under one roof. Get the free daily newsletter read by industry experts Though spending forecasts are bleak, value-focused messaging and smart social media plays could help brands transcend the turbulence. The decision to not move forward with an opt-out option arose out of an “evolution” of the industry and regulatory environments, said a Google official."
    },
    {
      "title": "Lower-funnel marketing accelerates amid flagging economy, IAB finds",
      "description": "With tariff fears growing, IAB revised its 2025 ad spend forecast down.&nbsp;",
      "url": "https://www.marketingdive.com/news/lower-funnel-marketing-accelerates-flagging-economy-iab-finds/761305/",
      "source": "marketingdive.com",
      "category": "Marketing",
      "published_date": "Mon, 29 Sep 2025 11:00:00 -0400",
      "author": "Aaron Baar",
      "content": "With tariff fears growing, IAB revised its 2025 ad spend forecast down. Earlier in the year, when tariffs were largely theoretical, IAB expected overall advertising spending increases to be in the 7% range compared to 2024. Now that tariffs have become policy, media buyers are much more concerned, which is evident in the lower spending forecast. IAB’s revision is based on a survey of more than 200 media buyers, more than 90% of whom had concerns about how the tariffs would affect their media budgets, customer acquisition and retention strategies. As macroeconomic uncertainties continue, marketers are once again falling back on performance-driven marketing strategies that often favor digital media spend over more broad-based, brand building linear TV investments. Indeed, IAB’s latest forecast anticipates social media will grow 14.3% in 2025, retail media 13.2% and CTV 11.4%. “In our January report, we saw real concerns about the economy, and a shift toward performance-driven media. Now that shift is accelerating. If consumers are pulling back, that means every single dollar of ad spend has to earn a return,” said Chris Bruderle, vice president, industry insights and content strategy at IAB, in a statement. Buyers are intending to focus on media where the return can be best quantified, i.e. digital vs. traditional, linear media. However, there are signs that even here, challenges may be growing. While social media’s forecast reflects an increase since earlier in the year, the forecast for connected TV has been revised down by 2.4 percentage points. The projection for commerce media has also decreased by 2.4 percentage points since the beginning of the year, as the channel continues to face challenges with measurement and fragmentation. A shift to performance marketing has, in the past, been a short-term strategy as marketing best practices recognize that more broad-based brand building is imperative for the long-term health of a brand. Get the free daily newsletter read by industry experts Expanding into offsite media like open-web programmatic could alleviate supply pressures but opens a whole new can of worms for the category. The tech giant backs off plans to implement a huge shift in digital marketing that faced pushback from adland and regulators around the world."
    },
    {
      "title": "Harrods Customers Targeted After Cyber Attack on Third-Party Vendor",
      "description": "Luxury department store Harrods has confirmed that cyber attackers have contacted customers whose data they stole in a breach of the retailer’s tech stack. The company said in a statement on September 30 sent to CX Today: We are aware that some e-commerce customers have been directly contacted by someone purporting to have taken some [&#8230;]",
      "url": "https://www.cxtoday.com/crm/harrods-customers-targeted-after-cyber-attack-on-third-party-vendor/",
      "source": "cxtoday.com",
      "category": "Marketing",
      "published_date": "Tue, 30 Sep 2025 15:57:04 +0000",
      "author": "Nicole Willing",
      "content": "The breach highlights the need for security vigilance in handling customer data using third-party systems Luxury department store Harrods has confirmed that cyber attackers have contacted customers whose data they stole in a breach of the retailer’s tech stack. The company said in a statement on September 30 sent to CX Today: We are aware that some e-commerce customers have been directly contacted by someone purporting to have taken some personal data from one of our third-party providers’ systems. Harrods confirmed on September 26 that it had been informed by one of its third-party providers that data was stolen, and on September 28 stated that it had been contacted by the cybercriminals. The retailer confirmed to CX Today that 430,000 customer records were affected. Harrods informed affected customers on September 26 that the information includes their name and contact details, where these were provided, but does not include account passwords or, crucially, payment details. However, the data could still be used in targeted phishing or social engineering attacks, as evidenced by the criminals contacting customers directly within days. The high-end retailer’s customers are also potential targets of identity theft. Hackers often contact the companies they steal data from in an attempt to blackmail or extort money, typically threatening to leak sensitive information or disrupt operations unless a ransom is paid. Harrods stated that it will not engage or negotiate with the perpetrators, and is cooperating with authorities including the National Cyber Security Centre and the Metropolitan Police Cyber Crime unit to investigate and mitigate the damage. “Negotiating with cybercriminals does not result in any guarantees as to what they may do with the information they have accessed,” the September 30 statement said. Even if a company that has been attacked pays a ransom, attackers may still sell the data on the dark web, leak it publicly, or use it to launch further targeted attacks. The third-party provider informed the retailer that the breach “is an isolated incident which has been contained,” Harrods said, adding that the two companies are working closely “to ensure that all appropriate actions are being taken.” The compromised customer records may also include tags associated with Harrods’ marketing activities and service offerings. “These labels may include tier level or affiliation to a Harrods co-branded card although this information is unlikely to be interpreted accurately by an unauthorized third party,” the retailer said. Harrods’ customers tend to shop in-store rather than through its e-commerce platform, leaving many of its shoppers unaffected. More than 60 million domestic and international visitors shop with the company through its stores in Knightsbridge, Heathrow and Gatwick airports as well as online, according to its website. The company emphasized that none of its internal systems were compromised by the breach, which it stated is “u..."
    },
    {
      "title": "Sprinklr Launches Three New AI-Powered Innovations – How Do They Work?",
      "description": "Sprinklr has announced the launch of its three new AI-powered innovations: Sprinklr Copilot, Sprinklr AI Agents, and Enhanced Customer Feedback Management. Sprinklr believes the solutions will help meet the expectations of its hyper-connected customers, who are increasing their demand for AI-native solutions. Rory Read, President and CEO at Sprinklr, emphasized the customer demand in [&#8230;]",
      "url": "https://www.cxtoday.com/crm/sprinklr-launches-three-new-ai-powered-innovations-how-do-they-work/",
      "source": "cxtoday.com",
      "category": "Marketing",
      "published_date": "Tue, 30 Sep 2025 15:44:09 +0000",
      "author": "Francesca Roche",
      "content": "Are the latest releases the next step in realizing Sprinklr's autonomous contact center vision? Sprinklr has announced the launch of its three new AI-powered innovations: Sprinklr Copilot, Sprinklr AI Agents, and Enhanced Customer Feedback Management. Sprinklr believes the solutions will help meet the expectations of its hyper-connected customers, who are increasing their demand for AI-native solutions. Rory Read, President and CEO at Sprinklr , emphasized the customer demand in CX, detailing how “they expect brands to meet them where they are, with context, speed, and insight. Our platform is built to help brands lead in this new era of engagement, connecting with their audiences in a bold, differentiated way. But how will these new innovations achieve this? The first innovation is an AI-powered companion designed for customer-facing teams, providing real-time assistance across all product suites. Examples of assistance include interacting with dashboards through conversation, providing insights, answering questions such as ‘Tell me what failed last week?’, and actively monitoring critical systems and workflows to inform of any spikes or anomalies. By addressing frequent customer-facing team-based challenges, Sprinklr Copilot will allow for higher levels of productivity. Sprinklr claims trustworthiness in the product, with every AI response explainable and backed up with citations. The second innovation is the autonomous AI agents that support decision-making, automating repetitive tasks and boosting engagement. Unlike similar AI solutions on the market, Sprinklr AI agents are natively built into the platform, and can intrinsically enable the platform’s data models, journey vocabulary, and embedded AI capabilities to personalize customer experiences more clearly than an external agent. The AI Agents are also omnichannel-ready, with the ability to retain information from voice, chat, email, and social without repeating itself. The innovation is grounded into the business itself, with seamless integration into office workflows, rules, enterprise data and guardrails with a focus on governance and security. The third innovation uses enhanced capabilities to renovate and simplify customer feedback management, using one unified AI-native platform. When collecting customer feedback, the CFM creates adaptable surveys that personalize in real time, meaning it can recognize which questions drive higher response rates and edit or remove the ones that don’t. AI is also applied to an enabled closed-loop feedback system, meaning it both detects issues and prescribes actions, allowing teams to better address customer feedback responses. For analyzing analytics, it provides automated advice for data insights and validates it against social data efficiently, giving valuable insights with more data and context. Moreover, with just one unified system, the CFM can act upon both solicited and unsolicited customer feedback, centralizing all forms of customer input in..."
    },
    {
      "title": "ServiceNow Introduces AI Experience to Reshape Customer Service Workflows",
      "description": "Tired of clunky service portals and AI tools that don’t talk to each other? You’re not alone, and ServiceNow is betting big on fixing that. The enterprise tech giant has unveiled AI Experience, a unified interface designed to make working with AI feel more like chatting with a smart and efficient colleague than a clunky [&#8230;]",
      "url": "https://www.cxtoday.com/ai/servicenow-introduces-ai-experience-to-reshape-customer-service-workflows/",
      "source": "cxtoday.com",
      "category": "Marketing",
      "published_date": "Tue, 30 Sep 2025 13:01:40 +0000",
      "author": "Nicole Willing",
      "content": "New AI-powered tools aim to automate tasks and enhance efficiency across customer service operations. Tired of clunky service portals and AI tools that don’t talk to each other? You’re not alone, and ServiceNow is betting big on fixing that. The enterprise tech giant has unveiled AI Experience, a unified interface designed to make working with AI feel more like chatting with a smart and efficient colleague than a clunky robot. Building on ServiceNow’s generative AI toolset Now Assist, AI Experience extends across any workflow, including the company’s autonomous Customer Relationship Management (CRM) offering, to introduce AI agents that can proactively resolve issues, personalize interactions and streamline service to get things done faster. First up, AI voice agents that can speak with human-like fluency handle tasks like pulling up information, updating records, and even troubleshooting complex issues. Then there are AI web agents that learn from people and do all the button-clicking, form-filling and web navigation, without the need for APIs or integrations. An AI Data Explorer connects insights across the ServiceNow platform and external data sources via Workflow Data Fabric to help users spot trends, find root causes, and analyze document findings without switching between tools. There is also an AI Lens feature that turns the screens, forms, dashboards, and other interfaces users see into instant AI-powered action, so they can skip the manual steps and make faster decisions. Traditional CRM tools have long been criticized as passive, static systems that are good at tracking, but not proactive. The draw of using AI agents is that they can both log and act on customer interactions. Amy Lokey, ServiceNow’s Chief Experience Officer , said the platform elevates the traditional user interface (UI) and provides an entry point for employees to collaborate with AI. AI Experience from ServiceNow is addressing one of the biggest challenges enterprises face today: fragmented, clunky user experiences that slow down work. “By creating a unified, contextual, and intuitive AI Experience for the enterprise, we’re putting AI into the flow of work, meeting users where they are and empowering them with access to workflows, data, and AI agents.” The problem ServiceNow aims to tackle isn’t new: businesses are overwhelmed with siloed apps, disconnected AI bots, and clunky workflows that frustrate users and slow down customer service delivery. Unlike tools that only work inside one app, ServiceNow’s platform cuts across the entire workflow by unifying people, AI models, data, and workflows to make it easier for companies to roll out AI without overwhelming their teams. The multimodal and multilingual interface puts AI front and center, giving users instant access to voice, text, images, web tools, and context-aware agents that deliver personalized, proactive support. For a customer trying to get support, they have the option of hopping onto a service channel of th..."
    },
    {
      "title": "ChatGPT Moves Into Commerce With Instant Checkout",
      "description": "OpenAI has launched a new feature, Instant Checkout, allowing U.S. ChatGPT users to purchase items directly within the chatbot. The move starts with Etsy sellers, with Shopify merchants such as Glossier, SKIMS, and Spanx due to follow. According to OpenAI, the feature currently supports single-item purchases but will expand to multi-item carts and new regions [&#8230;]",
      "url": "https://www.cxtoday.com/conversational-ai/chatgpt-moves-into-commerce-with-instant-checkout/",
      "source": "cxtoday.com",
      "category": "Marketing",
      "published_date": "Tue, 30 Sep 2025 13:01:08 +0000",
      "author": "Daniel Flatt",
      "content": "If AI platforms such as ChatGPT mediate the entire buyer journey, how do brands maintain control over customer relationships? OpenAI has launched a new feature, Instant Checkout , allowing U.S. ChatGPT users to purchase items directly within the chatbot. The move starts with Etsy sellers, with Shopify merchants such as Glossier , SKIMS , and Spanx due to follow. According to OpenAI , the feature currently supports single-item purchases but will expand to multi-item carts and new regions in the coming months. The system is powered by the open-sourced ‘Agentic Commerce Protocol’, co-developed with Stripe, which enables AI agents, people, and businesses to complete purchases securely. Stripe users can enable it with minimal code changes, while others can connect through Stripe’s ‘Shared Payment Token API’ or by adopting the ‘Delegated Payments’ specification. In practice, shoppers can move from product discovery to purchase without leaving the chat. Recommendations appear organically, based on relevance rather than sponsored placement, with buyers able to confirm payment and shipping details directly in the interface. Merchants remain the merchant of record — handling payments, fulfillment, returns, and customer support using their existing systems. OpenAI said that while merchants pay a small fee on completed purchases, customer prices are unaffected. For enterprises, the development is about more than convenience. It reflects how ChatGPT is consolidating the buyer journey, taking on a dual role as both search engine and storefront. This is part of a broader industry trend toward machine customers — AI agents that can act and transact on behalf of humans. Gartner recently forecast that half of CEOs already have, or plan to develop , a strategy for machine customers. CX Today has also reported on Google’s experiments with machine-to-machine customer service, which analysts described as an early indicator of this shift. The announcement raises key questions for customer experience leaders. If AI platforms such as ChatGPT mediate the entire buyer journey, how do brands maintain control over customer relationships and loyalty? What guardrails will be needed to ensure AI agents make authorised, transparent decisions? And how should channel strategies evolve if significant volumes of traffic and sales are redirected through third-party platforms rather than direct e-commerce sites? OpenAI has described Instant Checkout as a first step, with more functionality planned. While the technical integration may be straightforward — particularly for merchants already using Stripe — the strategic consequences could be far-reaching. Agentic commerce is no longer a distant prospect. With ChatGPT handling both discovery and purchase, the customer journey is changing shape, and enterprises will need to decide whether to embrace, adapt, or resist a future where AI agents play a central role in commerce. Assuming consumers take it up, that is. Anthropic Ramps Up Enterpr..."
    },
    {
      "title": "Accenture Lays Off 11,000 Staff as Part of AI Reskilling Strategy",
      "description": "Accenture has laid off over 11,000 members of staff as part of a restructuring program. The company's 791,000 employees has been cut down to 779,000 in the past three months, and Accenture might not be done yet. With AI continuing to dominate the tech space, the IT consulting group has introduced AI training for staff to [&#8230;]",
      "url": "https://www.cxtoday.com/ai/accenture-lays-off-11000-staff-as-part-of-ai-reskilling-strategy/",
      "source": "cxtoday.com",
      "category": "Marketing",
      "published_date": "Tue, 30 Sep 2025 11:38:49 +0000",
      "author": "Francesca Roche",
      "content": "The company has also rolled up reskilling specialist Aidemy Inc Accenture has laid off over 11,000 members of staff as part of a restructuring program. The company’s 791,000 employees has been cut down to 779,000 in the past three months, and Accenture might not be done yet. With AI continuing to dominate the tech space, the IT consulting group has introduced AI training for staff to keep up with this new era of technology. Accenture has warned staff who cannot keep up with the new training could join the thousands already laid off. In a discussion with analysts , Accenture CEO Julie Sweet provided further insights into the restructuring : “We are exiting on a compressed timeline people where reskilling, based on our experience, is not a viable path for the skills we need. We are investing in upskilling our reinventors, which is our primary strategy. Those we cannot reskill will be exited. Indeed, Accenture followed this announcement with the news that it is set to acquire Aidemy Inc, a reskilling specialist. In doing so, the company is looking to strengthen its own reskilling and learning service, LearnVantage, and seemingly double-down on its commitment to fully embracing AI. The acquisition will also enhance Accenture’s end-to-end AI support – from talent development to long-term adoption – by leveraging Aidemy’s expertise in building and operating AI systems across diverse industries. The layoffs are part of an $865MN restructuring program for the year ahead, which aims to improve efficiency within the company. However, despite the restructuring, plans for the new fiscal year expect the employee headcount to grow, particularly in areas such as AI and digital services. Accenture’s fourth quarter report revealed that its revenue had increased by seven percent compared to the previous fiscal year, with Sweet suggesting it demonstrated the company’s “unique ability to deliver for our clients as they seek our help to reinvent and lead with AI”. In the report, Accenture reveals its strategic realignment plan to increase its growth, upskilling and efficiency, driven by a demand for AI-related services, as well as an increase in employment. The projected employee plan is part of a “refreshed three-pronged talent strategy to meet current and future client demand”, exiting those who cannot apply the skills required and hiring those who can. Our overall workforce is positioned to grow in line with the future of digital and AI consulting. Despite an increase in revenue, Accenture has had to adapt to budget constraints after the Department of Government Efficiency slowed its spending earlier this year. In the past, the U.S federal government has accounted for roughly eight percent of the company’s revenue. This year, the report suggests that with government spending, the projected revenue of Fiscal Year 25 would have been a percentage point higher. However, after the restructuring was announced, Accenture’s shares dropped 2.7 percent, the lowest since Nov..."
    },
    {
      "title": "CCaaS Market Set to Triple by 2030 – But Who Will Bear The Crown?",
      "description": "The global market for Contact Center as a Service (CCaaS) is entering a period of rapid expansion. Valued at just over $3.6 billion in 2023, industry analysts at Maximise Market Research predict it will soar to $11.4 billion by 2030, growing at a compound annual growth rate of 17.8 percent. For contact center leaders, the [&#8230;]",
      "url": "https://www.cxtoday.com/contact-center/ccaas-market-set-to-triple-by-2030-but-who-will-bear-the-crown/",
      "source": "cxtoday.com",
      "category": "Marketing",
      "published_date": "Tue, 30 Sep 2025 09:49:22 +0000",
      "author": "Daniel Flatt",
      "content": "For contact center leaders, the takeaway is clear: cloud-based platforms are no longer a niche option. The global market for Contact Center as a Service (CCaaS) is entering a period of rapid expansion. Valued at just over $3.6 billion in 2023, industry analysts at Maximise Market Research predict it will soar to $11.4 billion by 2030, growing at a compound annual growth rate of 17.8 percent. For contact center leaders, the takeaway is clear: cloud-based platforms are no longer a niche option. They are fast becoming the default architecture for organizations that want to meet rising customer expectations without the burden of maintaining complex on-premises systems. CCaaS offers enterprises the ability to unify customer interactions across voice, email, chat, and social media on a single platform. With demand for frictionless, personalized experiences only increasing, these solutions have become vital for organizations that want to stay competitive. At the same time, the rise of remote and distributed workforces has accelerated the move to the cloud. AI and automation are being woven into the core of modern platforms, enabling contact centers to reduce response times and provide agents with real-time assistance. So far, the momentum is largely in the hands of a small group of dominant vendors. Genesys, NICE, AWS, Five9, and Talkdesk are the players most frequently highlighted by Gartner and other research firms as the clear leaders. Each of these vendors has carved out an advantage. Genesys has been praised for its ability to support complex enterprise migrations. NICE has leveraged its strength in workforce engagement and analytics to cement its leadership. AWS, through Amazon Connect, brings hyperscaler scalability and a deep AI portfolio. Five9 has continued to deliver growth despite internal challenges, while Talkdesk has rebounded with strong industry specific specialization. These companies not only offer stability but also the global reach and compliance capabilities demanded by heavily regulated industries like healthcare and financial services. For many large organizations, they remain the “safe bets” for large-scale deployments. Yet dominance today does not guarantee dominance tomorrow. According to Zeus Kerravala , Founder of ZK Research , several vendors operating outside Gartner’s Magic Quadrant are worth watching closely. One is 8×8 , which Kerravala calls “the most obvious omission.” The company has a long history in the space and was among the first to bring UCaaS and CCaaS together — an increasingly important requirement for enterprises looking to consolidate internal and external communications. 8×8 retains a strong global footprint and high customer satisfaction ratings, making it a credible alternative for mid-sized organizations and beyond. Another rising force is RingCentral . Long known for its UCaaS leadership, RingCentral now offers a dual play: a NICE-powered contact center product and its own homegrown RingCX platform, s..."
    },
    {
      "title": "SAP Previews AI-Powered Enhancements to CX Platform",
      "description": "SAP has previewed AI-driven upgrades to its SAP Customer Experience (SAP CX) platform ahead of its SAP Connect event next week. The Q3 2025 release is designed to help enterprises optimize operations, generate actionable insights, and offer consistent quality at every point in the customer journey. The release embeds AI throughout the customer experience. In [&#8230;]",
      "url": "https://www.cxtoday.com/ai/sap-previews-ai-powered-enhancements-to-cx-platform/",
      "source": "cxtoday.com",
      "category": "Marketing",
      "published_date": "Mon, 29 Sep 2025 16:17:05 +0000",
      "author": "Nicole Willing",
      "content": "At SAP Connect, the tech giant will showcase how it is embedding AI across the SAP CX portfolio SAP has previewed AI-driven upgrades to its SAP Customer Experience (SAP CX) platform ahead of its SAP Connect event next week. The Q3 2025 release is designed to help enterprises optimize operations, generate actionable insights, and offer consistent quality at every point in the customer journey. The release embeds AI throughout the customer experience. In retail, for example, AI-powered agents will be utilized to help shoppers find exactly what they’re looking for, showing stock in real time. Marketers can use AI in SAP applications to personalize campaigns, write segment descriptions, and automate translations, all at scale. For sales teams, AI takes care of the ‘boring stuff’, such as cleaning up data, removing duplicates, and highlighting the best leads at the right time. From making smarter decisions to improving customer engagement, the portfolio’s AI-powered intelligence and agents can help teams move faster and deliver customer experiences that feel effortless, reliable, and personalized. “AI isn’t just about efficiency alone; it is about elevating every interaction into a moment where trust can be deepened and loyalty earned,” wrote Balaji Balasubramanian, President and Chief Product Officer at SAP , in a blog post. “AI is now woven into the fabric of the SAP CX road map, guiding how data, processes, and experiences come together. This deep integration sets the stage for a new era of customer engagement, one where intelligence anticipates needs, adapts in real time, and continuously strengthens loyalty at every touchpoint. Here’s a look at how each product in SAP’s cloud-based portfolio is putting AI to work: The product provides business information extraction, which automatically pulls key product information from case descriptions to save time and streamline case handling. Sales Cloud uses AI to identify duplicate contacts and customers, providing a confidence score for human users to make the final call, keeping data clean and accurate. An AI-assisted product finder allows marketers to search product catalogs using natural language and keywords quickly. The catalog is synced automatically with the latest data for up-to-date, targeted campaigns. A segment description generator creates clear, human-readable summaries for audience segments to improve targeting and usability. And a pilot version of a campaign translator can translate email campaign content directly within the editor for fast, seamless multi-language campaign rollout. The revamped tool features an AI-powered shopping agent that offers customers personalized product recommendations based on real-time inventory. The agent can hide out-of-stock items and answer B2B-specific stock questions, reducing friction and improving conversions. The product now includes an AI Promotion Creation feature that recommends promotion details like name, timing, product mix, discount type, and spe..."
    },
    {
      "title": "AI Washing in CX: When Chatbots, Routing and Analytics Aren’t What They Seem",
      "description": "I’ve always noticed that when people are very keen to tell you about their “AI,” it usually pays to ask one or two awkward questions. In customer experience technology, this has become something of a sport. Every vendor seems to have an “AI-powered” solution. But lean in, and ask: “When you say AI… what kind [&#8230;]",
      "url": "https://www.cxtoday.com/contact-center/ai-washing-in-cx-when-chatbots-routing-and-analytics-arent-what-they-seem/",
      "source": "cxtoday.com",
      "category": "Marketing",
      "published_date": "Mon, 29 Sep 2025 15:59:29 +0000",
      "author": "Rob Scott",
      "content": "How automation keeps getting dressed up as “AI.” I’ve always noticed that when people are very keen to tell you about their “AI,” it usually pays to ask one or two awkward questions. In customer experience technology, this has become something of a sport. Every vendor seems to have an “AI-powered” solution. But lean in, and ask: “When you say AI… what kind are we talking about?” That’s when the room goes quiet, the sales deck gets shuffled, and the truth is often far less glamorous than the label. This blurring of definitions — known as AI washing — is spreading fast. And you see it most clearly in places like chatbots, routing, analytics, and even personalisation. Chatbots are the poster child of AI in CX. But under the hood, they come in three very different flavours. The problem? All three are often lumped under the same “AI” banner. Which means a buyer expecting agentic capability might end up with little more than an expensive FAQ page. Another favourite playground for AI washing is call routing . Legacy routing has been around for decades. “If customer selects option 1, send to Sales. If they’re VIP, send to Priority Queue.” Simple, effective, but not exactly cutting-edge. Now, vendors rebrand this as AI routing. True AI routing should analyse intent in real time, predict needs from history, and route customers to the best-fit agent or channel. But in many cases, it’s still the same rules engine with a new coat of paint. It’s a bit like me putting on a tracksuit and insisting I’m an Olympic athlete. The outfit has changed, but the performance hasn’t. Chatbots and routing aren’t the only culprits. AI washing shows up in plenty of other corners of the CX stack: Each of these promises transformation. But when the AI isn’t there, buyers end up with the same old technology in new packaging. For CX leaders, these blurred definitions carry serious consequences. Meanwhile, vendors genuinely investing in machine learning, conversational intelligence, and predictive modelling risk being drowned out by hype. If every chatbot, routing engine, and dashboard is “AI,” then nothing is. So next time a vendor rolls out their AI pitch, maybe channel your inner Louis Theroux and ask a few gently awkward questions: “How exactly does this differ from what you sold five years ago?” or “Can you show me the real AI at work, not just in the demo?” The silence that follows might tell you more than the sales deck ever could. Join our CX Today community on LinkedIn to keep the debate going with 40,000+ peers, and subscribe to our newsletter for the weekly rundown of crucial CX news. Why Omni-Data Is More Than Just the Next Contact Center Buzzword Smarter Conversations, Healthier Outcomes: Valeris’ Webex Contact Center Story Cisco Doubles Down on AI-Powered Contact Center at WebexOne 2025 ServiceNow Introduces AI Experience to Reshape Customer Service Workflows CCaaS Market Set to Triple by 2030 – But Who Will Bear The Crown? Explainer: Reducing Time To Resolution with ..."
    },
    {
      "title": "Blog & Articles | Digital Marketing Institute",
      "description": "Blog & Articles page of DMI, the global certification standard in digital marketing education.",
      "url": "https://digitalmarketinginstitute.com/blog",
      "source": "digitalmarketinginstitute.com",
      "category": "Marketing",
      "published_date": null,
      "author": "",
      "content": "Web Design, CRO and UX Showing 1 - 24 of 1314 Articles How To Find a Digital Marketing Job in 2025 Content Marketing Skills That Turn Readers Into Customers Google Algorithm Updates: What do They Mean for Brands and Marketers? Top SEO Skills Every Digital Marketer Needs in 2025 How Hello Sunshine Mastered Content Marketing The Ultimate Guide to Marketing Automation Why LinkedIn Feels Like Facebook in 2017 How to Use Substack as a Marketing Tool for Your Business 8 Steps to a Digital Marketing Strategy for Small Businesses How to Make your Digital Marketing More Inclusive for Neurodivergent Consumers Paid vs Organic Search – How to Find the Right Balance Premium Content - Professional Members Only Apple: A Masterclass in Style and Branding Link Detoxing: Improve Your Backlink Profile Through Backlink Removal How to Write A Marketing Email Why First-Party Data is Important and How Marketers Can Collect and Use it 10 Digital Skills That Can Make Students Instantly Employable in 2025 10 Steps to Building Your Personal Brand on Social Media White Hat and Black Hat SEO Best Practices in the Age of AI 10 Strategies for a Successful UX Project 4 Lessons Digital Marketers Can Take From Taylor Swift's Marketing Strategy What are the Best Drop Shipping Business Ideas for Your Brand? The Beginner’s Guide to Programmatic Advertising How to Use X for Business"
    },
    {
      "title": "Blog & Articles | Digital Marketing Institute",
      "description": "Blog & Articles page of DMI, the global certification standard in digital marketing education.",
      "url": "https://digitalmarketinginstitute.com/blog/category/digital-strategy",
      "source": "digitalmarketinginstitute.com",
      "category": "Marketing",
      "published_date": null,
      "author": "",
      "content": "Web Design, CRO and UX Showing 1 - 24 of 199 Articles Google Algorithm Updates: What do They Mean for Brands and Marketers? The Ultimate Guide to Marketing Automation How to Make your Digital Marketing More Inclusive for Neurodivergent Consumers 4 Lessons Digital Marketers Can Take From Taylor Swift's Marketing Strategy What are the Best Drop Shipping Business Ideas for Your Brand? How to Use X for Business The Unstoppable Success of Netflix What Are the Most Effective Digital Marketing Strategies? How to Do a Competitive Analysis in Digital Marketing 12 Examples of Powerful Brand Collaborations How to use the 7Ps Marketing Mix From Reviews to Real Time Strategy: Optimum Nutrition's AI Framework for Measuring Success 16 Brands Doing Corporate Social Responsibility Successfully The Creative Journey: From Idea to Impact What are the Digital Marketing Trends for 2025? Is Your Website Working For Your Business? How to Use AI Agents for Your Digital Marketing What is Greenwashing in Marketing? The Marketer’s Guide to Running a Successful Customer Loyalty Program SWOT Analysis for Digital Marketing: Guide and Template How to Conduct a Successful Digital Marketing Audit The State of Data Privacy in 2025"
    },
    {
      "title": "Blog & Articles | Digital Marketing Institute",
      "description": "Blog & Articles page of DMI, the global certification standard in digital marketing education.",
      "url": "https://digitalmarketinginstitute.com/blog/category/digital-marketing",
      "source": "digitalmarketinginstitute.com",
      "category": "Marketing",
      "published_date": null,
      "author": "",
      "content": "Web Design, CRO and UX Showing 1 - 24 of 108 Articles How to Use Substack as a Marketing Tool for Your Business Why First-Party Data is Important and How Marketers Can Collect and Use it Which Countries Have the Most Demand for Digital Marketers? 5 Key Elements of a Killer LinkedIn Summary (& 5 Great Hacks) How to Build Links for SEO How to Successfully Set & Manage PPC Budgets 5 Classic Examples of How Not to Do Digital Marketing How to Do a Competitive Analysis in Digital Marketing 8 Digital Skills That Will Increase Your Salary Your Handy Guide to Wage Negotiation How Much Can a Freelance Digital Marketer Make? How to use the 7Ps Marketing Mix What is Audience Listening & How Can You Do It Effectively? 8 Essential Skills Every Digital Marketer Needs How to Create a Summer Marketing Campaign that Cuts Through the Noise How to Choose the Best Social Media Channels for Your Business 16 Brands Doing Corporate Social Responsibility Successfully What are the Digital Marketing Trends for 2025? AI in Digital Marketing - The Ultimate Guide The State of Higher Education - 21 Statistics You Should Know in 2025 10 Eye Opening AI Marketing Stats in 2025 How to Generate High-Quality Leads"
    },
    {
      "title": "LinkedIn Login, Sign in | LinkedIn",
      "description": "Login to LinkedIn to keep in touch with people you know, share ideas, and build your career.",
      "url": "http://www.linkedin.com/shareArticle?mini=true&url=https://digitalmarketinginstitute.com/digital-marketing-trends-2025&source=digitalmarketinginstitute.com",
      "source": "digitalmarketinginstitute.com",
      "category": "Marketing",
      "published_date": null,
      "author": "",
      "content": "Click on the link to sign in instantly to your LinkedIn account. If you don’t see the email in your inbox, check your spam folder. By clicking Continue, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy ."
    },
    {
      "title": "Digital Marketing Courses Online | Flexible Study, All Levels | DMI",
      "description": "Meet the change makers from top global brands who help shape our courses.",
      "url": "https://digitalmarketinginstitute.com/blog/courses",
      "source": "digitalmarketinginstitute.com",
      "category": "Marketing",
      "published_date": null,
      "author": "",
      "content": "Meet the change makers from top global brands who help shape our courses. Join our passionate team empowering marketers around the world. Recent press and media releases to delve into about DMI’s latest developments. Contact us anytime, anywhere. We are here to help. Partner with us to provide your students with industry-validated content and certifications. Partner with us to add globally recognised digital marketing certifications to your portfolio. Discover the organisations preparing their students for career success. Learn how our partners gained a competitive edge with our digital programs. ✓ Courses recommended based on your results ✓ Compare to peers ✓ Takes 15mins Showing 6 of 30 Courses We’ve been delivering high quality Digital Marketing Training for businesses for over 12 years. Get team access to elite digital marketing training. ⭧ Sale On | Get Up To 30% OFF | Meet the change makers from top global brands who help shape our courses. Join our passionate team empowering marketers around the world. Recent press and media releases to delve into about DMI’s latest developments. Contact us anytime, anywhere. We are here to help. Partner with us to provide your students with industry-validated content and certifications. Partner with us to add globally recognised digital marketing certifications to your portfolio. Discover the organisations preparing their students for career success. Learn how our partners gained a competitive edge with our digital programs. ✓ Courses recommended based on your results ✓ Compare to peers ✓ Takes 15mins Showing 6 of 30 Courses We’ve been delivering high quality Digital Marketing Training for businesses for over 12 years. Get team access to elite digital marketing training."
    },
    {
      "title": "Blog & Articles | Digital Marketing Institute",
      "description": "Blog & Articles page of DMI, the global certification standard in digital marketing education.",
      "url": "https://digitalmarketinginstitute.com/blog-topics",
      "source": "digitalmarketinginstitute.com",
      "category": "Marketing",
      "published_date": null,
      "author": "",
      "content": "Discover what's happening in Digital Marketing."
    },
    {
      "title": "OpenAI presenta Sora 2 y anuncia su primera app para crear videos con inteligencia artificial - Infobae",
      "description": "OpenAI presenta Sora 2 y anuncia su primera app para crear videos con inteligencia artificial&nbsp;&nbsp;InfobaeVideos de IA con tu rostro: así funciona el nuevo modelo lanzado por OpenAI&nbsp;&nbsp;La Gacetalanza el modelo Sora 2 junto con una aplicación estilo TikTok&nbsp;&nbsp;La NaciónLas empresas de IA nos dicen que quieren lograr una AGI. Lo que realmente están conquistando es la...&nbsp;&nbsp;XatakaOpenAI irrumpe en el mundo de las redes sociales con una aplicación de videos creados por IA&nbsp;&nbsp;Ambito",
      "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxOalhVVDlfdV9lbzdzQWhSZ3J1eG5GdHBfbWtaTHY0bEJyOFNFUjQ3M2gxbUlkREpPOFhaQlpJMDhiTGd3UU11WEpqUG9pRzlsMDkyVHVwVmJFSGRSUEQ2ZmU2RVlRcWNCZjB5eExVNy0xTnVERkdPZ0pONXR1Q21Gc0ZpcmM0a0dhbWl3c2tWeWxUWkxqTlh2QjJySENRVHFvUTcxR1FhZ3BiaDVhUV9iSDRFZXl4aUV3aGpwVmJBU3Y2UlVnSXpzN2pQd0Z3M1l10gHrAUFVX3lxTE9URUVqN1lUVVQtWVhrUFkwdnBGOHBfcjZkR0VwYnRnN0pTczhLS1l1aXdlRWwxZTJ2Y3F3SFFZcWl5c3I5QmRMRWcyVDVtWEhMSzZFSjhRTzdMMDNRS0w2ZmZmbU10b3VRU1l5UnZOUGd0ejFCaEZKT0FueE4tTHFHdnBmVVNONkR1RXdyS1pVaGJWb0ZjWTRpRENpWHR1d3RxZ2tqZ1NUdHdvdUdfU1RYUU5mcUlGWFJXMU1weTJRLUhTcmZtcGpJS0sxcTRQR0ZMOEp1cmg0V3luUHdxaGlmWWJobFhXZEJLMFE?oc=5",
      "source": "news.google.com",
      "category": "Marketing",
      "published_date": "Wed, 01 Oct 2025 13:19:18 GMT",
      "author": null,
      "content": ""
    },
    {
      "title": "Bill Gates predijo el fin del iPod de Apple por los smartphones - Santa Fe Canal",
      "description": "Bill Gates predijo el fin del iPod de Apple por los smartphones&nbsp;&nbsp;Santa Fe Canal",
      "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPNG1SMnQ5M0ZtWGlrNjlXMTMyQkw0T1ZNM0lYelZGWl85Ymg5WE1RbE9iZmpVaEktZERORW5oNDZyWURmbTg2QS1VeGdhazFHOVdwVzl0bTgyR2Jhc3BTMkVVLTJ4bHVqVjlSTzBjeHV1VmlZSWQ4U2s3UjRrbXlUMG9QYXlHVjFfcDgyV3JPR2g3YzVFRzVj?oc=5",
      "source": "news.google.com",
      "category": "Marketing",
      "published_date": "Wed, 01 Oct 2025 11:38:50 GMT",
      "author": null,
      "content": ""
    },
    {
      "title": "Conoce los nuevos dispositivos Echo de Amazon, impulsados por su IA Alexa+ - Infobae",
      "description": "Conoce los nuevos dispositivos Echo de Amazon, impulsados por su IA Alexa+&nbsp;&nbsp;InfobaeFire TV Stick 4K Select: su mayor salto no llega por la imagen, sino por el futuro sistema operativo...&nbsp;&nbsp;XatakaAmazon presenta nueva generación de Kindle, Ring, Echo y otros dispositivos con IA&nbsp;&nbsp;La NaciónAnalizamos el altavoz inteligente Amazon Echo Dot 5ª generación&nbsp;&nbsp;El CorreoAmazon actualiza su línea de hardware con nuevos Kindle, Echo, Fire TV, Blink y Ring&nbsp;&nbsp;MuyComputer",
      "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNV0JHT3VHbW1pSk5DTmJrNTZyQ0MtdmV0ODZKZWFGNXFlUmlEdjFRTmJVT0xmU09OQzRTOUhOY184RDVRM3hfZEZ1Y2pFZ1lLQUpZdThaMXFrTjVjTVhPZ2ZNZnF3Z0NBaDQ0WThFWjdESC1wM2NnZ3piWHpmNlhfR3dsQUFDTE9fUVVBMGJOYTZUcGYtOU1lbEc3YnA3STJVRlU4Ti12WjdSc2dtcDUwck1DeW3SAc8BQVVfeXFMUHg3Z1E4Qzl5OHVscXl6UzBUMUtCVmFMSGtvdi1vX2RmeU5VdXZkRVBzemIwOUZRUVhIVmI3WHpqN3FuUFZVS1RweUJJZ3ViLVQwNmlSZHd0aGFNZ05UTHF6QlEzTmxBSUpsWHNOYjVDMHFqVGplVjJwQ2RMSjhxNE5CTVYyTEdJTUtzekQ5MUdCaFpQcmVya0JDMjVtOElFR3lFUkR3QWhUdTV2OEVncFRaRGgwSmkwdlQwZzJpSldUbThqVjdlUE9HcVlRbjVV?oc=5",
      "source": "news.google.com",
      "category": "Marketing",
      "published_date": "Tue, 30 Sep 2025 22:02:00 GMT",
      "author": null,
      "content": ""
    },
    {
      "title": "Estos celulares se quedan sin WhatsApp a partir de octubre 2025 - La Nación",
      "description": "Estos celulares se quedan sin WhatsApp a partir de octubre 2025&nbsp;&nbsp;La NaciónWhatsApp dejará de funcionar en estos celulares a partir del 1 de octubre de 2025&nbsp;&nbsp;Infobae¿No hay WhatsApp? Los momentos en 2025 en que la aplicación falló&nbsp;&nbsp;Clarin.comConfirmado | Estos iPhone se quedarán sin WhatsApp a partir de octubre 2025&nbsp;&nbsp;MediotiempoAtención: estos son los celulares en los que no podrás usar WhatsApp a partir de mañana&nbsp;&nbsp;TN",
      "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQS0k0a0hFQnNZdUd6ZmhuRk9uYUJhME02VEZlaTd0d1dUQU9zNEFVejY3VW9pM1k2cVRRU0tHS2xZR2h0QUZYVmhXNHNZQU9fTFN3UTloTWdPWkV0eGRyN0ZEVk03NEY2dFpYS3lzUnFzOTMzU3ptUVVZS0RIMG92Qk9naUdsWDJMQXVQWk84VmtHaTFSaVREaGZ3?oc=5",
      "source": "news.google.com",
      "category": "Marketing",
      "published_date": "Wed, 01 Oct 2025 10:28:00 GMT",
      "author": null,
      "content": ""
    },
    {
      "title": "El desafío de Apple ante la inteligencia artificial: entre la cautela y la urgencia de reinventarse - Infobae",
      "description": "El desafío de Apple ante la inteligencia artificial: entre la cautela y la urgencia de reinventarse&nbsp;&nbsp;Infobae",
      "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxOcVowWXRJMWFiUkIxVnRHTmx5ZHJsZWRwX1ZiUmszN3oyRkY1LVkweG9BeWE0QWw5SHgyNjJaYjNCX19BUlJUdVhEbDhjbzZrNF9oTGJ2UUp1VEk3Qnd3S0JrR2dzQkd3eW9sNFY3SGdYb1dZV2pGR1oybWxEX0U4YTV3UjBZQlM5bHdYNTBDYTl6cm5vNzJQbUYzdVdtVzhzVlFWTXJIZHdOb0M1MmNuYWljTUdkWVMyUmN1U0pJTXB3OFlMR0ZhUmRSTldJLTF0Vk9yN1IwRdIB8gFBVV95cUxQOWtTZ01sNXQyWDlaRmE4dzFCQnpWRmRKdGFqMVVYeXFTcDNiMkVHOXNqbE1NM0ROUWJsLWtCcm5XNGZkMVdPaHo1S3NabHRYOTdrdFVWd3JxRHBRZHl4YUE0UFozTkZ3TU9QcWFlR29pVFhFaktrUmV3cDZGOHZSWmtFOFFiU1ZhbFo1WlVNOUZ3dGlpblN1d3p3Y3I4amFCbGkzNGtKNzZ2a2tDRXpKRFdhVnR2djhWV2RNY1hxazcxLUx1dkVuZXBxWjRGMS1GS2swRWhJUWRfQWpKVVRxdUN5SzA4aGlrMmFxc1A3UnBDQQ?oc=5",
      "source": "news.google.com",
      "category": "Marketing",
      "published_date": "Tue, 30 Sep 2025 12:00:00 GMT",
      "author": null,
      "content": ""
    },
    {
      "title": "Llevo una semana con el iPhone 17: jamás esperaba encontrarme algo así - Hipertextual",
      "description": "Llevo una semana con el iPhone 17: jamás esperaba encontrarme algo así&nbsp;&nbsp;HipertextualCorrientes: el iPhone17 ya acumula decenas de consultas&nbsp;&nbsp;Diario Época Corrientes¿Dudando en comprar un iPhone 17? Espera a noviembre y obtendrás estos 2 beneficios&nbsp;&nbsp;La Manzana MordidaiPhone 16 vs iPhone 17:Unas pequeñas diferencias que significan mucho. Echa un vistazo.&nbsp;&nbsp;Jablíčkář.cziPhone 17 Pro Max, análisis: el cambio que necesitaba el iPhone más ambicioso no se aprecia a simple...&nbsp;&nbsp;Xataka",
      "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE1oQ00tYW94UVFxNHVWcTRxZlp3UlF1SXk4Q3ljbEdlS3Vtal9waElYaWRSakNtMHhtbEdMMDZ5MXZoZ3RDci02VDFIb202b2hDdldOZE9CZ2V6RVZuLWpqM3dTOA?oc=5",
      "source": "news.google.com",
      "category": "Marketing",
      "published_date": "Tue, 30 Sep 2025 14:35:46 GMT",
      "author": null,
      "content": ""
    },
    {
      "title": "Kindle Scribe Colorsoft, ReMarkable Paper Pro Move: más color y más IA para los anotadores de tinta electrónica - La Nación",
      "description": "Kindle Scribe Colorsoft, ReMarkable Paper Pro Move: más color y más IA para los anotadores de tinta electrónica&nbsp;&nbsp;La NaciónEl Kindle Scribe se renueva por completo y al fin está disponible con pantalla a color&nbsp;&nbsp;HipertextualEsto es todo lo que sabemos sobre el nuevo Kindle Scribe Colorsoft: el lanzamiento más esperado del 2025 por los lectores&nbsp;&nbsp;Topes de GamaLa nueva función de Kindle de Amazon Brilliant podría ser el mejor uso de la IA que he visto&nbsp;&nbsp;aaaj.com.arAmazon desvela el Kindle Scribe (3ª generación) con un nuevo diseño, una pantalla más grande y una variante sin luz frontal&nbsp;&nbsp;Notebookcheck.org",
      "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxNVlZaMy1jSzhXalNxNjBxbGg1UXpvdUM1U3BGNTU1VmxJWHQtYjBWNXNvTzgwLWF2QWRlNG5GcTZncFAzMXFuMmhZWURIT01XTzhETXBZdEQ2cEJDX0FBdlZEUHg0VkZWUlFoTHNTbUdNWWlxbmMxcDBpWXFTbTN1d1pBS2hlcTJzY1RxWEFjX0ZSelRZb1FFa3FNenFYYlZYM1lDdjdKZ0tNZml5bTFWUFJaZGoxT0N4T0hzOW1mZjcwb3ZpSGU3SUpFTmdEWXA5eVpCME45Zy1FYklWM0tqVVlPNA?oc=5",
      "source": "news.google.com",
      "category": "Marketing",
      "published_date": "Tue, 30 Sep 2025 17:14:00 GMT",
      "author": null,
      "content": ""
    },
    {
      "title": "Microsoft lanza la actualización de Windows 11 2025: estas son las novedades - Hipertextual",
      "description": "Microsoft lanza la actualización de Windows 11 2025: estas son las novedades&nbsp;&nbsp;HipertextualYa disponible la actualización de Windows 11 2025&nbsp;&nbsp;InfobaeMicrosoft despliega la versión final de Windows 11 25H2 y así puedes instalarla&nbsp;&nbsp;MuyComputerCómo descargar Windows 11 25H2 desde los servidores oficiales de Microsoft (tutorial claro y paso a paso)&nbsp;&nbsp;FrikipandiWindows 11 se actualiza con 41 mejoras: así puedes instalar los cambios ahora mismo&nbsp;&nbsp;SoftZone",
      "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxObmNra1MxZXZfdjZSdlZPNTlPUGhrRk5RckRfUm5oMjlKcWdOdWhsVkFMc0hFbVdNRHA4cnh3WHM5Y0JiSmp2NFRVMEx3bnNHWkk5OF93aU5hS18tV1NEMDNHb01FOWt4Sl9nVFdBTjRfYUdGN3cxZEFOaGlyWHg5SG5fZmRSZw?oc=5",
      "source": "news.google.com",
      "category": "Marketing",
      "published_date": "Tue, 30 Sep 2025 21:00:00 GMT",
      "author": null,
      "content": ""
    },
    {
      "title": "Salesforce’s 2025 holiday sales predictions center around AI, pricing",
      "description": "Artificial intelligence — and especially agentic AI — will play a key role in discovery during the upcoming holiday sales season, according to a set of predictions from ecommerce software provider Salesforce. In May, Salesforce found that 6% of U.S. consumers were starting their online searches using a large language model (LLM), such as ChatGPT [&#8230;] The post Salesforce's 2025 holiday sales predictions center around AI, pricing appeared first on Digital Commerce 360.",
      "url": "https://www.digitalcommerce360.com/2025/09/30/salesforce-final-holiday-sales-projections-2025/",
      "source": "digitalcommerce360.com",
      "category": "Marketing",
      "published_date": "Tue, 30 Sep 2025 20:52:04 +0000",
      "author": "Abbas Haleem",
      "content": "Artificial intelligence — and especially agentic AI — will play a key role in discovery during the upcoming holiday sales season , according to a set of predictions from ecommerce software provider Salesforce. In May, Salesforce found that 6% of U.S. consumers were starting their online searches using a large language model (LLM), such as ChatGPT or Perplexity. By the end of August, that had increased to 9% of U.S. consumers. Gen Z and millennial consumers lead the charge in that trend, according to Salesforce data, but baby boomers went from 0% adoption in May to 3% adoption by the end of August. Additionally, Salesforce found that 20% of U.S. consumers are using agentic search at some point during their buying journey, even if they aren’t starting with it. That AI usage stems in part from consumers trying to find the right products and get the value they’re looking for in their purchases. Caila Schwartz, director of consumer insights at Salesforce, told Digital Commerce 360 that consumers have been cautious so far in 2025. “Shoppers told us pretty much the same thing that they told us in 2024, which is that they’re buying less,” Schwartz said. “They’re prioritizing essentials and they’re trading down for lower-priced goods.” In North America, 76 of the Top 2000 online retailers use Salesforce as their ecommerce platform, according to Digital Commerce 360 data. In 2024, those 76 online retailers combined for more than $182.46 billion in web sales. The Top 2000 is Digital Commerce 360’s database ranking North America’s largest online retailers by their annual ecommerce sales. Salesforce revenue officially exceeds $10 billion in Q2 Schwartz said the theme Salesforce has identified going into the 2025 holiday shopping season is “discovery.” Between LLMs and TikTok search , the way consumers find products is shaping their buying decisions and the way they interact with brands, she said. This holiday season, Salesforce predicts agentic search will also be a part of the in-store shopping process for consumers using AI. Furthermore, it expects a pair of trends to impact pricing in November and December. Altogether, Salesforce has released five predictions for the holiday shopping season: Those vary slightly from its mid-summer predictions , which also focused on: Remaining the same since the summer — with new data to back them — are Salesforce’s predictions that omnichannel strategies will “supercharge” sales and that trade uncertainty will increase the amount of resale. Online holiday sales in 2024 'most mobile of all time' Salesforce predicts consumers globally will spend $1.25 trillion in online sales between November and December. If correct, that would amount to a 4% increase year over year, based on Salesforce’s 2024 holiday season data. In the U.S., Salesforce is projecting a smaller increase in holiday sales. It expects $288 billion in holiday online sales, which would be a 2.1% increase. Salesforce also projected online holiday sales for Canad..."
    },
    {
      "title": "Hertz launches online car-buying platform",
      "description": "Hertz Car Sales has introduced a fully online car-buying platform at HertzCarSales.com, enabling customers to browse, finance, and purchase vehicles nationwide without visiting a dealership. The new platform allows users to receive trade-in offers, get pre-qualified for financing, view protection plans, and secure credit approval to complete a purchase online. Previously an online catalog, the [&#8230;] The post Hertz launches online car-buying platform appeared first on Digital Commerce 360.",
      "url": "https://www.digitalcommerce360.com/2025/09/30/hertz-launches-online-car-buying-platform/",
      "source": "digitalcommerce360.com",
      "category": "Marketing",
      "published_date": "Tue, 30 Sep 2025 17:17:55 +0000",
      "author": "Mark Brohan",
      "content": "Hertz Car Sales has introduced a fully online car-buying platform at HertzCarSales.com, enabling customers to browse, finance, and purchase vehicles nationwide without visiting a dealership. The new platform allows users to receive trade-in offers, get pre-qualified for financing, view protection plans, and secure credit approval to complete a purchase online. Previously an online catalog, the site now functions as a full-service ecommerce channel. “This marks a major step forward in modernizing how we serve our customers with a seamless journey from browsing to ownership,” said Gil West, CEO at Hertz. “By enhancing our digital capabilities, we’re meeting customers where they are and giving them greater visibility into our inventory, easier purchasing processes, and broader access to quality Hertz vehicles.” Hertz to become first fleet partner to sell vehicles on Amazon Autos The launch expands Hertz’s digital retail strategy, which has included upgrades to its Rent2Buy program and a collaboration with Amazon Autos . The companies initially limited the partnership to four cities. It’s now available across all Hertz Car Sales locations. It also lets customers browse and finance vehicles directly on Amazon. To promote the new platform, Hertz will launch a national advertising campaign on Oct. 1 featuring former NFL quarterback Tom Brady. The campaign will highlight online purchasing options alongside in-person sales at Hertz’s 45 retail locations. Hertz Car Sales markets used vehicles priced below Kelley Blue Book Suggested Retail Value. Vehicles undergo a 115-point inspection and are sold with: The company said online expansion reflects its broader strategy to make retail its primary channel for selling vehicles. Sign up for a complimentary subscription to Digital Commerce 360 B2B News . It covers technology and business trends in the growing B2B ecommerce industry. Contact Mark Brohan, senior vice president of B2B and Market Research, at mark@digitalcommerce360.com . Follow him on Twitter @markbrohan. Follow us on LinkedIn , X (formerly Twitter) , Facebook and YouTube ."
    },
    {
      "title": "Report: B2B marketers lag on AI content creation",
      "description": "B2B marketers are under pressure to make their content discoverable by artificial intelligence (AI) platforms, but most remain unprepared, according to new research from agency 10Fold Communications. The vendor surveyed 400 senior marketing executives across North America and Europe. Just 11% said they have optimized most of their content — defined as 75% to 100% [&#8230;] The post Report: B2B marketers lag on AI content creation appeared first on Digital Commerce 360.",
      "url": "https://www.digitalcommerce360.com/2025/09/30/report-b2b-marketers-ai-content-creation-discovery/",
      "source": "digitalcommerce360.com",
      "category": "Marketing",
      "published_date": "Tue, 30 Sep 2025 17:04:49 +0000",
      "author": "Mark Brohan",
      "content": "B2B marketers are under pressure to make their content discoverable by artificial intelligence (AI) platforms, but most remain unprepared, according to new research from agency 10Fold Communications. The vendor surveyed 400 senior marketing executives across North America and Europe. Just 11% said they have optimized most of their content — defined as 75% to 100% — for AI discovery. Even so, marketers are shifting their priorities. More than a third (35%) cited “Generative Engine Optimization” (GEO) as their top measure of success. That was slightly ahead of brand awareness (34%) and traditional search engine optimization (SEO, 29%). “Marketers are no longer just creating more content,” said Susan Thomas, CEO of 10Fold Communications. “They’re creating content that’s built to be found by AI. AI search is already the second largest driver of qualified leads, and forward-looking teams are investing in GEO, metadata and structured language to ensure they stay visible in an AI-first landscape.” ChatGPT debuts new checkout experience for Etsy, Shopify merchants The study found AI-native platforms such as ChatGPT and Perplexity now generate 34% of qualified leads from search, behind social media at 46% but ahead of organic search, email, and paid media. Adoption varies by region: 96% of companies in California and the U.K. reported having AI-searchable content, compared with 93% in France and 83% in Germany. Marketers continue to balance new tactics with traditional channels. 65% still distribute content through Google and other browsers, while 56% also use AI-native platforms. Most consumers continue to rely on Google Analytics and SQLs to measure performance, even as GEO gains importance. Spending trends reflect this balancing act. 37% of marketers said they are investing in GEO and AI search visibility, with another 37% funding AI-optimized content tools. 30% continue to spend on paid distribution, while about one-quarter prioritize organic reach and social amplification. Approaches to AI discoverability are split: 51% favor metadata and tagging, while 49% are turning to tactics such as optimizing featured snippets, publishing expert-driven content, designing for natural language, or hiring GEO consultants. The findings point to a content landscape in transition — where marketers are racing to adapt strategies for an AI-first environment but most still lack the readiness to fully capitalize. Sign up for a complimentary subscription to Digital Commerce 360 B2B News . It covers technology and business trends in the growing B2B ecommerce industry. Contact Mark Brohan, senior vice president of B2B and Market Research, at mark@digitalcommerce360.com . Follow him on Twitter @markbrohan. Follow us on LinkedIn , X (formerly Twitter) , Facebook and YouTube ."
    },
    {
      "title": "Cardinal Health plans automated pharmaceutical distribution hub",
      "description": "Cardinal Health Inc. will expand its national pharmaceutical distribution network with a new 230,000-square-foot facility in Indianapolis, designed to set a new benchmark for automation in the sector. It has scheduled the forward distribution center to open in fall 2027. It will manage part of the company’s more than 70,000 daily pharmaceutical and specialty deliveries [&#8230;] The post Cardinal Health plans automated pharmaceutical distribution hub appeared first on Digital Commerce 360.",
      "url": "https://www.digitalcommerce360.com/2025/09/30/cardinal-health-automated-pharmaceutical-distribution-hub-indiana/",
      "source": "digitalcommerce360.com",
      "category": "Marketing",
      "published_date": "Tue, 30 Sep 2025 16:48:30 +0000",
      "author": "Mark Brohan",
      "content": "Cardinal Health Inc. will expand its national pharmaceutical distribution network with a new 230,000-square-foot facility in Indianapolis, designed to set a new benchmark for automation in the sector. It has scheduled the forward distribution center to open in fall 2027. It will manage part of the company’s more than 70,000 daily pharmaceutical and specialty deliveries across the United States. Cardinal Health said the project will add more than 100 jobs in Indiana. It called the state a strategic transit hub for its operations. Cardinal Health grows its Vantus HQ ecommerce platform The facility will feature what the company described as the industry’s first robotic storage and retrieval system, developed with Swisslog, a warehouse automation specialist. The system will integrate robotics, conveyance and sorting to provide real-time inventory visibility and automated order fulfillment. Debbie Weitzman, CEO of Cardinal Health’s pharmaceutical and specialty solutions segment, said the investment reflects the company’s focus on reliability and efficiency. “Expanding and modernizing our distribution footprint reinforces our ability to drive growth and support our teams,” she said. Jamie Barker, senior vice president of pharmaceutical and specialty supply chain operations, said the Indianapolis site is also part of a broader multi-year strategy to improve productivity and customer service. “Automation remains a key component of our strategy,” he said. This is the second pharmaceutical distribution center Cardinal Health has announced since 2024. Based in Dublin, Ohio, the company is one of the largest U.S. distributors of pharmaceuticals, medical products, and specialty goods. Sign up for a complimentary subscription to Digital Commerce 360 B2B News . It covers technology and business trends in the growing B2B ecommerce industry. Contact Mark Brohan, senior vice president of B2B and Market Research, at mark@digitalcommerce360.com . Follow him on Twitter @markbrohan. Follow us on LinkedIn , X (formerly Twitter) , Facebook and YouTube ."
    },
    {
      "title": "ChatGPT debuts new checkout experience with Etsy, Shopify merchants as early users",
      "description": "OpenAI's ChatGPT rolled out a new checkout experience, arriving first for Etsy sellers and using the Agentic Commerce Protocol. Dubbed &#8220;Instant Checkout,&#8221; the new options are slated to arrive soon for Shopify merchants as well, introducing OpenAI's vision for ecommerce to a larger audience. The launch with Etsy follows news from January that Etsy would [&#8230;] The post ChatGPT debuts new checkout experience with Etsy, Shopify merchants as early users appeared first on Digital Commerce 360.",
      "url": "https://www.digitalcommerce360.com/2025/09/30/chatgpt-debuts-checkout-experience-etsy-shopify-merchants/",
      "source": "digitalcommerce360.com",
      "category": "Marketing",
      "published_date": "Tue, 30 Sep 2025 14:45:49 +0000",
      "author": "Brian Warmoth",
      "content": "OpenAI’s ChatGPT rolled out a new checkout experience, arriving first for Etsy sellers and using the Agentic Commerce Protocol. Dubbed “Instant Checkout,” the new options are slated to arrive soon for Shopify merchants as well, introducing OpenAI’s vision for ecommerce to a larger audience. The launch with Etsy follows news from January that Etsy would be one of the first brands to use OpenAI’s Operator agent . Instacart and eBay were also among those companies. However, OpenAI did not mention them in its Instant Checkout announcement. Etsy ranks No. 20 in the Global Online Marketplaces Database . The database is Digital Commerce 360’s ranking of the 100 largest marketplaces by annual third-party gross merchandise value (GMV). OpenAI debuts Operator, an AI agent with ecommerce applications “As a marketplace of over 5 million creative entrepreneurs, it’s our job to remove barriers for shoppers so they can easily discover and be delighted by our sellers’ special items,” wrote Rafe Colburn, chief product and technology officer at Etsy, in a Sept. 29 blog post . “To further these efforts, we’re partnering with OpenAI to meet shoppers where they are in their discovery journey.” Colburn said that as of Sept. 29, U.S.-based users could discover, browse and purchase items listed on Etsy “directly through ChatGPT.” In practice, OpenAI said the Instant Checkout experience will be open to U.S. ChatGPT Plus, Pro and Free users. They will be able to make purchases through results displayed in ChatGPT conversations. Next, OpenAI tagged “Shopify merchants, like Glossier, SKIMS, Spanx and Vuori,” for whom it announced Instant Checkout functionality would be “coming soon.” So far, Instant Checkout works for single-item purchases, with support for “multi-item carts” and use for more merchants and regions planned later on. Etsy shares agentic AI plans, grows revenue in Q2 “We’re proud to power Instant Checkout in ChatGPT and co-develop the Agentic Commerce Protocol to help businesses and AI platforms build the future of commerce,” said Will Gaybrick, president of technology and business at the payments vendor Stripe. OpenAI and Stripe co-developed and open-sourced the protocol . According to their documentation, ChatGPT sends “necessary details” to a merchant’s back end when an order is initiated. Then, a merchant can accept or decline the order. Once the order is accepted, the payment is processed through an existing provider and existing fulfillment and customer support services follow. Merchants that are existing Stripe customers have the option to enable payments within their site’s code, OpenAI noted. Meanwhile, sites that use different processors have the option to access Stripe’s Shared Payment Token API⁠ or the ACP Delegated Payments Spec. Submit your data and we’ll see where you fit in our next ranking update. Stay on top of the latest developments in the online retail industry. Sign up for a complimentary subscription to Digital Commerce 360 Retail News ...."
    },
    {
      "title": "Envive AI raises $15 million to expand AI platform for online retail",
      "description": "Envive AI has closed a $15 million Series A funding round led by Fuse VC. The funding brings the company’s total raise to $20 million, with participation from Point72 Ventures and the AI2 Incubator. Envive AI is a Seattle-based artificial intelligence startup focused on digital commerce. The company is developing what it calls an “intelligence [&#8230;] The post Envive AI raises $15 million to expand AI platform for online retail appeared first on Digital Commerce 360.",
      "url": "https://www.digitalcommerce360.com/2025/09/29/envive-ai-15-million-series-a-funding/",
      "source": "digitalcommerce360.com",
      "category": "Marketing",
      "published_date": "Mon, 29 Sep 2025 19:13:27 +0000",
      "author": "Mark Brohan",
      "content": "Envive AI has closed a $15 million Series A funding round led by Fuse VC. The funding brings the company’s total raise to $20 million, with participation from Point72 Ventures and the AI2 Incubator. Envive AI is a Seattle-based artificial intelligence startup focused on digital commerce. The company is developing what it calls an “intelligence layer” for commerce. Using reinforcement learning, Envive said its platform builds AI systems that learn from user behavior and coordinate actions across the entire shopping process — from product discovery and browsing through consideration, purchase, and retention. It designed the technology to help brands adapt to shifting consumer behavior and increase conversion rates without relying solely on static rule-based systems. Wesco invests in Kojo to build AI procurement tools for construction CEO and co-founder Aniket Deosthali previously led generative AI initiatives at Walmart . He said Envive AI’s goal is to create agents that improve continuously in real-world conditions while maintaining brand control and safety. “Commerce is entering a new phase where brands need systems that can adapt in real time,” he said. Envive already works with a set of established consumer brands, including Spanx, Supergoop!, Coterie, and Wine Enthusiast. The company said its customers have used the platform to: Investors say the opportunity lies in the growing role of AI in shopping decisions. McKinsey has reported that more than 25% of Generation Z consumers have already used AI to inform purchases, a figure expected to rise quickly over the next year. “Consumers deserve a better online shopping experience, and with Envive AI, brands can deliver that,” said Cameron Borumand, general partner at Fuse VC. Envive’s leadership team brings together expertise in both AI research and retail execution. Chief scientist Iz Beltagy is known for creating the OLMo model at the Allen Institute for AI, while chief architect Matt Peters co-invented ELMo, an early natural language model that influenced modern generative AI systems. Chief technology officer Sameer Singh is a researcher specializing in reinforcement learning. The company projects significant growth in 2025, supported by early adoption from consumer brands and the expanding use of AI in commerce. Point72 Ventures managing partner Sri Chandrasekar said Envive’s combination of advanced AI capabilities and retail expertise “makes them well positioned to lead as the industry evolves.” Sign up for a complimentary subscription to Digital Commerce 360 B2B News . It covers technology and business trends in the growing B2B ecommerce industry. Contact Mark Brohan, senior vice president of B2B and Market Research, at mark@digitalcommerce360.com . Follow him on Twitter @markbrohan. Follow us on LinkedIn , X (formerly Twitter) , Facebook and YouTube ."
    },
    {
      "title": "Nokia names an Intel veteran to lead its new AI division",
      "description": "Nokia is overhauling its leadership structure with the creation of two new organizations aimed at accelerating innovation and corporate strategy, while bringing in senior talent from Intel and Hewlett Packard Enterprise. The Finnish telecom equipment maker said Sept. 25 it will launch a technology and AI organization and a corporate development organization on Oct. 1. [&#8230;] The post Nokia names an Intel veteran to lead its new AI division appeared first on Digital Commerce 360.",
      "url": "https://www.digitalcommerce360.com/2025/09/29/nokia-intel-hp-veterans-new-ai-division/",
      "source": "digitalcommerce360.com",
      "category": "Marketing",
      "published_date": "Mon, 29 Sep 2025 16:48:51 +0000",
      "author": "Mark Brohan",
      "content": "Nokia is overhauling its leadership structure with the creation of two new organizations aimed at accelerating innovation and corporate strategy, while bringing in senior talent from Intel and Hewlett Packard Enterprise. The Finnish telecom equipment maker said Sept. 25 it will launch a technology and AI organization and a corporate development organization on Oct. 1. The shake-up will add Pallavi Mahajan, a former Intel executive, as chief technology and AI officer, and Konstanty Owczarek, who has most recently been with HPE, as chief corporate development officer. Both will join Nokia’s group leadership team. RB Global shakes up its leadership to drive marketplace growth The restructuring comes as Nishant Batra, Nokia’s chief strategy, and technology officer since 2020, steps down on Sept. 30. CEO Justin Hotard praised Batra for helping transform Nokia Bell Labs, advancing the company’s work on 6G, and accelerating its digital and security initiatives. Hotard said the changes reflect the company’s need to compete in what he called the “AI supercycle.” “Having a dedicated technology and AI organization will be an important asset for us and our customers,” Hotard said. “The new corporate development organization will accelerate our strategy evolution and execution and support our businesses.” Mahajan brings more than two decades of experience across networks, software, and artificial intelligence. At Intel, she led the data center and AI group and earlier ran the network and edge group, managing multibillion-dollar portfolios in cloud, mobility, and edge computing. Before Intel, she held senior roles at Hewlett Packard Enterprise, where she drove the company’s hybrid cloud strategy and supercomputing programs. She also spent more than a decade at Juniper Networks, where she led the development of early “self-driving” network technologies. Owczarek has held senior roles in corporate strategy and finance at HPE and AIG. At Nokia, he will oversee mergers and acquisitions, strategic partnerships, incubation projects, and venture investments through NGP Capital. Both Mahajan and Owczarek will report directly to Hotard when the changes take effect Oct. 1. Sign up for a complimentary subscription to Digital Commerce 360 B2B News . It covers technology and business trends in the growing B2B ecommerce industry. Contact Mark Brohan, senior vice president of B2B and Market Research, at mark@digitalcommerce360.com . Follow him on Twitter @markbrohan. Follow us on LinkedIn , X (formerly Twitter) , Facebook and YouTube ."
    },
    {
      "title": "AI and digital platforms fuel Q3 growth for TD SYNNEX",
      "description": "TD SYNNEX reported record results in its fiscal Q3, lifted by strong demand for AI-ready technology, cloud infrastructure, and its expanding digital commerce platform. For its fiscal Q3 ending Aug. 31, the company reported revenue of $15.7 billion. That's up 6.6% from $14.7 billion a year earlier. Net income climbed 27% to $226.8 million, compared [&#8230;] The post AI and digital platforms fuel Q3 growth for TD SYNNEX appeared first on Digital Commerce 360.",
      "url": "https://www.digitalcommerce360.com/2025/09/29/td-synnex-ai-digital-platforms-q3-fy25/",
      "source": "digitalcommerce360.com",
      "category": "Marketing",
      "published_date": "Mon, 29 Sep 2025 14:20:57 +0000",
      "author": "Mark Brohan",
      "content": "TD SYNNEX reported record results in its fiscal Q3, lifted by strong demand for AI-ready technology, cloud infrastructure, and its expanding digital commerce platform. For its fiscal Q3 ending Aug. 31, the company reported revenue of $15.7 billion. That’s up 6.6% from $14.7 billion a year earlier. Net income climbed 27% to $226.8 million, compared with $178.6 million in the prior quarter. On an adjusted basis, gross billing reached $22.7 billion, up 12.1% from $20.3 billion last year. Adjusted net income was $296.2 million, an increase of more than 20% from $245.4 million a year earlier. Through the first nine months of fiscal 2025, TD SYNNEX generated $47.1 billion in revenue. That’s up 4.4% from $45.1 billion in the same period of 2024. Net income rose 12% to $595.3 million, compared with $532.5 million a year earlier. The global IT distributor said sales of technology products and services rose 12% compared with last year, while profit per share increased 25%. Gains were broad across categories and regions, with standout growth in software (up 26%) and personal computers, thanks to rising interest in AI-enabled PCs and the ongoing Windows 11 upgrade cycle. Report: AI and cybersecurity will drive IT market growth Hyve, TD SYNNEX’s data center division, turned in one of its strongest quarters yet. Business jumped by more than a third, fueled by orders for networking, storage, and AI-integrated racks as cloud providers accelerated their buildouts. CEO Patrick Zammit said Hyve is now seeing growth spread beyond its largest customers, putting it in a stronger position for the months ahead. The company also rolled out Partner First, a new online hub for North American partners that combines ordering, services, training, and community features in one place. The platform, which will expand globally in the coming quarters, uses AI, automation, and analytics to simplify workflows and give customers more control over their buying journey. “Partner First represents the next phase in our omnichannel strategy, blending digital efficiency with specialist expertise to help partners adopt, scale, and secure AI solutions,” Zammit said. To support that effort, TD SYNNEX expanded its Destination AI program with three focus areas: The initiative is designed to help customers design hybrid architectures and bring new AI-driven services to market faster. Demand was particularly strong in Latin America and Asia Pacific/Japan, where sales rose by double digits. Small and mid-sized businesses also grew faster than the company average, while enterprise demand stayed steady. In the U.S., state and local government orders rose, offsetting weaker federal spending. Looking ahead, TD SYNNEX expects continued momentum in both distribution and data center infrastructure as businesses invest in digital tools and AI-powered systems. Sign up for a complimentary subscription to Digital Commerce 360 B2B News . It covers technology and business trends in the growing B2B ecommerce in..."
    }
  ]
}