{
  "category": "Corporate Advisory",
  "scraped_at": "2025-10-02T09:29:59.148069",
  "total_articles": 37,
  "articles": [
    {
      "title": "Europe’s junk borrowers flock to Nordic bond market",
      "description": "Issuance surges in jurisdictions known for lighter-touch documentation amid strong demand for high-yield debt",
      "url": "https://www.ft.com/content/fdab925f-9792-4143-b949-fc8c79f489fa",
      "source": "ft.com",
      "category": "Corporate Advisory",
      "published_date": "Thu, 02 Oct 2025 11:21:40 GMT",
      "author": null,
      "content": "Save now on essential digital access to quality FT journalism with the FT Digital Edition: today’s FT, cover to cover on any device. Then $75 per month. Complete digital access to quality FT journalism on any device. Cancel or change your plan anytime during your trial. Save now on essential digital access to quality FT journalism on any device. Saving based on monthly annualised price. Complete digital access to quality FT journalism with expert analysis from industry leaders. Pay a year upfront and save 20%. Check whether you already have access via your university or organisation. Discover all the plans currently available in your country Digital access for organisations. Includes exclusive features and content. See why over a million readers pay to read the Financial Times."
    },
    {
      "title": "China asks S&P’s mainland ratings group to ‘rectify’ operations",
      "description": "The industry has come under scrutiny for its low fees and high ratings",
      "url": "https://www.ft.com/content/a42745f4-4c22-4387-821f-3d0188745fe0",
      "source": "ft.com",
      "category": "Corporate Advisory",
      "published_date": "Thu, 02 Oct 2025 08:38:37 GMT",
      "author": null,
      "content": "Save now on essential digital access to quality FT journalism with the FT Digital Edition: today’s FT, cover to cover on any device. Then $75 per month. Complete digital access to quality FT journalism on any device. Cancel or change your plan anytime during your trial. Save now on essential digital access to quality FT journalism on any device. Saving based on monthly annualised price. Complete digital access to quality FT journalism with expert analysis from industry leaders. Pay a year upfront and save 20%. Check whether you already have access via your university or organisation. Discover all the plans currently available in your country Digital access for organisations. Includes exclusive features and content. See why over a million readers pay to read the Financial Times."
    },
    {
      "title": "Shadow banks are not outside the banking system",
      "description": "And that is a worry",
      "url": "https://www.ft.com/content/7c707670-ec41-4ae4-9b61-c60d77b89544",
      "source": "ft.com",
      "category": "Corporate Advisory",
      "published_date": "Thu, 02 Oct 2025 05:30:03 GMT",
      "author": null,
      "content": "Save now on essential digital access to quality FT journalism with the FT Digital Edition: today’s FT, cover to cover on any device. Then $75 per month. Complete digital access to quality FT journalism on any device. Cancel or change your plan anytime during your trial. Save now on essential digital access to quality FT journalism on any device. Saving based on monthly annualised price. Complete digital access to quality FT journalism with expert analysis from industry leaders. Pay a year upfront and save 20%. Check whether you already have access via your university or organisation. Discover all the plans currently available in your country Digital access for organisations. Includes exclusive features and content. See why over a million readers pay to read the Financial Times."
    },
    {
      "title": "Why the EU failed to make headway on its €140bn loan to Ukraine",
      "description": "Also in this newsletter: EU countries want better legal standards for foreign workers",
      "url": "https://www.ft.com/content/214dc782-8900-4531-87ac-3f01e7221849",
      "source": "ft.com",
      "category": "Corporate Advisory",
      "published_date": "Thu, 02 Oct 2025 05:00:04 GMT",
      "author": null,
      "content": "Save now on essential digital access to quality FT journalism with the FT Digital Edition: today’s FT, cover to cover on any device. Then $75 per month. Complete digital access to quality FT journalism on any device. Cancel or change your plan anytime during your trial. Save now on essential digital access to quality FT journalism on any device. Saving based on monthly annualised price. Complete digital access to quality FT journalism with expert analysis from industry leaders. Pay a year upfront and save 20%. Check whether you already have access via your university or organisation. Discover all the plans currently available in your country Digital access for organisations. Includes exclusive features and content. See why over a million readers pay to read the Financial Times."
    },
    {
      "title": "Big private equity groups risk harming sector’s standing, warns Neuberger Berman",
      "description": "Industry must avoid ‘lowering the bar’ on deals as it chases management fees",
      "url": "https://www.ft.com/content/5a567b28-2404-4beb-b4a2-9eee9d1ae593",
      "source": "ft.com",
      "category": "Corporate Advisory",
      "published_date": "Thu, 02 Oct 2025 04:00:04 GMT",
      "author": null,
      "content": "Save now on essential digital access to quality FT journalism with the FT Digital Edition: today’s FT, cover to cover on any device. Then $75 per month. Complete digital access to quality FT journalism on any device. Cancel or change your plan anytime during your trial. Save now on essential digital access to quality FT journalism on any device. Saving based on monthly annualised price. Complete digital access to quality FT journalism with expert analysis from industry leaders. Pay a year upfront and save 20%. Check whether you already have access via your university or organisation. Discover all the plans currently available in your country Digital access for organisations. Includes exclusive features and content. See why over a million readers pay to read the Financial Times."
    },
    {
      "title": "UK pension funds should invest more in science, says minister",
      "description": "Lord Vallance’s comments come as chancellor pushes UK pension funds to increase allocations to private markets",
      "url": "https://www.ft.com/content/64fdcb13-688b-4b4c-bd78-aece9a702677",
      "source": "ft.com",
      "category": "Corporate Advisory",
      "published_date": "Wed, 01 Oct 2025 23:01:00 GMT",
      "author": null,
      "content": "Save now on essential digital access to quality FT journalism with the FT Digital Edition: today’s FT, cover to cover on any device. Then $75 per month. Complete digital access to quality FT journalism on any device. Cancel or change your plan anytime during your trial. Save now on essential digital access to quality FT journalism on any device. Saving based on monthly annualised price. Complete digital access to quality FT journalism with expert analysis from industry leaders. Pay a year upfront and save 20%. Check whether you already have access via your university or organisation. Discover all the plans currently available in your country Digital access for organisations. Includes exclusive features and content. See why over a million readers pay to read the Financial Times."
    },
    {
      "title": "Shawbrook prepares to launch initial public offering",
      "description": "Private equity owners BC Partners and Pollen Street Capital revive plans to float UK small business lender",
      "url": "https://www.ft.com/content/8956973b-8652-4a8d-927b-808b042b0603",
      "source": "ft.com",
      "category": "Corporate Advisory",
      "published_date": "Wed, 01 Oct 2025 22:22:27 GMT",
      "author": null,
      "content": "Save now on essential digital access to quality FT journalism with the FT Digital Edition: today’s FT, cover to cover on any device. Then $75 per month. Complete digital access to quality FT journalism on any device. Cancel or change your plan anytime during your trial. Save now on essential digital access to quality FT journalism on any device. Saving based on monthly annualised price. Complete digital access to quality FT journalism with expert analysis from industry leaders. Pay a year upfront and save 20%. Check whether you already have access via your university or organisation. Discover all the plans currently available in your country Digital access for organisations. Includes exclusive features and content. See why over a million readers pay to read the Financial Times."
    },
    {
      "title": "Argentine assets hit by new selling amid worries over US bailout",
      "description": "Peso, stocks and bonds all fall as investors fret over lack of details from Washington on rescue plan",
      "url": "https://www.ft.com/content/6333a667-bdde-4e74-9dec-37afcb4db89b",
      "source": "ft.com",
      "category": "Corporate Advisory",
      "published_date": "Wed, 01 Oct 2025 21:59:08 GMT",
      "author": null,
      "content": "Save now on essential digital access to quality FT journalism with the FT Digital Edition: today’s FT, cover to cover on any device. Then $75 per month. Complete digital access to quality FT journalism on any device. Cancel or change your plan anytime during your trial. Save now on essential digital access to quality FT journalism on any device. Saving based on monthly annualised price. Complete digital access to quality FT journalism with expert analysis from industry leaders. Pay a year upfront and save 20%. Check whether you already have access via your university or organisation. Discover all the plans currently available in your country Digital access for organisations. Includes exclusive features and content. See why over a million readers pay to read the Financial Times."
    },
    {
      "title": "Podcasts | Reuters World News | Reuters",
      "description": "Everything you need to know about your world in 10 minutes.",
      "url": "https://www.reuters.com/podcasts/reuters-world-news/",
      "source": "reuters.com",
      "category": "Corporate Advisory",
      "published_date": null,
      "author": "",
      "content": "Everything you need to know about your world in 10 minutes. Go straight to the source with a ten-minute news briefing by Reuters frontline journalists. Join host Kim Vinnell as she takes you around the world every weekday. Israel has intercepted a flotilla of boats carrying aid and activists to Gaza, prompting global protests."
    },
    {
      "title": "Eric Trump signs up as client with Citigroup, Bloomberg News reports",
      "description": "Eric Trump, U.S President Donald Trump's son, has signed up as a client of Citigroup and established a trust that holds some of his father's money, Bloomberg News reported on Thursday, citing people with direct knowledge of the matter.",
      "url": "https://www.reuters.com/business/finance/eric-trump-signs-up-client-with-citigroup-bloomberg-news-reports-2025-10-02/",
      "source": "reuters.com",
      "category": "Corporate Advisory",
      "published_date": null,
      "author": "",
      "content": "Reporting by Arasu Kannagi Basil in Bengaluru; Editing by Leroy Leo Our Standards: The Thomson Reuters Trust Principles. , opens new tab"
    },
    {
      "title": "Trump nominates Hill to permanent role as US FDIC chair, source says",
      "description": "Travis Hill, the acting chair of the Federal Deposit Insurance Corp, has been nominated by U.S. President Donald Trump to lead the banking regulator permanently, a person familiar with the matter told Reuters on Wednesday.",
      "url": "https://www.reuters.com/world/us/trump-nominates-travis-hill-be-chair-us-fdic-bloomberg-news-reports-2025-10-01/",
      "source": "reuters.com",
      "category": "Corporate Advisory",
      "published_date": null,
      "author": "",
      "content": "Reporting by Pete Schroeder in Washington and Arasu Kannagi Basil and Bipasha Dey in Bengaluru; Additional reporting by Saeed Azhar; Writing by Manya Saini; Editing by Leroy Leo and Anil D'Silva Our Standards: The Thomson Reuters Trust Principles. , opens new tab Covers financial regulation and policy out of the Reuters Washington bureau, with a specific focus on banking regulators. Has covered economic and financial policy in the U.S. capital for 15 years. Previous experience includes roles at The Hill newspaper and The Wall Street Journal. Received a Master's degree in journalism from Georgetown University, and an undergraduate degree from the University of Notre Dame. Basil writes stories across the U.S. finance file including banks, asset managers, payment firms, insurers, and exchange operators. He also covers initial public offerings on U.S. exchanges and venture capital funding."
    },
    {
      "title": "‎Reuters - Breaking World News",
      "description": "‎Welcome to the Reuters News App! Stay informed with the latest global news and personalize your experience with our comprehensive features, all designed with your feedback in mind. Whether you're in a subscription country or enjoying access through our free registration process, we’re committed to…",
      "url": "https://apps.apple.com/app/reuters-news/id602660809",
      "source": "reuters.com",
      "category": "Corporate Advisory",
      "published_date": null,
      "author": "",
      "content": "Welcome to the Reuters News App! Stay informed with the latest global news and personalize your experience with our comprehensive features, all designed with your feedback in mind. Whether you're in a subscription country or enjoying access through our free registration process, we’re committed to delivering fast, reliable news from around the globe. Modern Design • Enjoy a sleek, intuitive interface with enhanced readability, featuring “Today,” your new hub for news. Enhanced Article Experience • Immerse yourself in news stories with a visually engaging layout, interactive graphics, and related content. My News • Customize your Reuters experience with a personalized feed based on your interests. Save articles to read later and easily manage your preferences. Breaking Markets Updates • Keep track of the latest market trends with our detailed Markets section. Create a personalized Watchlist and follow companies for breaking news. Media Hub • Explore our rich library of videos, podcasts, and photo galleries, including our popular podcast, Reuters Econ World. Customizable Push Notifications • Stay updated with personalized breaking news alerts and opt-in to podcast notifications. Support Quality Journalism • Subscriptions help us invest in broader coverage, deeper investigations, more innovative products, and exclusive subscriber experiences. Users in other countries will continue to receive access through our free registration process. We Value Your Feedback! • Leave us a review or contact Reuters Customer Support. Thank you for being part of our journey. Happy reading! ACCESS: The Reuters app is free to download. In order to gain full access to the Reuters app, you will need to sign-in / register and complete the subscription process within the app. Subscriptions are not available in certain territories. For these territories, users will continue to receive access via our free registration process. SUBSCRIPTION AND AUTOMATIC RENEWALS: Your subscription plan renews automatically unless cancelled at least 24 hours before the end of the current period. Payment will be charged by Apple at confirmation of your subscription purchase. Your account will be charged (in advance) automatically for renewal at the applicable price and at the selected frequency (whether monthly, annually or another period) within 24 hours prior to the end of the current period. You can manage your subscription and disable auto-renewal by accessing your Apple Account Settings after purchase (at least 24 hours before the end of your current billing period). Cancellation takes effect at the end of your current billing period. TERMS & CONDITIONS: In addition to the applicable Apple subscription terms and conditions (including the auto-renewal terms above), by downloading the Reuters app, you agree to: - Reuters Terms and Conditions: https://www.reuters.com/info-pages/terms-of-use/. - Reuters Privacy Statement: https://www.thomsonreuters.com/en/privacy-statement.html. - Reuters Cook..."
    },
    {
      "title": "Sign up to Reuters newsletters and update newsletter preferences",
      "description": "Reuters newsletters provide a comprehensive summary and analysis of the most important news, compiled by the world's most trusted news organization, and delivered to your inbox.",
      "url": "https://www.reuters.com/newsletters/",
      "source": "reuters.com",
      "category": "Corporate Advisory",
      "published_date": null,
      "author": "",
      "content": "The day's top news in your inbox. We cover the world, from front lines to boardrooms. (This includes the Reuters Weekend Briefing.) Has it been a busy week? Sign up for our recap, sent on Saturdays, to catch up on the stories you may have missed. Your weekly focus on innovative ideas and the people working on solutions to global crises. Insights and ideas from Reuters' global financial commentary team. The latest on geopolitics, energy and finance in the Gulf. Your daily guide to the latest global trade and tariff news. Learn about the latest breakthroughs in AI and tech. Latest news and expert analysis on the state of U.S. politics and how it matters to the world. The latest news from India and how it matters to the world. Reuters editors highlight a standout story each day that goes behind the news and brings you the bigger picture. Get the latest news and expert analysis about the state of the global economy. Stay up to date on the key companies, data, and decisions in the world of ESG finance. Make sense of companies and governments grappling with climate change, diversity, and human rights. Everything you need to know about the global energy industry and the forces driving the transition to renewable fuels. Stay up to date with the latest news, trends and innovations that are driving the global automotive industry. Keep up with the latest medical breakthroughs, healthcare trends, pharmaceutical news and more. For U.S. readers, get personal finance tips and insights from editor Lauren Young. A look at the day ahead in U.S. and global markets from Mike Dolan. A look at the day ahead in European and global markets from Kevin Buckland and team. Make sense of global markets with Jamie McGeever. Make sense of the market with highlights of the latest news and trends in global financial markets. From startups to the FAANGs, get the latest news and trends in the global technology industry. A daily digest of breaking business news, major corporate news and the financial markets. A smart look at the day's most important headlines concerning the courts, law firms, and the practice of law. Delivered every weekday afternoon, The Afternoon Docket is a quick look at the day's breaking legal news and analysis. نشرة رويترز اليومية لأهم الأنباء تقدم لكم وكالة رويترز عبر نشرتها البريدية اليومية تغطية إخبارية موثوقة وشاملة لأهم المستجدات السياسية والاقتصادية والمالية في المنطقة العربية والعالم. تصلكم الأخبار العاجلة والتحليلات المعمّقة من فريق التحرير العربي مباشرة إلى بريدكم الإلكتروني بصيغة احترافية تواكب تطلعات القراء وصناع القرار."
    },
    {
      "title": "Oneleet raises $33M to shake up the world of security compliance",
      "description": "Founder Bryan Onel says too many companies are doing the bare minimum to meet their security compliance obligations, and raised $33 million to help his customers get both compliant and secure.",
      "url": "https://techcrunch.com/2025/10/02/oneleet-raises-33m-to-shake-up-the-world-of-security-compliance/",
      "source": "techcrunch.com",
      "category": "Corporate Advisory",
      "published_date": "Thu, 02 Oct 2025 12:00:00 +0000",
      "author": "Dominic-Madori Davis",
      "content": "Bryan Onel’s father was a locksmith. As for Onel, he described himself as the digital equivalent. Ethical hacking was Onel’s hobby growing up. He studied AI at university and then turned that hacking hobby into a profession. “I spent a decade performing penetration tests for over 150 companies across all sectors,” Onel tells TechCrunch, adding that he kept easily breaking into companies that had passed their security checks. Onel realized that security often fell within two brackets: Painful but effective, or painless but ineffective, he said. Most companies were doing the bare minimum in cybersecurity and compliance, as it often takes too much work — and tools and talent — to provide effective security defenses. Onel’s clients kept asking if he could provide a solution to their problems, so he gave it a shot. In 2022, he teamed up with his wife, Ora, and college friend Erik Vogelzang, and launched Oneleet, an all-in-one security compliance platform. The startup aims to help other companies get their security certifications while helping them become more secure faster. Onel tells TechCrunch that most existing compliance platforms are evidence-collection tools, where users import data from their various products, pay a fee, and then voila! — out spits a security certificate saying they are secure. “The result is compliance theatre,” Onel tells TechCrunch. “You’re certified on paper, but still vulnerable to all kinds of attacks.” Oneleet is different, said Onel. The platform includes a suite of security tools: penetrating testing, code scanning, cloud data security, attack surface management, security training, and more, he said, which aims to provide a better window into a company’s security defenses. “Because it’s integrated from the ground up, we can deploy comprehensive security with the click of a button,” Onel continued. “That saves clients hundreds of hours and eliminates the blind spots that come from managing fragmented tools.” Oneleet then partners with independent auditors to provide formal certification reviews. On Thursday, Oneleet announced it raised a $33 million Series A funding round led by Dawn Capital to help grow the business. Onel called his fundraising process “straightforward,” and said he met Dawn Capital in San Francisco, where he described “immediate chemistry.” “They already had deep knowledge of the security and compliance space and immediately understood what we were building at Oneleet, so there was instant alignment,” said Onel. Other investors in the round include Y Combinator, Dropbox co-founder Arash Ferdowsi, and former Snowflake and ServiceNow chief executive Frank Slootman. Oneleet participated in the Summer 2022 class of Y Combinator, and said two-thirds of new additions to the VC firm’s portfolio companies are now its clients. Competitors in this space include Vanta, Secureframe, and Sprinto. For its part, Oneleet has reached $9 million in annual recurring revenue and has raised $35 million in total to date. T..."
    },
    {
      "title": "Visa crackdowns are blocking students’ study-abroad dreams, so India’s Leverage Edu is rerouting them",
      "description": "Leverage Edu places over 10,000 students annually into universities across 11 countries.",
      "url": "https://techcrunch.com/2025/10/01/visa-crackdowns-are-blocking-students-study-abroad-dreams-so-indias-leverage-edu-is-rerouting-them/",
      "source": "techcrunch.com",
      "category": "Corporate Advisory",
      "published_date": "Wed, 01 Oct 2025 23:26:15 +0000",
      "author": "Jagmeet Singh",
      "content": "As visa crackdowns and diplomatic tensions block traditional study-abroad routes, India’s Leverage Edu is helping students reroute their dreams — from Canada to Germany, and from India to Nigeria and Saudi Arabia. That agility is paying off: The startup has doubled its revenue, turned profitable, and is now expanding its global footprint. Over the past several months, students across emerging markets have faced growing uncertainty around international college admissions. Shifting visa rules and diplomatic tensions — from the 2023-2024 standoff between India and Canada to new strains in India-U.S. ties over tariffs and immigration policy — have disrupted application timelines and eligibility for thousands. Countries such as Canada and Australia have introduced stricter student visa policies , catching many families off guard. Even long-standing local consultants and study-abroad firms have struggled to adapt. Meanwhile, Leverage — the startup behind the study-abroad platform Leverage Edu — has responded by helping students identify alternative destinations and adjust quickly, keeping their plans on track despite the disruption. The eight-year-old startup was quick to respond when India-Canada relations soured, helping Indian students reroute to Germany and assisting Canadian universities in recruiting from Nigeria — effectively salvaging student pipelines in both regions. It is now applying that same playbook amid ongoing U.S.-India strains. While Leverage continues to send students to the U.S., a growing share of that demand now comes from countries like Brazil and Vietnam — where interest in U.S. universities remains strong, founder and CEO Akshay Chaturvedi said in an interview. That ability to shift quickly across geographies is now central to Leverage’s growth strategy. In the last two months, the startup has expanded into Saudi Arabia, Egypt, Vietnam, and Malaysia — emerging markets with growing numbers of students seeking to study abroad but with limited access to structured admissions support. With this push, Leverage now operates in 16 countries where it recruits students, helping them apply to universities across 11 destination countries. Beyond applications, the startup — headquartered in Noida, a tech hub on the outskirts of New Delhi — is positioning itself as a full-service platform for international education, helping students plan, finance, and manage their journeys. Its tools include a mobile app, an AI-powered course search engine, a university matchmaking tool called UniConnect, and a newly launched SaaS suite for global universities under the brand Univalley.ai. The startup has also expanded into adjacent categories, with offerings like Leverage MBBS for medical aspirants under Leverage Edu, as well as Fly Finance for education loans, Fly Homes for student housing, and other services under Leverage Careers and Compass. Leverage now places over 10,000 students annually, up from around 1,500 just a few years ago. Much of that gro..."
    },
    {
      "title": "Instagram head says company is not using your microphone to listen to you (with AI data, it won’t need to)",
      "description": "The idea that Meta would secretly turn on the microphones on users' phones to record their conversations is an age-old conspiracy theory -- and one that the company has disputed before.",
      "url": "https://techcrunch.com/2025/10/01/instagram-head-says-company-is-not-using-your-microphone-to-listen-to-you-with-ai-data-it-wont-need-to/",
      "source": "techcrunch.com",
      "category": "Corporate Advisory",
      "published_date": "Wed, 01 Oct 2025 22:19:51 +0000",
      "author": "Sarah Perez",
      "content": "Instagram head Adam Mosseri posted on his account on Wednesday to dispel the myth that the social networking giant is actively “listening” to its users surreptitiously, in order to target them with relevant ads. The idea that Meta would secretly turn on the microphones on users’ phones to record their conversations is an age-old conspiracy theory — and one that the company has disputed before. But, ironically, Mosseri’s new myth-busting claim comes just as Meta has announced it will soon target ads to users across its social apps using data collected from their interactions with its AI products. In other words, if Meta didn’t need to record your conversations via your microphone before to produce eerily accurate recommendations, it definitely won’t need to now. On Instagram, Mosseri says he’s had a number of conversations about Meta listening to its users, many of whom can’t believe how well the company’s ad targeting actually works. (Even his wife has brought up the topic, he says.) A post shared by Adam Mosseri (@mosseri) By now, most of us have either had the experience ourselves or at least know someone who claims that Meta must have been secretly recording them to know what they were likely to click on. Sometimes, you are only thinking about a topic or product, and then see the content appear in your feed, making it seem as if Meta is a mind reader. The company has repeatedly disputed these claims, trying to explain that it doesn’t have to record your conversations to make its recommendations so successful. (Mosseri also says that would be a “gross violation of privacy,” but Meta is not a company that typically drives decisions with user privacy in mind .) Still, the company doesn’t necessarily have to “listen” to users to listen to them. In 2016, Meta (then known as Facebook) published a blog post that outright stated that it didn’t use your phone’s microphone to determine what ads to show users or what content appears in their News Feed. Years later, Meta CEO Mark Zuckerberg testified before Congress, denying once again that the company was collecting users’ audio data for this purpose. Happy to have something it can deny on the privacy front, just as it’s about to scoop up more data than ever before, Mosseri reiterates these points in his post on Instagram. He says that, for starters, users would know if their phone’s microphone was on because they would see a light at the top of their screen, and the phone’s battery would drain faster. Instead, Mosseri explains that the tech giant’s recommendation system is so powerful because of how it works with its advertisers, who share information with the company about who has visited their websites. That information helps Meta target users with relevant ads. In addition, the company shows people ads that it thinks they may be interested in based on what similar people with similar interests are also interested in. This algorithm-based ad tech has made Meta a money-printing machine over the years. ..."
    },
    {
      "title": "Self-driving trucks startup Einride raises $100M",
      "description": "Einride raised the funds five months after founder Robert Falck left the CEO role and took over as executive chairman of the board.",
      "url": "https://techcrunch.com/2025/10/01/self-driving-trucks-startup-einride-raises-100m/",
      "source": "techcrunch.com",
      "category": "Corporate Advisory",
      "published_date": "Wed, 01 Oct 2025 22:13:55 +0000",
      "author": "Kirsten Korosec",
      "content": "Einride, the Swedish startup known for its unusual-looking electric and autonomous pods that are designed to carry freight, said Wednesday it has raised $100 million from several new and existing investors, including its largest shareholder, EQT Ventures. The raise included an undisclosed strategic investment from quantum computing company IonQ. Neither Einride, nor its investors, disclosed the company’s post-money valuation. The funding comes as Einride adjusts to a new CEO and tries to scale its three business products: electric big rigs, autonomous pod-like trucks that navigate fixed routes, and planning software designed for shippers. Einride CEO Roozbeh Charli said the funding would allow the company to grow with its customer base and accelerate the deployment of its autonomous freight technology. The company, which was founded in 2016, started in Sweden with a mission to disrupt the freight industry — first with electric trucks, then with electric autonomous pods, which are purpose-built without a steering wheel or pedals for self-driving. Einride has expanded beyond Sweden and operates a fleet of heavy-duty electric trucks in Europe, North America, and the UAE, for companies like PepsiCo, Carlsberg Sweden, and DP World. The company has made some inroads with its autonomous pod-like trucks with customers Apotea in Sweden and GE Appliances in the United States. “We believe Einride is building the most complete and forward-looking freight ecosystem on the market today,” Ted Persson, partner at EQT Ventures, said in a statement. “Nordic tech has a habit of being underestimated, until it quietly rewires an entire industry. That’s exactly what Einride is doing in freight.” Still, Einride has undergone internal changes and has grappled — along with the rest of the nascent autonomous vehicle technology sector — with the long and expensive process of moving from development to commercial operations. Five months ago, Einride co-founder Robert Falck left the CEO role and took over as executive chairman of the board to focus on the company’s long-term strategy. Charli, who had been CFO, was promoted to the top leadership position. The company previously raised $500 million in 2022 in a Series C round of equity and debt. The equity-based $200 million portion came from backers including Northzone, EQT Ventures, Temasek, Swedish pension fund AMF, Polar Structure, and Norrsken VC. It also secured $300 million in debt funding led by Barclays Europe. ONE-WEEK BUNDLE FLASH SALE Founder Bundle Offer: Land your investor and sharpen your pitch. Save 15% when you bring 4-9 founders. Investors Bundle Offer: Discover your next breakout startup. Save 20% when you bring 4-9 investors. Bundle offer ends October 3. AI recruiter Alex raises $17M to automate initial job interviews Vibe-coding startup Anything nabs a $100M valuation after hitting $2M ARR in its first two weeks The AI services transformation may be harder than VCs think Famed roboticist says humanoid robo..."
    },
    {
      "title": "OpenAI staff grapples with the company’s social media push",
      "description": "Current and former OpenAI researchers seem torn over how the company's Sora app fits in with its broader mission.",
      "url": "https://techcrunch.com/2025/10/01/openai-staff-grapples-with-the-companys-social-media-push/",
      "source": "techcrunch.com",
      "category": "Corporate Advisory",
      "published_date": "Wed, 01 Oct 2025 21:33:11 +0000",
      "author": "Maxwell Zeff",
      "content": "Several current and former OpenAI researchers are speaking out over the company’s first foray into social media: the Sora app , a TikTok-style feed filled with AI-generated videos and a lot of Sam Altman deepfakes . The researchers, airing their grievances on X, seem torn over how the launch fits into OpenAI’s nonprofit mission to develop advanced AI that benefits humanity. “AI-based feeds are scary,” said OpenAI pretraining researcher John Hallman in a post on X . “I won’t deny that I felt some concern when I first learned we were releasing Sora 2. That said, I think the team did the absolute best job they possibly could in designing a positive experience … We’re going to do our best to make sure AI helps and does not hurt humanity.” AI-based feeds are scary. I won't deny that I felt some concern when I first learned we were releasing Sora 2. That said, I think the team did the absolute best job they possible could in designing a positive experience. Compared to other platforms, I find myself scrolling way… https://t.co/uLeeVMKncl Boaz Barak, another OpenAI researcher and Harvard professor, replied : “I share a similar mix of worry and excitement. Sora 2 is technically amazing but it’s premature to congratulate ourselves on avoiding the pitfalls of other social media apps and deepfakes.” Former OpenAI researcher Rohan Pandey used the moment to plug a new startup , Periodic Labs, which is made up of former AI lab researchers trying to build AI systems for scientific discovery: “If you don’t want to build the infinite AI TikTok slop machine but want to develop AI that accelerates fundamental science … come join us at Periodic Labs.” There were many other posts along the same lines. The Sora launch highlights a core tension for OpenAI that flares up time and time again. It’s the fastest-growing consumer tech company on Earth, but it’s also a frontier AI lab with a lofty nonprofit charter. Some former OpenAI employees I’ve spoken to argue the consumer business can, in theory, serve the mission: ChatGPT helps fund AI research and distribute the technology widely. OpenAI CEO Sam Altman said as much in a post on X Wednesday, addressing why the company is allocating so much capital and computing power to an AI social media app: “We do mostly need the capital for build [sic] AI that can do science, and for sure we are focused on AGI with almost all of our research effort,” said Altman. “It is also nice to show people cool new tech/products along the way, make them smile, and hopefully make some money given all that compute need.” “When we launched chatgpt there was a lot of ‘who needs this and where is AGI,’” Altman continued. “[R]eality is nuanced when it comes to optimal trajectories for a company.” i get the vibe here, but… we do mostly need the capital for build AI that can do science, and for sure we are focused on AGI with almost all of our research effort. it is also nice to show people cool new tech/products along the way, make them smile, and ho..."
    },
    {
      "title": "Better Tomorrow Ventures closes $140M, remains bullish on fintech",
      "description": "The six-year-old firm's third fund is nearly the size of it previous fund raised during the fintech boom in early 2022.",
      "url": "https://techcrunch.com/2025/10/01/better-tomorrow-ventures-closes-140m-remains-bullish-on-fintech/",
      "source": "techcrunch.com",
      "category": "Corporate Advisory",
      "published_date": "Wed, 01 Oct 2025 21:01:53 +0000",
      "author": "Marina Temkin",
      "content": "Sheel Mohnot, co-founder and general partner of Better Tomorrow Ventures (BTV), has one simple answer for anyone claiming that investing in fintech has lost some of its attractiveness. “The world of finance is huge. About 20% of global GDP is financial services, and it’s still not digital enough,” he told TechCrunch. Many financial transactions are still handled manually, and Better Tomorrow Ventures — led by Mohnot (a former general partner at 500 Startups) and NerdWallet co-founder Jake Gibson — aims to help change that. “The massive digitization opportunity is still ahead of us,” Mohnot told TechCrunch. The firm’s limited partners seem to agree. Better Tomorrow Ventures just raised a $140 million third fund, nearly matching the $150 million second fund, which was announced in early 2022 toward the end of the ZIRP (zero interest-rate policy) boom. “We actually planned to make the fund smaller this time,” Mohnot said. “In 2021, things went super overboard. Every company we invested in immediately raised a follow-on round at a crazy price, and that was probably bad,” Mohnot said. Now that the enthusiasm for fintech is tamer, BTV doesn’t need as much capital to continue to participate in its best startups, he explained. The firm also didn’t tap into the $75 million opportunity fund raised alongside its second fund in 2022. But that capital may come in handy at some point soon. Since many of the recent and planned IPOs are in the fintech space, including Chime, Klarna, Navan, and Wealthfront, there’s hope that late-stage investors will become more excited about the category. At the early stages, fintech investing has certainly picked up over the last year. For instance, BTV sees great opportunities in disrupting accounting. “There’s a massive shortage of accountants. Accounting firms are all turning away business, and it’s a perfect application for AI,” Mohnot believes. The firm has already backed three accounting startups: Basis, which recently raised a $34 million Series A led by Khosla Ventures; Layer , an embedded accounting platform for small and medium-sized businesses; and InScope , a startup that helps automate audited financial statement drafting. But it’s not just accounting: Mohnot is a strong believer in AI’s broad applications within fintech. “Financial Services is very labor-intensive. There’s underwriting, compliance, fraud detection, customer support,” he said. “AI can do all that at a lower cost.” Other notable companies in BTV’s portfolio include Coast , a payments platform for fleet and truck drivers; Unit, a banking-as-a-service startup last valued at $1.2 billion; Relay , an online banking and cash management platform for small businesses; and Unit , a banking-as-a-service startup last valued at $1.2 billion. For its third fund, the firm plans to invest in 30 to 35 companies, with check sizes ranging from $500,000 to $3.5 million. Marina Temkin is a venture capital and startups reporter at TechCrunch. Prior to joining TechCrunc..."
    },
    {
      "title": "What founders need to know before choosing their exit — straight from Roseanne Wincek, Jai Das, and Dan Springer — at TechCrunch Disrupt 2025",
      "description": "Hear from Jai Das (Sapphire Ventures), and Roseanne Wincek (Renegade Partners), and Dan Springer (Ironclad, and formerly Docusign) on how founders can prep for an exit at TechCrunch Disrupt 2025. Register here to save.",
      "url": "https://techcrunch.com/2025/10/01/what-founders-need-to-know-before-choosing-their-exit-at-techcrunch-disrupt-2025/",
      "source": "techcrunch.com",
      "category": "Corporate Advisory",
      "published_date": "Wed, 01 Oct 2025 20:37:22 +0000",
      "author": "TechCrunch Events",
      "content": "Exit planning is no longer optional — it’s an essential conversation on the Going Public Stage at TechCrunch Disrupt 2025 , happening October 27–29 at San Francisco’s Moscone West. Whether you’re already eyeing a liquidity event or just starting to scale, this is your chance to hear what top VCs and operators are looking for and how to set up your company for long-term success. Three of the best in the business — Roseanne Wincek of Renegade Partners; Jai Das of Sapphire Ventures; and Dan Springer , CEO of Ironclad, former CEO of DocuSign, and long-time Silicon Valley operator — will break down the decision-making process, from when to make a move to how to be ready when the moment comes. Register now to save up to $444 on your ticket — or up to 20% with a group of 4-9 . Don’t miss a moment of this insightful session. Startups can no longer afford to treat exit planning as an afterthought. Between tighter capital markets, shifting investor expectations, and growing regulatory complexity, founders need a smarter playbook — and this conversation delivers just that. You’ll get real talk on key timing considerations, market signals to watch, and how to structure your business for optionality, whether you’re thinking IPO, acquisition, or just keeping your head down and building. It’s a candid, high-level look at how the best founders are preparing for every possible outcome. TechCrunch Disrupt 2025 brings together over 10,000 startup and VC leaders from around the world, and this session is your front-row seat to one of the most important conversations founders will face. Register now to get your pass for Disrupt — with savings of up to $444 — and take the guesswork out of your exit strategy. Bring your crew and save big — up to 20% off passes for a group of 4-9. Offer ends Friday, October 3 . Get your bundle tickets here . ONE-WEEK BUNDLE FLASH SALE Founder Bundle Offer: Land your investor and sharpen your pitch. Save 15% when you bring 4-9 founders. Investors Bundle Offer: Discover your next breakout startup. Save 20% when you bring 4-9 investors. Bundle offer ends October 3. AI recruiter Alex raises $17M to automate initial job interviews Vibe-coding startup Anything nabs a $100M valuation after hitting $2M ARR in its first two weeks The AI services transformation may be harder than VCs think Famed roboticist says humanoid robot bubble is doomed to burst Electronic Arts will reportedly be acquired for $50B Spotify to label AI music, filter spam and more in AI policy change It isn’t your imagination: Google Cloud is flooding the zone"
    },
    {
      "title": "Anker offered to pay Eufy camera owners to share videos for training its AI",
      "description": "Hundreds of Eufy customers have donated hundreds of thousands of videos to train the company’s AI systems.",
      "url": "https://techcrunch.com/2025/10/01/anker-offered-to-pay-eufy-camera-owners-to-share-videos-for-training-its-ai/",
      "source": "techcrunch.com",
      "category": "Corporate Advisory",
      "published_date": "Wed, 01 Oct 2025 20:24:06 +0000",
      "author": "Lorenzo Franceschi-Bicchierai",
      "content": "Earlier this year, Anker, the Chinese company that makes Eufy security cameras, offered its users money in exchange for videos of package and car thefts. The popular internet-connected security camera maker said it would pay its customers $2 per video to train its AI systems to help better detect thieves who steal cars and packages. “To ensure we have enough data, we are looking for videos of both real and staged events, to help train the Al what to be on the lookout for,” the company wrote on its website. “You can even create events by pretending to be a thief and donate those events,” the website reads. “You can complete this quickly. Maybe one act can be captured by your two outdoor cameras simultaneously, making it efficient and easy. If you also stage a car door theft, you might earn $80.” Eufy also wrote that “the data collected from these staged events is used solely for training our Al algorithms and not for any other purposes.” This initiative shows that companies are willing to pay to get users’ data they think can be useful to train their AI models. While this gives some users the ability to get value out of their own data, there are security and privacy risks involved. Case in point: Last week, TechCrunch found that Neon, a viral calling app that offered money to users willing to share recordings and transcripts of their calls, had a security flaw that allowed users to access any other user’s data . After being alerted of the security lapse, Neon went offline. Eufy’s campaign offering $2 per video for theft videos ran from December 18, 2024, to February 25, 2025. More than 120 users responded on the campaign’s announcement page saying they participated in it, according to comments posted by users there. The company’s goal was to collect 20,000 videos each of package thefts and of “pulling car doors.” Eufy users could participate by filling out a Google Form where they could upload videos and their PayPal account for payment. Eufy did not respond to TechCrunch’s requests for comment and our questions, such as how many users participated in the campaign, how much money it paid those users, how many videos the company collected, and whether the company deleted the collected videos after training its AI systems. Since then, Eufy has similar campaigns aimed at incentivizing its customers to send in videos to train their AI. As of the time of publication, through another in-app campaign that Eufy calls the Video Donation Program to improve its AI systems, Eufy also offers users rewards that range from an “Apprentice Medal,” which appears to simply be a badge next to the user’s name in the app, to gifts such as cameras or gift cards. Eufy is only asking for videos involving humans for this campaign. The Eufy app also shows an “Honor Wall” that ranks users who have donated the most video events. The leader of the ranking has donated 201,531 videos, according to the app. In the app’s page for the donation program, Eufy clarifies that “donated ..."
    },
    {
      "title": "Navigating IPOs In 2025: Managing Timing, Risk And Opportunity",
      "description": "Current market conditions have challenged the reliability of IPOs, forcing many companies to reevaluate their paths to public markets, writes guest author Carl Niedbala of Founder Shield. In this commentary he explains why companies are facing these challenges and how they can adapt and explore alternative strategies.",
      "url": "https://news.crunchbase.com/public/ipo/navigating-exits-2025-timing-risk-opportunity-niedbala-founder/",
      "source": "news.crunchbase.com",
      "category": "Corporate Advisory",
      "published_date": "Thu, 02 Oct 2025 11:00:58 +0000",
      "author": "Guest Author",
      "content": "In 2024, slightly less than half of planned IPOs were postponed , highlighting significant disruptions in the startup ecosystem due to market volatility and economic uncertainty. Traditionally, IPOs have been pivotal exit strategies for venture-backed companies, enabling them to access liquidity and fuel growth. However, current market conditions have challenged their reliability, forcing many companies to reevaluate their paths to public markets. That’s why I’d like to delve into why companies are facing these challenges, but also how to adapt and explore alternative strategies. Delayed IPOs significantly impact businesses, investors and employees. Market volatility, economic downturns and geopolitical tensions all create uncertainty, prompting companies to reconsider IPO timing and compressing the IPO window. Valuation challenges also deter IPO launches, as market corrections and heightened investor caution lead to diminished startup valuations. Regulatory scrutiny, with its evolving standards and stringent reporting requirements, adds another layer of complexity. Lastly, investor sentiment, whether bullish or pessimistic, directly influences IPO activity. Stakeholders across the spectrum feel the pinch of delayed IPOs. Late-stage startups face funding shortfalls, while venture capital firms encounter extended timelines for their exits, complicating future fundraising. Employees face consequences as well, as delayed IPOs affect stock option values, which are often central to their compensation packages. Delayed IPOs create a cascade of interconnected risks for startups. One of the primary concerns is valuation risk, where companies unable to meet their target IPO valuations may be forced into accepting down rounds. A down round means new financing occurs at a lower valuation than previous funding rounds, which can severely damage investor confidence. This problem is compounded by a lack of liquidity; with IPOs delayed, investors face prolonged illiquidity, limiting their ability to capitalize on investment gains. This reduced liquidity strains investor patience and can pressure venture capitalists to seek alternative exit strategies, sometimes leading to hastened decisions. Unfortunately, illiquidity also leads to significant financial risks. Startups reliant on IPO proceeds often face funding shortfalls and increasingly turn to debt financing. While this approach can temporarily ease cash flow pressures, it heightens financial vulnerability by increasing leverage and interest obligations, which may limit a company’s financial flexibility in the long term. Moreover, these conditions can expose weaknesses in startups with unsustainable business models. Companies heavily dependent on continuous external funding may find their operational weaknesses starkly exposed when the IPO route is closed, risking insolvency or forced mergers and acquisitions at unfavorable terms without rapid adjustments. In this challenging environment, despite several comp..."
    },
    {
      "title": "From Web 2.0 To AI: How True Ventures Is Backing The Next Big Shift",
      "description": "As AI reshapes industries, True Ventures sees echoes of the Web 2.0 era that launched the firm two decades ago. With $4 billion under management and more than 80 AI investments, True is focusing on the application layer — where it expects the next decade’s most valuable companies to emerge.",
      "url": "https://news.crunchbase.com/ai/true-ventures-ai-investments-jon-callaghan-puneet-agarwal/",
      "source": "news.crunchbase.com",
      "category": "Corporate Advisory",
      "published_date": "Thu, 02 Oct 2025 11:00:54 +0000",
      "author": "Gené Teare",
      "content": "Editor’s note: This article is part of an ongoing series in which Crunchbase News interviews active investors in artificial intelligence. Read previous interviews with Foundation Capital , GV (formerly Google Ventures), Felicis , Battery Ventures , Bain Capital Ventures , Menlo Ventures , Scale Venture Partners , Costanoa , Citi Ventures , Sierra Ventures and Andrew Ng of AI Fund , as well as highlights from more interviews done in 2023 . Twenty years ago, as the Web 2.0 wave took off and spurred a new era of tech innovation and wealth, True Ventures launched. In the mid-2000s, co-founders Jon Callaghan and Phil Black saw an opportunity to create an institutional seed fund to invest in a new class of products that could build off of APIs and mashups — launching new companies more cheaply and efficiently. Now the Palo Alto, California-based firm is once again investing heavily in emerging technology that it sees as transformational, this time backing artificial intelligence startups. “This is yet again one of these magical times for entrepreneurship,” Callaghan said. “Entrepreneurs can very efficiently — from a capital and human standpoint — build valuable applications on top of that.” We recently spoke with Callaghan , who serves as the firm’s managing partner, and True Ventures partner Puneet Agarwal at the firm’s Palo Alto offices about how they are investing in AI startups. The firm views AI as a fundamental layer that will transform all sectors in its investment practice, from enterprise tech to consumer and “other” areas, which includes biology and robotics. It has already made more than 80 AI-native investments since 2015. Callaghan and Black met in early 1990s while they were both in their 20s and associates at Boston-based Summit Partners . Both then joined early-stage venture firms in the mid-1990s, the beginnings of the Internet wave. They reunited after the dot-com crash, when numerous headlines declared the death of venture capital and wrote off San Francisco. By 2005, they had a shared vision and purpose to create an institutional seed fund. Their first fund was $165 million, the largest seed fund at the time. Agarwal’s journey in venture has been punctuated by critical downturns in the industry. He joined Mayfield 1 in 1999, just before the dotcom crash. He then left the venture side for a time to become an operator, and later joined True Ventures as an entrepreneur-in-residence at the time of the financial crisis in 2008. He became a partner in 2010. Some $2 trillion to $3 trillion has already gone to AI-based capital expenditures, Callaghan estimates. We could see that much and more again over the next five years: Jensen Huang , founder and CEO of Nvidia , estimated $3 trillion to $4 trillion in additional infrastructure spending by 2030. Callaghan believes the AI industry is now at “the application building phase.” The application layer, historically, has created 5x to 10x the value in market cap terms on top of that capex, he sa..."
    },
    {
      "title": "Flood Insurer Neptune Insurance Buoyed Higher In First-Day Trading",
      "description": "Shares of Neptune Insurance Holdings were up in early first-day trading Wednesday, as the market tides delivered a moderate rise for the flood insurance policy provider.",
      "url": "https://news.crunchbase.com/public/ipo/neptune-insurance-ipo-nyse-np/",
      "source": "news.crunchbase.com",
      "category": "Corporate Advisory",
      "published_date": "Wed, 01 Oct 2025 16:41:41 +0000",
      "author": "Joanna Glasner",
      "content": "Shares of Neptune Insurance Holdings closed up 24% in first-day trading Wednesday, as the market tides delivered a rise for the flood insurance policy provider. The St. Petersburg, Florida-based company priced shares at $20 a piece Tuesday afternoon, the top of the projected range. The offering raised $368 million for Neptune and set an initial valuation around $2.76 billion. The company trades on the New York Stock Exchange under the ticker “NP.” Founded in 2018, Neptune bills itself as an AI-enabled platform for insurers to offer flood coverage to residential and commercial customers. The company underwrites policies but does not handle claims or take balance sheet insurance risk, opting instead to work with other insurance providers. So far, it’s working out profitably, with business growing as well. In the first half of this year, Neptune reported revenue of $71.4 million — up 34% year over year. The company posted net income of $21.6 million, more than doubling from the same period last year. Neptune cites climate change as a driver of future growth in its platform, noting that “areas with low perceived flood risk today (e.g., non-coastal regions) could face increased frequency and intensity of flooding due to additional rainfalls and storms.” Additionally, it foresees the possibility of more areas with severe inland flooding being designated as mandatory flood insurance zones for policyholders with federally-backed mortgages. Today, per Neptune, the largest U.S. provider of flood insurance and the holder of the majority market share is the National Flood Insurance Program, a government-run entity that it cites as its main competitor. Per Neptune, however, “its limited product offerings often fail to meet policyholder needs.” Neptune’s growth to date has been funded in part through private investors.The company lists Bregal Sagemount and FTV Capital as its largest holders of Class A shares, with 28.9% and 25.4% stakes, respectively. Stay up to date with recent funding rounds, acquisitions, and more with the Crunchbase Daily. The old SaaS playbook of build a great app, charge monthly and let infrastructure fade into the background, doesn’t hold up when your core cost... Discover and act on private market opportunities with predictive company intelligence."
    },
    {
      "title": "The Billion-Dollar Security Threat: All Industries On Guard",
      "description": "Prolific hacking group Scattered Spider is able to successfully use compromised employee credentials in their attacks. Jason Martin, co-founder and co-CEO of Permiso Security, shares how businesses can work to protect themselves.",
      "url": "https://news.crunchbase.com/cybersecurity/billion-dollar-threat-martin-permiso/",
      "source": "news.crunchbase.com",
      "category": "Corporate Advisory",
      "published_date": "Wed, 01 Oct 2025 11:00:59 +0000",
      "author": "Guest Author",
      "content": "The costs are piling up from a three-year running cybersecurity threat that shows no signs of abating as it spreads to more industries. The likely culprit: a hacking collective known as “Scattered Spider.” The playbook: get into a company’s internal systems via hacked employee credentials, cause havoc, demand ransom. Just recently, Jaguar Land Rover was targeted in an attack by the group. The company hasn’t been able to make cars for a month as a result. Before that, Qantas reported that annual executive bonuses would be cut by 15% after Scattered Spider targeted them in a July cyber attack. Clorox sued its help desk provider, Cognizant Technology Solutions , for $380 million in damages, alleging that Cognizant improperly reset passwords for Scattered Spider hackers posing as employees. A few weeks earlier, Whole Foods supplier United Natural Foods estimated it lost up to $400 million in sales when hackers disrupted systems. Three years ago, casinos were hit. This is real money, and a real threat that most companies are not well prepared to guard against. Today, hackers don’t just bust into corporate systems, they log in — like thieves walking in through open household doors. Almost nine of 10 (88%) of breaches via basic web applications involve use of stolen credentials, indicates Verizon ’s 2025 Data Breach Investigations Report . In the case of Scattered Spider, culprits do such things as ask for password resets, change phone numbers tied to multifactor authentication solutions, or add phone numbers to reset passwords, and more. The rise of AI and AI agents make securing identities even more critical. As AI agents spread, they’re a new class of “non-human identities” that vastly increase the attack surface. As with most cybersecurity threats, Scattered Spider changes tactics all the time and we are seeing indications of AI use supporting and augmenting their social engineering tactics. When modeling approaches to increase resilience against their attacks it’s best to think of the worst case, which is: “assume breach.” Then evaluate how quickly you could detect attacks matching their approach and what your teams would do. While keeping them out is an admirable goal, it is very difficult since they exploit the processes you’ve set up to support your own enterprise users or contractors. The most realistic goal is to set up speed bumps to slow hackers down so they’re stopped before doing much damage. Steps to bolster defenses include: Teamwork. Most companies have “security teams.” A lot of companies now have “identity teams.” Identity refers to employees — or AI agents — with access to company assets via passwords and other credentials. Given the rise of identity-based cybersecurity threats, it’s imperative that these teams fuse or work more closely together to find shared solutions. Company assets are now also highly fragmented, with some in the cloud, some on-premise and some via software-as-a-service providers like Slack . There’s also shadow ..."
    },
    {
      "title": "Here Are Some Of The Newer Investors Entering The AI And Megaround Race",
      "description": "Using Crunchbase data, we put together a sample list of 15 recently launched venture investors that are leading good-sized rounds, most of which have a unicorn or two in their portfolios.",
      "url": "https://news.crunchbase.com/venture/new-vc-investors-ai-unicorns-maverick-silicon-interlagos-capital/",
      "source": "news.crunchbase.com",
      "category": "Corporate Advisory",
      "published_date": "Wed, 01 Oct 2025 11:00:37 +0000",
      "author": "Joanna Glasner",
      "content": "Lead investors in large venture rounds are usually familiar names in the startup world. But lately, we’ve seen newcomers writing some big checks as well. In sectors from spacetech to fusion to enterprise AI, several of the larger venture financings of the past few months have featured lead investors who only recently began investing in the space. So who are the newcomers scaling up? Using Crunchbase data, we put together a sample list of 15 recently launched venture investors that are leading good-sized rounds, most of which have a unicorn or two in their portfolios. Some were founded this year, while others have been at it a couple of years. Out of the sample, we picked out six that particularly warranted some closer inspection, based on factors like founding team, investment pace, round size, and willingness to lead deals. Unsurprisingly in the current funding environment, it’s an AI-centric list. Below, in no particular order, are some of the firms that might warrant an especially close watch: Founded in 2024, Maverick Silicon focuses on private semiconductor growth companies and related investments. It’s been an active investor in that short timespan, with 11 known investments , including four lead rounds. Its largest co-lead round was also one of its most recent: a $100 million September seed financing for Palo Alto, California-based Upscale AI , a high‑performance AI networking company. In August, Maverick also financed a $20 million equity investment for Celera Semiconductor , a Silicon Valley startup working on analog design automation. Maverick Silicon, with offices in Northern California and New York, is a division of Maverick Capital , a $10 billion asset manager It lists Andrew Homan , who led tech investment for Maverick Capital, as its founder and managing director, alongside nine other listed team members. Los Angeles-based Interlagos Capital , founded last year by SpaceX alums Achal Upadhyaya and Tom Ochinero , has also been scaling up. The firm has at least five known investments to date, including a high-profile role last month as lead investor in space tech unicorn Apex ’s $200 million Series D. Earlier this year, Interlagos also co-led Series A deals for two other startups: a $20 million round for seafood-focused robotics company Shinkei Systems and a $50 million financing for space solar startup Aetherflux . Upadhyaya, former SpaceX engineer and investor at venture firm Cantos , is listed as CEO at Interlagos while Ochinero, formerly SpaceX’s senior vice president of commercial business, is chairman. Marathon Management Partners launched in 2025 under the leadership of co-founders Gokul Rajaram , a prolific angel investor with board seats at multiple prominent companies, and Michael Gilroy , a former general partner at Coatue . So far this year, Marathon has led or co-led four financings, including a $31 million Series A this summer for AI payroll and benefits platform Niura and $15.5 million Series A for AI-enabled freight b..."
    },
    {
      "title": "The AI Value Chain Has Shifted. Here’s How Founders Can Still Build A Sustainable Business",
      "description": "The old SaaS playbook of build a great app, charge monthly and let infrastructure fade into the background, doesn’t hold up when your core cost scales with usage, writes guest author Itay Sagie, who shares three moves AI founders can make to stay in the game.",
      "url": "https://news.crunchbase.com/startups/founders-building-ai-value-chain-sagie/",
      "source": "news.crunchbase.com",
      "category": "Corporate Advisory",
      "published_date": "Tue, 30 Sep 2025 11:00:49 +0000",
      "author": "Judy Rider",
      "content": "Daniel, founder of a new AI startup, recently scaled his AI-powered SaaS app to $250,000 in annual revenue. It happened fast, and he was thrilled. The product was taking off, users were growing, and everything looked like it was working. Then came the shocker: a cloud invoice for $800,000, driven almost entirely by inference and compute tied to API usage. The company had grown the top line, but not the margin. It was scaling itself out of business. This kind of story is becoming more common as we move into the AI era. The old SaaS playbook of build a great app, charge monthly and let infrastructure fade into the background, doesn’t hold up when your core cost scales with usage. AI has reshuffled the value chain, and for startups, this shift is existential. In traditional SaaS, most of the value was captured at the application layer. Today, AI companies operate in a much deeper stack: But unlike the past, margins no longer concentrate at the top, close to the end user. They now often sit below the surface, especially in layers where scarcity exists such as hardware, compute and exclusive model access. So what can startups do when they don’t own the infrastructure or the models? You don’t need to train your own foundation model, but you do need to own the inputs that make your product valuable. If you’re in a vertical such as healthcare, finance, real estate or legal, your advantage is proprietary, structured data. Fine-tune open models. Build lightweight adapters. Use your customer workflows to continuously collect differentiated data. The value is in the dataset. That founder’s $800,000 cloud bill happened because they were charging like a SaaS company but operating like a compute company. In AI, usage drives cost. That means flat-rate subscriptions don’t work. Founders must embrace pricing models that align value delivered with cost incurred: Track gross margin by feature, not just customer. Tying your roadmap to one model provider like OpenAI or Anthropic is risky. Latency, pricing and policy changes can all blindside you. Instead, build with model abstraction in mind. Route across providers, fine-tune open-source backups, and negotiate contracts with leverage. Flexibility is not just technical. It is a business hedge. Itay Sagie is a strategic adviser to tech companies and investors, specializing in strategy, growth and M&A, a guest contributor to Crunchbase News, and a seasoned lecturer. Learn more about his advisory services, lectures and courses at SagieCapital.com . Connect with him on LinkedIn for further insights and discussions. Stay up to date with recent funding rounds, acquisitions, and more with the Crunchbase Daily. Current market conditions have challenged the reliability of IPOs, forcing many companies to reevaluate their paths to public markets, writes guest... As AI reshapes industries, True Ventures sees echoes of the Web 2.0 era that launched the firm two decades ago. With $4 billion under management and... Shares of Neptune ..."
    },
    {
      "title": "Are H-1B Changes ‘A Strategic Opening’ For Startup Creation Or An ‘Insurmountable Founder Tax’?",
      "description": "Will the new $100,000 fee for H-1B applications help or hurt the U.S. startup ecosystem? Investors and an immigration attorney who spoke with Crunchbase News were divided over the impact of the changes.",
      "url": "https://news.crunchbase.com/business/h-1b-changes-startup-founder-impact-cost-o1-visa-entrepreneur-alternatives/",
      "source": "news.crunchbase.com",
      "category": "Corporate Advisory",
      "published_date": "Mon, 29 Sep 2025 19:05:19 +0000",
      "author": "Marlize van Romburgh",
      "content": "Earlier this month, President Donald Trump sent shockwaves through Silicon Valley with his announcement that the U.S. would introduce a new $100,000 one-time fee for each new petition for an H1-B visa, the program that brings tens of thousands of skilled professionals from abroad to work for American software, tech and biotech companies each year. While many agree that the H1-B visa program, which has been crucial to the staffing strategies for many U.S. tech giants for decades, is deeply flawed, investors and an immigration attorney who spoke with Crunchbase News were divided over the impact of the changes and what they will mean for the creation of new American startups. Sophie Alcorn , founder and CEO of Palo Alto, California-based Alcorn Immigration Law , sees the changes as an “immediate crisis” for the startup and venture economy and said the policy is, in effect, an “insurmountable founder tax.” “We’re talking about stopping the next Eric Yuan of Zoom or Jensen Huang of Nvidia before they can even start,” she said. “The administration’s stated goal is to attract the best, yet this policy does the opposite.” That view was echoed by Eugene Malobrodsky , managing partner at One Way Ventures , who said the new fee essentially pits companies against the tech giants in a salary war that’s impossible for small startups to win. “For somebody like OpenAI , Anthropic , Google or Microsoft – $100,000 is what they might spend on soap in their office,” he said in an interview. While he, like many others, believes the H-1B program should be updated, “this is not the way to reform it,” said Malobrodsky, whose firm invests in seed-stage startups founded by immigrants. Still, Manan Mehta , founding partner of Unshackled Ventures , another VC firm that exclusively backs immigrant founders coming to the U.S., views the new policy as an “opportunity to modernize a 35-year-old system for today’s economy.” The new rules could shift focus towards alternative pathways like the O-1 visa and International Entrepreneur Rule, which he believes favor startups focused on innovation. “Rather than deterring startups, I believe this creates a strategic opening for them,” he told Crunchbase News. While the Trump administration’s new fee doesn’t apply for H-1B visa renewals and there may be “national interest” exemptions in some cases, the proposed changes nonetheless mark a major shift for the program. As part of his new tech immigration policy, Trump also announced an executive order to create a “Gold Card” pathway through which foreign nationals who make unrestricted gifts of $1 million (by an individual) or $2 million (a corporation) to the U.S. Department of Commerce would qualify for expedited immigrant visa processing. The H-1B program has faced criticism for years from some U.S. tech workers and critics of expanded immigration, who say it favors lower-paid foreign workers at the expense of qualified Americans. But supporters of the program say it brings highly-talen..."
    },
    {
      "title": "Exclusive: Trucker’s Son Bucks Logistics Funding Decline With $40M Raise For Startup Alvys",
      "description": "Alvys, an AI-powered logistics software provider, has raised $40 million in an RTP Global-led Series B funding, the company tells Crunchbase News exclusively.",
      "url": "https://news.crunchbase.com/transportation/logistics-software-startup-seriesb-alvys/",
      "source": "news.crunchbase.com",
      "category": "Corporate Advisory",
      "published_date": "Mon, 29 Sep 2025 11:00:18 +0000",
      "author": "Judy Rider",
      "content": "Alvys , an AI-powered logistics software provider, has raised $40 million in Series B funding, the company tells Crunchbase News exclusively. RTP Global led the financing, which brings Alvys’ total funding to date to $77 million, according to the company. Alpha Square Group joined existing backers Picus Capita , Titanium Ventures and Bonfire Ventures , among others, in participating in the round. The company declined to reveal its valuation, saying only that it was an up round. It most recently raised funding in July 2024, a $25.8 million Series A led by Titanium. The raise comes at a time when funding to logistics and supply chain management startups remains far below pandemic highs. As of Sept. 25, startups in the space have raised $5.7 billion across 469 deals in 2025, Crunchbase data shows. By comparison, in all of 2024, logistics and supply chain management startups raised less than $6 billion in 741 announced funding deals. Both years’ numbers are a steep drop from the nearly $28 billion such startups raised in 2021 in a record-high 1,554 deals. Although 2021 was an aberration, funding numbers so far in 2025 are lower even than those of 2023, when $6.7 billion was raised across 965 deals. Founded in 2020, Alvys hopes to buck the trend. The company describes itself as a “transportation management system” aimed at helping trucking companies operate more efficiently. Its platform does things like streamline dispatch, load management, tracking, driver management, billing and payroll. And by using AI and automation, Alvys claims it can help reduce manual work and help businesses make quicker decisions and thus move faster in general. Nick Darman , the company’s founder and CEO, told Crunchbase News that historically, many freight companies run on separate sets of systems, which results in siloed data, duplicated work, slow workflows and limited visibility. The company’s software “allows freight companies to transform multiple complex operations into one business that runs with clarity, while still keeping accounting clean and separate for each entity,” he said. The end result for the company’s 1,000-plus customers, Darman claims, is increased revenue, monthly loads and efficiency gains from faster accounting and reduced data entry. For its part, Alvys has tripled its revenue in each of the past two years and is on track to double it again in 2025, according to Darman. Darman’s journey to start Alvys began with his personal experience seeing his father’s struggle — including financially — as a truck driver. After conducting research about freight sourcing, Darman founded a trucking company to supply his dad with loads. He also got a degree in economics and worked a brief stint in finance at JPMorgan . But in 2014, Darman decided to start an asset-based brokerage. By 2020, he had determined that he wanted to start a company to help address the inefficiencies plaguing the operating systems for freight companies. Thus, Alvys was born. In 2021, he in..."
    },
    {
      "title": "Yahoo News: Latest and Breaking News, Headlines, Live Updates, and More",
      "description": "The latest news and headlines from Yahoo News. Get breaking news stories and in-depth coverage with videos and photos.",
      "url": "https://www.yahoo.com/news/",
      "source": "finance.yahoo.com",
      "category": "Corporate Advisory",
      "published_date": null,
      "author": "",
      "content": "As a bitter standoff between Republicans and Democrats plays out, there is little sign that either side is willing to budge. NEW YORK (Reuters) -UnitedHealth said it will stop offering Medicare Advantage plans in 16 U.S. counties in 2026, impacting 180,000 members, as the company balances higher costs with reimbursement pressure in the insurance program. \"The combination of (Centers for Medicare and Medicaid Services) funding cuts, rising healthcare costs and increased utilization have created headwinds that no organization can ignore,\" said Bobby Hunter, who runs the company's government programs. UnitedHealth is l Chicago P.D.’s Jason Beghe is willing to do whatever it takes to help Voight and Chapman come back together in Season 13. In Wednesday’s premiere, we pick up one month after Voight helped orchestrate Chief Charlie Reid’s murder, and Chapman still isn’t speaking to him. (In fact, Chapman is completely absent from the episode.) TVLine … A South Carolina man drove a Kia Telluride up Black Bear Road on Wednesday and got stuck, leading to a closure of the pass. A wealthy enclave in Southern California that has been threatened for years by worsening landslides faced more land movement this week but suffered minimal damage. Four backyards in Rancho Palos Verdes were damaged Saturday evening by significant soil movement from the sinking land, but there was no structural damage to homes and no injuries were reported, according to a news update on the city's website. About 300 to 400 linear feet (91 to 122 meters) of a coastal slope sloughed off, falling The company once boasted 40 stores nationwide. Now, that number has dwindled to just 16. Pope Leo XIV has intervened for the first time in an abortion dispute roiling the U.S. Catholic Church by raising the seeming contradiction over what it really means to be “pro-life.” Leo, a Chicago native, was asked late Tuesday about plans by Chicago Cardinal Blase Cupich to give a lifetime achievement award to Illinois Senator Dick Durbin for his work helping immigrants. The plans drew objection from some conservative U.S. bishops given the powerful Democratic senator’s support for abortion"
    },
    {
      "title": "US | Yahoo News - Latest News & Headlines",
      "description": "The latest news and headlines from Yahoo News. Get breaking news stories and in-depth coverage with videos and photos.",
      "url": "https://www.yahoo.com/news/us/",
      "source": "finance.yahoo.com",
      "category": "Corporate Advisory",
      "published_date": null,
      "author": "",
      "content": ""
    },
    {
      "title": "Latest Political News, Updates, and Analysis - Yahoo News",
      "description": "The latest political news and headlines from Yahoo News, including national and state level updates, breaking stories and coverage",
      "url": "https://www.yahoo.com/news/politics/",
      "source": "finance.yahoo.com",
      "category": "Corporate Advisory",
      "published_date": null,
      "author": "",
      "content": ""
    },
    {
      "title": "World News - Latest and Breaking Coverage - Yahoo News",
      "description": "The latest world news and headlines from Yahoo News and international publishers, breaking stories, ongoing events, and coverage",
      "url": "https://www.yahoo.com/news/world/",
      "source": "finance.yahoo.com",
      "category": "Corporate Advisory",
      "published_date": null,
      "author": "",
      "content": ""
    },
    {
      "title": "Nordelta, Argentina - Weather Forecasts | Maps | News - Yahoo Weather",
      "description": "View the latest weather forecasts, maps, news and alerts on Yahoo Weather. Find local weather forecasts for Nordelta, Argentina throughout the world",
      "url": "https://www.yahoo.com/news/weather/",
      "source": "finance.yahoo.com",
      "category": "Corporate Advisory",
      "published_date": null,
      "author": "",
      "content": "Sunny with a high of 75 °F (23.9 °C). Winds variable at 10 to 11 mph (16.1 to 17.7 kph). Night - Clear. Winds variable at 6 to 9 mph (9.7 to 14.5 kph). The overnight low will be 57 °F (13.9 °C). Partly cloudy today with a high of 79 °F (26.1 °C) and a low of 57 °F (13.9 °C). Partly cloudy today with a high of 83 °F (28.3 °C) and a low of 63 °F (17.2 °C). Showers today with a high of 69 °F (20.6 °C) and a low of 46 °F (7.8 °C). There is a 62% chance of precipitation. Sunny today with a high of 65 °F (18.3 °C) and a low of 43 °F (6.1 °C). Sunny today with a high of 73 °F (22.8 °C) and a low of 47 °F (8.3 °C). Sunny today with a high of 73 °F (22.8 °C) and a low of 53 °F (11.7 °C). Sunny today with a high of 74 °F (23.3 °C) and a low of 55 °F (12.8 °C). Sunny today with a high of 76 °F (24.4 °C) and a low of 56 °F (13.3 °C). Sunny today with a high of 80 °F (26.7 °C) and a low of 59 °F (15 °C). Cloudy today with a high of 75 °F (23.9 °C) and a low of 55 °F (12.8 °C). Today - Sunny with a high of 75 °F (23.9 °C). Winds variable at 10 to 11 mph (16.1 to 17.7 kph). Tonight - Clear. Winds variable at 6 to 9 mph (9.7 to 14.5 kph). The overnight low will be 57 °F (13.9 °C)."
    },
    {
      "title": "Yahoo News: Latest and Breaking News, Headlines, Live Updates, and More",
      "description": "The latest news and headlines from Yahoo News. Get breaking news stories and in-depth coverage with videos and photos.",
      "url": "https://www.yahoo.com/news/health/",
      "source": "finance.yahoo.com",
      "category": "Corporate Advisory",
      "published_date": null,
      "author": "",
      "content": "New data shows widespread erosion in vaccination coverage in over 75% of U.S. counties, leaving many without immunity from outbreaks. (Reuters) -Novo Nordisk's and Eli Lilly's blockbuster weight-loss drugs should be the first medicines doctors reach for to treat obesity and its complications, a major European medical association advised on Thursday. Semaglutide, the active ingredient in Novo’s Wegovy and Ozempic, and tirzepatide, sold as Zepbound and Mounjaro by Lilly, are so effective that they should be the first choice in almost all cases when substantial weight loss is necessary, according to a new guideline from the Euro The youngest patient to arrive at Henry Ford Health Genesys Hospital after a shooting and fire at a Michigan church on Sunday morning was just 6 years old. Pepsi has a new challenge: keeping products like Gatorade and Cheetos vivid and colorful without the artificial dyes that U.S. consumers are increasingly rejecting. PepsiCo, which also makes Doritos, Cap'n Crunch cereal, Funyuns and Mountain Dew, announced in April that it would accelerate a planned shift to using natural colors in its foods and beverages. Around 40% of its U.S. products now contain synthetic dyes, according to the company. Doctors at Henry Ford Genesys Hospital in a news conference detailed the aftermath of the Grand Blanc Township shooting as they raced to help wounded. It’s time to get a flu vaccine, and pediatricians are urging people to get them after last winter, when the U.S. saw the most flu-related child deaths in 15 years. October is the ideal month to get protected, experts say, because flu cases typically begin climbing in November. Here’s what to know. Who needs a yearly flu vaccination? MEXICO CITY (Reuters) -Mexico saw a nearly 32% increase in confirmed cases of the flesh-eating screwworm parasite, according to the latest monthly government data, as a concentration of cases moves north. Mexico recorded 6,703 cases of animals infested with New World screwworm as of September 13 since the start of the outbreak in November of last year. The latest report by sanitation agency Senasica, which was published on September 26 and seen by Reuters on Wednesday, shows the outbreak is be"
    },
    {
      "title": "Latest Science News and Updates on Space, Climate Change and More - Yahoo News",
      "description": "The latest science news and headlines from Yahoo News, focusing on space, climate change and health-related breaking stories and coverage",
      "url": "https://www.yahoo.com/news/science/",
      "source": "finance.yahoo.com",
      "category": "Corporate Advisory",
      "published_date": null,
      "author": "",
      "content": ""
    },
    {
      "title": "Latest Trending and Live Original Coverage from Yahoo News",
      "description": "Yahoo News' award-winning original coverage of politics, science, weather, and health, plus explainers and FAQs on the current events.",
      "url": "https://news.yahoo.com/originals/",
      "source": "finance.yahoo.com",
      "category": "Corporate Advisory",
      "published_date": null,
      "author": "",
      "content": "From Jon Hamm to Tom Everett Scott, the \"Chad Powers\" costars draft the Hollywood friends they’d want calling plays from the sidelines. The \"Don't Let's Go to the Dogs Tonight\" director is enjoying the chance to evolve into \"a fully realized, conscious, flawed, best version\" of herself. Taylor Swift could be headed to the \"Saturday Night Live\" stage, if these theories are correct. Kidman listed their date of separation as the date of filing, Sept. 30, and cited irreconcilable differences as the reason for their breakup. The full moon in October will dazzle the night sky early next week. Jacob Elordi plays the monster in the upcoming 'Frankenstein' movie. Goodall, who was the world's leading researcher on chimpanzees, revolutionized science."
    }
  ]
}