{
  "category": "Corporate Advisory",
  "scraped_at": "2025-10-07T11:54:21.144145",
  "total_articles": 36,
  "articles": [
    {
      "title": "State Street’s flagship S&P 500 ETF suffers record $32bn outflows",
      "description": "Investors flee SPY despite this year’s rally on Wall Street in search of cheaper alternatives",
      "url": "https://www.ft.com/content/75b022e4-486b-4eaa-8b8b-4911b335cf6b",
      "source": "ft.com",
      "category": "Corporate Advisory",
      "published_date": "Tue, 07 Oct 2025 14:17:04 GMT",
      "author": null,
      "content": "Save now on essential digital access to quality FT journalism on any device. Saving based on monthly annualised price. Then $75 per month. Complete digital access to quality FT journalism on any device. Cancel or change your plan anytime during your trial. Complete digital access to quality FT journalism with expert analysis from industry leaders. Pay a year upfront and save 20%. FT Digital Edition: today’s FT, cover to cover on any device. This subscription does not include access to ft.com or the FT App. Check whether you already have access via your university or organisation. Discover all the plans currently available in your country Digital access for organisations. Includes exclusive features and content. See why over a million readers pay to read the Financial Times."
    },
    {
      "title": "NYSE parent to invest up to $2bn in prediction platform Polymarket",
      "description": "Intercontinental Exchange will distribute ‘event-driven data’ of site, which became popular during 2024 US election",
      "url": "https://www.ft.com/content/9437b5b5-59c0-44a3-8b25-58b3b4aa1b0c",
      "source": "ft.com",
      "category": "Corporate Advisory",
      "published_date": "Tue, 07 Oct 2025 12:28:01 GMT",
      "author": null,
      "content": "Save now on essential digital access to quality FT journalism with the FT Digital Edition: today’s FT, cover to cover on any device. Then $75 per month. Complete digital access to quality FT journalism on any device. Cancel or change your plan anytime during your trial. Save now on essential digital access to quality FT journalism on any device. Saving based on monthly annualised price. Complete digital access to quality FT journalism with expert analysis from industry leaders. Pay a year upfront and save 20%. Check whether you already have access via your university or organisation. Discover all the plans currently available in your country Digital access for organisations. Includes exclusive features and content. See why over a million readers pay to read the Financial Times."
    },
    {
      "title": "Ex-KPMG auditor fined for third time in four years for ‘serious breaches’",
      "description": "Firm was also fined almost £711,000 for its audit of clothing retailer N Brown",
      "url": "https://www.ft.com/content/a422772d-4c5f-4a38-b2b4-8f1be88a059e",
      "source": "ft.com",
      "category": "Corporate Advisory",
      "published_date": "Tue, 07 Oct 2025 10:36:26 GMT",
      "author": null,
      "content": "Save now on essential digital access to quality FT journalism with the FT Digital Edition: today’s FT, cover to cover on any device. Then $75 per month. Complete digital access to quality FT journalism on any device. Cancel or change your plan anytime during your trial. Save now on essential digital access to quality FT journalism on any device. Saving based on monthly annualised price. Complete digital access to quality FT journalism with expert analysis from industry leaders. Pay a year upfront and save 20%. Check whether you already have access via your university or organisation. Discover all the plans currently available in your country Digital access for organisations. Includes exclusive features and content. See why over a million readers pay to read the Financial Times."
    },
    {
      "title": "Energy companies to spend $50bn on new US pipelines",
      "description": "Record LNG exports and growing electricity demand from data centres have created supply bottlenecks",
      "url": "https://www.ft.com/content/fb244aa9-3756-4297-a95b-43eacf8ac2b6",
      "source": "ft.com",
      "category": "Corporate Advisory",
      "published_date": "Tue, 07 Oct 2025 10:00:05 GMT",
      "author": null,
      "content": "Save now on essential digital access to quality FT journalism on any device. Saving based on monthly annualised price. FT Digital Edition: today’s FT, cover to cover on any device. This subscription does not include access to ft.com or the FT App. Complete digital access to quality FT journalism with expert analysis from industry leaders. Pay a year upfront and save 20%. Check whether you already have access via your university or organisation. Discover all the plans currently available in your country Digital access for organisations. Includes exclusive features and content. See why over a million readers pay to read the Financial Times."
    },
    {
      "title": "Hurrah for US bank mergers",
      "description": "Plus Sanaenomics and Japan",
      "url": "https://www.ft.com/content/0f9cbb19-a5b2-43cd-94d5-11d7e640c308",
      "source": "ft.com",
      "category": "Corporate Advisory",
      "published_date": "Tue, 07 Oct 2025 05:30:05 GMT",
      "author": null,
      "content": "Save now on essential digital access to quality FT journalism with the FT Digital Edition: today’s FT, cover to cover on any device. Then $75 per month. Complete digital access to quality FT journalism on any device. Cancel or change your plan anytime during your trial. Save now on essential digital access to quality FT journalism on any device. Saving based on monthly annualised price. Complete digital access to quality FT journalism with expert analysis from industry leaders. Pay a year upfront and save 20%. Check whether you already have access via your university or organisation. Discover all the plans currently available in your country Digital access for organisations. Includes exclusive features and content. See why over a million readers pay to read the Financial Times."
    },
    {
      "title": "A wholesale change in regulatory philosophy is needed for UK markets",
      "description": "Policymakers may have inadvertently stifled opportunity through a focus on investor protection",
      "url": "https://www.ft.com/content/d28061af-eec4-4173-a79b-4f33ee27270e",
      "source": "ft.com",
      "category": "Corporate Advisory",
      "published_date": "Tue, 07 Oct 2025 04:00:28 GMT",
      "author": null,
      "content": "Save now on essential digital access to quality FT journalism with the FT Digital Edition: today’s FT, cover to cover on any device. Then $75 per month. Complete digital access to quality FT journalism on any device. Cancel or change your plan anytime during your trial. Save now on essential digital access to quality FT journalism on any device. Saving based on monthly annualised price. Complete digital access to quality FT journalism with expert analysis from industry leaders. Pay a year upfront and save 20%. Check whether you already have access via your university or organisation. Discover all the plans currently available in your country Digital access for organisations. Includes exclusive features and content. See why over a million readers pay to read the Financial Times."
    },
    {
      "title": "For London IPOs, slow and steady wins the race",
      "description": "Companies planning a listing must accept that patience is a virtue",
      "url": "https://www.ft.com/content/626889be-8322-4776-9575-32174c6bb6b5",
      "source": "ft.com",
      "category": "Corporate Advisory",
      "published_date": "Tue, 07 Oct 2025 04:00:28 GMT",
      "author": null,
      "content": "Save now on essential digital access to quality FT journalism on any device. Saving based on monthly annualised price. Then $75 per month. Complete digital access to quality FT journalism on any device. Cancel or change your plan anytime during your trial. Complete digital access to quality FT journalism with expert analysis from industry leaders. Pay a year upfront and save 20%. FT Digital Edition: today’s FT, cover to cover on any device. This subscription does not include access to ft.com or the FT App. Check whether you already have access via your university or organisation. Discover all the plans currently available in your country Digital access for organisations. Includes exclusive features and content. See why over a million readers pay to read the Financial Times."
    },
    {
      "title": "Emerging markets roar back with biggest stock rally in 15 years",
      "description": "‘Stars are finally aligning’ for EM assets, as weakening US dollar sends investors in search of yield",
      "url": "https://www.ft.com/content/fbf77fd7-5cfc-4ab9-9793-5cd514bd75ca",
      "source": "ft.com",
      "category": "Corporate Advisory",
      "published_date": "Tue, 07 Oct 2025 04:00:15 GMT",
      "author": null,
      "content": "Save now on essential digital access to quality FT journalism with the FT Digital Edition: today’s FT, cover to cover on any device. Then $75 per month. Complete digital access to quality FT journalism on any device. Cancel or change your plan anytime during your trial. Save now on essential digital access to quality FT journalism on any device. Saving based on monthly annualised price. Complete digital access to quality FT journalism with expert analysis from industry leaders. Pay a year upfront and save 20%. Check whether you already have access via your university or organisation. Discover all the plans currently available in your country Digital access for organisations. Includes exclusive features and content. See why over a million readers pay to read the Financial Times."
    },
    {
      "title": "Podcasts | Reuters World News | Reuters",
      "description": "Everything you need to know about your world in 10 minutes.",
      "url": "https://www.reuters.com/podcasts/reuters-world-news/",
      "source": "reuters.com",
      "category": "Corporate Advisory",
      "published_date": null,
      "author": "",
      "content": "Everything you need to know about your world in 10 minutes. Go straight to the source with a ten-minute news briefing by Reuters frontline journalists. Join host Kim Vinnell as she takes you around the world every weekday. Illinois has launched the fourth legal challenge over federal use of National Guard in U.S. cities."
    },
    {
      "title": "Argentina markets on tenterhooks ahead of news of US support",
      "description": "Argentina's peso weakened marginally on Monday while stocks edged up and bond prices rose in anticipation of news of financial aid from the U.S. Treasury and as political tensions in Argentina escalate before the country's midterm elections later this month.",
      "url": "https://www.reuters.com/business/finance/argentina-markets-tenterhooks-ahead-news-us-support-2025-10-06/",
      "source": "reuters.com",
      "category": "Corporate Advisory",
      "published_date": null,
      "author": "",
      "content": "Report by Walter Bianchi; Edited by Hernán Nessi, Maximilian Heath, Rodrigo Campos and Mark Porter Our Standards: The Thomson Reuters Trust Principles. , opens new tab"
    },
    {
      "title": "‎Reuters - Breaking World News",
      "description": "‎Welcome to the Reuters News App! Stay informed with the latest global news and personalize your experience with our comprehensive features, all designed with your feedback in mind. Whether you're in a subscription country or enjoying access through our free registration process, we’re committed to…",
      "url": "https://apps.apple.com/app/reuters-news/id602660809",
      "source": "reuters.com",
      "category": "Corporate Advisory",
      "published_date": null,
      "author": "",
      "content": "Welcome to the Reuters News App! Stay informed with the latest global news and personalize your experience with our comprehensive features, all designed with your feedback in mind. Whether you're in a subscription country or enjoying access through our free registration process, we’re committed to delivering fast, reliable news from around the globe. Modern Design • Enjoy a sleek, intuitive interface with enhanced readability, featuring “Today,” your new hub for news. Enhanced Article Experience • Immerse yourself in news stories with a visually engaging layout, interactive graphics, and related content. My News • Customize your Reuters experience with a personalized feed based on your interests. Save articles to read later and easily manage your preferences. Breaking Markets Updates • Keep track of the latest market trends with our detailed Markets section. Create a personalized Watchlist and follow companies for breaking news. Media Hub • Explore our rich library of videos, podcasts, and photo galleries, including our popular podcast, Reuters Econ World. Customizable Push Notifications • Stay updated with personalized breaking news alerts and opt-in to podcast notifications. Support Quality Journalism • Subscriptions help us invest in broader coverage, deeper investigations, more innovative products, and exclusive subscriber experiences. Users in other countries will continue to receive access through our free registration process. We Value Your Feedback! • Leave us a review or contact Reuters Customer Support. Thank you for being part of our journey. Happy reading! ACCESS: The Reuters app is free to download. In order to gain full access to the Reuters app, you will need to sign-in / register and complete the subscription process within the app. Subscriptions are not available in certain territories. For these territories, users will continue to receive access via our free registration process. SUBSCRIPTION AND AUTOMATIC RENEWALS: Your subscription plan renews automatically unless cancelled at least 24 hours before the end of the current period. Payment will be charged by Apple at confirmation of your subscription purchase. Your account will be charged (in advance) automatically for renewal at the applicable price and at the selected frequency (whether monthly, annually or another period) within 24 hours prior to the end of the current period. You can manage your subscription and disable auto-renewal by accessing your Apple Account Settings after purchase (at least 24 hours before the end of your current billing period). Cancellation takes effect at the end of your current billing period. TERMS & CONDITIONS: In addition to the applicable Apple subscription terms and conditions (including the auto-renewal terms above), by downloading the Reuters app, you agree to: - Reuters Terms and Conditions: https://www.reuters.com/info-pages/terms-of-use/. - Reuters Privacy Statement: https://www.thomsonreuters.com/en/privacy-statement.html. - Reuters Cook..."
    },
    {
      "title": "Sign up to Reuters newsletters and update newsletter preferences",
      "description": "Reuters newsletters provide a comprehensive summary and analysis of the most important news, compiled by the world's most trusted news organization, and delivered to your inbox.",
      "url": "https://www.reuters.com/newsletters/",
      "source": "reuters.com",
      "category": "Corporate Advisory",
      "published_date": null,
      "author": "",
      "content": "The day's top news in your inbox. We cover the world, from front lines to boardrooms. (This includes the Reuters Weekend Briefing.) Has it been a busy week? Sign up for our recap, sent on Saturdays, to catch up on the stories you may have missed. Your weekly focus on innovative ideas and the people working on solutions to global crises. Insights and ideas from Reuters' global financial commentary team. The latest on geopolitics, energy and finance in the Gulf. Your daily guide to the latest global trade and tariff news. Learn about the latest breakthroughs in AI and tech. Latest news and expert analysis on the state of U.S. politics and how it matters to the world. The latest news from India and how it matters to the world. Reuters editors highlight a standout story each day that goes behind the news and brings you the bigger picture. Get the latest news and expert analysis about the state of the global economy. Stay up to date on the key companies, data, and decisions in the world of ESG finance. Make sense of companies and governments grappling with climate change, diversity, and human rights. Everything you need to know about the global energy industry and the forces driving the transition to renewable fuels. Stay up to date with the latest news, trends and innovations that are driving the global automotive industry. Keep up with the latest medical breakthroughs, healthcare trends, pharmaceutical news and more. For U.S. readers, get personal finance tips and insights from editor Lauren Young. A look at the day ahead in U.S. and global markets from Mike Dolan. A look at the day ahead in European and global markets from Kevin Buckland and team. Make sense of global markets with Jamie McGeever. Make sense of the market with highlights of the latest news and trends in global financial markets. From startups to the FAANGs, get the latest news and trends in the global technology industry. A daily digest of breaking business news, major corporate news and the financial markets. A smart look at the day's most important headlines concerning the courts, law firms, and the practice of law. Delivered every weekday afternoon, The Afternoon Docket is a quick look at the day's breaking legal news and analysis. نشرة رويترز اليومية لأهم الأنباء تقدم لكم وكالة رويترز عبر نشرتها البريدية اليومية تغطية إخبارية موثوقة وشاملة لأهم المستجدات السياسية والاقتصادية والمالية في المنطقة العربية والعالم. تصلكم الأخبار العاجلة والتحليلات المعمّقة من فريق التحرير العربي مباشرة إلى بريدكم الإلكتروني بصيغة احترافية تواكب تطلعات القراء وصناع القرار."
    },
    {
      "title": "Security bug in India’s income tax portal exposed taxpayers’ sensitive data",
      "description": "TechCrunch verified that the security bug in the Indian Income Tax Department's e-Filing portal exposed taxpayers' data to other users. The security researchers who found the flaw say the data leak is now fixed.",
      "url": "https://techcrunch.com/2025/10/07/security-bug-in-indias-income-tax-portal-exposed-taxpayers-sensitive-data/",
      "source": "techcrunch.com",
      "category": "Corporate Advisory",
      "published_date": "Tue, 07 Oct 2025 14:30:02 +0000",
      "author": "Jagmeet Singh",
      "content": "The Indian government’s tax authority has fixed a security flaw in its income tax filing portal that was exposing sensitive taxpayers’ data, TechCrunch has exclusively learned and confirmed with authorities. The flaw, discovered in September by a pair of security researchers Akshay CS and “Viral,” allowed anyone who was logged into the income tax department’s e-Filing portal to access up-to-date personal and financial data of other people. The exposed data included full names, home addresses and email addresses, dates of birth, phone numbers, and bank account details of people who pay taxes on their income in India. The data also exposed citizens’ Aadhaar number, a unique government-issued identifier used as proof of identity and for accessing government services. TechCrunch verified the data to the best of its ability by granting permission to the researchers to look up this reporter’s records on the portal. The security researchers confirmed to TechCrunch on October 2 that the vulnerability was fixed. Given the risk to the public, TechCrunch withheld publishing this story until the security researchers confirmed that the vulnerability can no longer be exploited. Representatives for the Indian Income Tax Department acknowledged our email requesting comment, but did not answer our questions by press time. The Income Tax Department did not present any objections to our publishing this story. The security researchers Akshay CS and “Viral” told TechCrunch that they discovered the vulnerability while filing their recent income tax return on the government website. Residents of India are required to file their annual earnings to calculate the taxes they owe to the Indian government. The researchers found that when they signed into the portal using their Permanent Account Number (PAN), an official document issued by the Indian income tax department, they could view anyone else’s sensitive financial data by swapping out their PAN for another PAN in the network request as the web page loads. This could be done using publicly available tools like Postman or Burp Suite (or using the web browser’s in-built developer tools) and with knowledge of someone else’s PAN, the researchers told TechCrunch. The bug was exploitable by anyone who was logged-in to the tax portal because the Indian income tax department’s back-end servers were not properly checking who was allowed to access a person’s sensitive data. This class of vulnerability is known as an insecure direct object reference, or IDOR, a common and simple flaw that governments have warned is easy to exploit and can result in large-scale data breaches. “This is an extremely low hanging thing, but one that has a very severe consequence,” the researchers told TechCrunch. In addition to the data of individuals, the researchers said that the bug also exposed data associated with companies who were registered with the e-Filing portal. TechCrunch also verified that the bug exposed data on individuals who have yet..."
    },
    {
      "title": "OpenAI and the race for AI-driven commerce",
      "description": "OpenAI now has all the pieces in place for AI-driven commerce, establishing ChatGPT as a place customers go to buy and retailers go to sell.",
      "url": "https://techcrunch.com/2025/10/07/openai-and-the-race-for-ai-driven-commerce/",
      "source": "techcrunch.com",
      "category": "Corporate Advisory",
      "published_date": "Tue, 07 Oct 2025 14:24:25 +0000",
      "author": "Russell Brandom",
      "content": "OpenAI held its annual dev day on Monday , where the company rolled out its plan to build apps into ChatGPT . The demo was impressive, showing how programs like Spotify and Figma can be called or discovered without leaving the ChatGPT window. With so much of the tech world barreling towards AI integration, OpenAI’s demo was the best picture yet of what an AI-first internet might actually look like, with interfaces like ChatGPT querying information and executing commands directly. If you’re watching closely, you may have noticed that there’s a lot of room in this system for money to change hands. Just last week, the company launched Instant Checkout, an agentic shopping system that serves as payment infrastructure for one-off purchases, plugging in any stores that sell through Shopify, Etsy or Stripe. Now, apps provides the front-end infrastructure, letting service providers build their own interface into ChatGPT. In short, OpenAI now has all the pieces in place for AI-driven commerce, establishing ChatGPT as a place customers go to buy and retailers go to sell. It’s a huge new line of business for the company — and one with huge implications for the tech industry. In this world, OpenAI’s isn’t just competing with Google and Anthropic, but with Amazon and Wal-Mart. If you look at OpenAI’s pending app partners in the launch announcement , you can see how far the vision reaches. ChatGPT will be able to call you a cab through Uber, book a trip on Expedia, call a plumber or locksmith through Thumbtack, order groceries from Instacart, prepared food from Doordash, or big-box goods from Target. Without too much more work, ChatGPT could become a portal for most of its users’ discretionary spending. If it works, this would be worth a lot more than just a $20-a-month subscription. The precise terms of the arrangement are still unclear, but like any app store, OpenAI is well positioned to get a portion of any money spent on its platform. ChatGPT is also recommending products, drawing on its wealth of data about its users, which tips the balance of power between OpenAI and retailers even more. In Ben Thompson’s terms , ChatGPT becomes a super-aggregator, funneling customers to retailers and providing an entry point for ever-larger amounts of commerce. OpenAI has lots of potential lines of business to pursue, but it’s no exaggeration to say that AI-driven commerce is one of the most lucrative options. OpenAI isn’t the only company with an eye on this prospect. On the same day as the ChatGPT announcement, Adobe released a report predicting that this year’s holiday would be dominated by AI-assisted shopping, with shoppers turning to chatbots instead of search engines to find the best deals available. A separate report from Mastercard dubbed agentic commerce as a “new competitive arena” for finance. Google has already launched its own competing protocol for agentic commerce called AP2, which arrives with a broader scope but less momentum than OpenAI’s version. Th..."
    },
    {
      "title": "xAI hires former Morgan Stanley banker Anthony Armstrong as CFO",
      "description": "Armstrong, who advised Musk during his Twitter takeover, will oversee the finances of both xAI and X, which were merged in April, the report said.",
      "url": "https://techcrunch.com/2025/10/07/xai-hires-former-morgan-stanley-banker-anthony-armstrong-as-cfo/",
      "source": "techcrunch.com",
      "category": "Corporate Advisory",
      "published_date": "Tue, 07 Oct 2025 12:12:51 +0000",
      "author": "Ram Iyer",
      "content": "Elon Musk’s AI company, xAI, now has a new chief financial officer: Former Morgan Stanley banker Anthony Armstrong, the Financial Times reported , citing anonymous sources. Armstrong, who previously advised Musk during the Twitter deal, will oversee the finances of both xAI and X, which were merged in April, the report said. The former banker has been working with xAI for several weeks and was only recently appointed as CFO, the FT added. xAI has been without a CFO since its previous finance head, Mike Liberatore, left the company in July, and Armstrong’s appointment follows a slate of high-profile executive departures at both xAI and X. xAI’s general counsel, Robert Keele, left the company in August after a little more than a year on the job. Raghu Rao, a senior lawyer, also departed around the same time, and Igor Babuschkin, one of xAI’s co-founders, in August said he was leaving the company to launch his own VC firm dedicated to AI safety research. Linda Yaccarino, former CEO of X, also resigned in July. Armstrong will take over from X’s current CFO, Mahmoud Reza Banki, who is leaving the company, the FT reported. xAI did not immediately return a request for comment. Founders: Your next big connection and investor are here . Investors: Meet startups that align with your investment goals. Innovators & Visionaries: See the future of tech before everyone else. Register now and save up to $444 (or up to 30% on groups). Subscribe for the industry’s biggest tech news Every weekday and Sunday, you can get the best of TechCrunch’s coverage. TechCrunch Mobility is your destination for transportation news and insight. Startups are the core of TechCrunch, so get our best coverage delivered weekly. Provides movers and shakers with the info they need to start their day. By submitting your email, you agree to our Terms and Privacy Notice ."
    },
    {
      "title": "Deloitte goes all in on AI — despite having to issue a hefty refund for use of AI",
      "description": "Deloitte is rolling out Claude to its nearly 500,000 employees after issuing a refund for a report that contained AI hallucinations.",
      "url": "https://techcrunch.com/2025/10/06/deloitte-goes-all-in-on-ai-despite-having-to-issue-a-hefty-refund-for-use-of-ai/",
      "source": "techcrunch.com",
      "category": "Corporate Advisory",
      "published_date": "Mon, 06 Oct 2025 22:29:47 +0000",
      "author": "Rebecca Szkutak",
      "content": "Professional services and consultant firm Deloitte announced a landmark AI enterprise deal with Anthropic the same day it was revealed the company would issue a refund for a government-contracted report that contained inaccurate AI-produced slop. The upshot: Deloitte’s deal with Anthropic is a referendum on its commitment to AI, even as it grapples with the technology. And Deloitte is not alone in this challenge. The timing of this announcement is interesting — comical even. On the same day Deloitte touted its increased use of AI, the Australia Department of Employment and Workplace Relations said the consulting company would have to issue a refund for a report it did for the department that included AI hallucinations, the Financial Times reported. The department had commissioned a A$439,000 “independent assurance review” from Deloitte, which was published earlier this year. The Australian Financial Review reported in August the review had a number of errors, including multiple citations to non-existent academic reports. A corrected version of the review was uploaded to the department’s website last week. Deloitte will repay the final installment of its government contract, the FT reported. TechCrunch reached out to Deloitte for comment and will update the article if the company responds. Deloitte announced Monday plans roll out Anthropic’s chatbot Claude to its nearly 500,000 global employees on Monday. Deloitte and Anthropic, which formed a partnership last year, plan to create compliance products and features for regulated industries including financial services, healthcare and public services, according to an Anthropic blog post . Deloitte also plans to create different AI agent “personas” to represent the different departments within the company including accountants and software developers, according to reporting from CNBC . “Deloitte is making this significant investment in Anthropic’s AI platform because our approach to responsible AI is very aligned, and together we can reshape how enterprises operate over the next decade. Claude continues to be a leading choice for many clients and our own AI transformation,” Ranjit Bawa, global technology and ecosystems and alliances leader, at Deloitte wrote in the blog post. The financial terms of the deal — which Anthropic referred to as an alliance — were not disclosed. The deal is not only Anthropic’s largest enterprise deployment yet, it also illustrates how AI is embedding itself in every aspect of modern life from tools used at work to casual queries made at home. Deloitte is not the only company, or individual, getting caught using inaccurate AI-produced information in recent months either. In May, the Chicago Sun-Times newspaper had to admit that it ran an AI-generated list of books for its annual summer reading list after readers discovered some of the book titles were hallucinated even if the authors were real. An internal document viewed by Business Insider showed Amazon’s AI productivity ..."
    },
    {
      "title": "Lucid Motors sets record as Gravity sales pick up and tax credit expires",
      "description": "The company has seen EV deliveries increase for seven straight quarters, even though it's still way off the ambitious goals it promoted when it went public in 2021.",
      "url": "https://techcrunch.com/2025/10/06/lucid-motors-sets-record-as-gravity-sales-pick-up-and-tax-credit-expires/",
      "source": "techcrunch.com",
      "category": "Corporate Advisory",
      "published_date": "Mon, 06 Oct 2025 21:00:33 +0000",
      "author": "Sean O'Kane",
      "content": "Lucid Motors delivered a record 4,078 vehicles in the third quarter, likely buoyed by a combination of more Gravity SUVs hitting the road and a rush of customers taking advantage of the expiring federal EV tax credit. The Saudi-owned luxury EV startup is still way off the projections it used to go public in 2021 — a transaction that netted it $4 billion. But Lucid Motors has seen deliveries steadily climb over the last two years. The third-quarter delivery figures announced Monday mark the seventh consecutive quarter that Lucid Motors has seen sales increase. Lucid Motors was not alone in seeing a big third-quarter bump in EV sales. Tesla recorded its best quarter in company history , and legacy automakers like Ford and General Motors saw big increases as well. Even Rivian, which is forecasting a worse overall year for total EV deliveries than 2024 or 2023, saw a boost in the third quarter. Like Rivian, only customers who leased Lucid Motors vehicles were eligible for the federal EV tax credit, meaning the impact of its expiration is hard to quantify. It’s also unclear how many Gravity SUVs were delivered compared to the company’s first model, the Air sedan. Lucid Motors will reveal full financial results for the quarter on November 5. Lucid Motors has struggled to generate interest for its luxury EVs since going public in 2021, with former CEO Peter Rawlinson openly admitting the company needed to beef up its marketing operations. Earlier this year, the company announced it signed actor Timothée Chalamet to be its first “global ambassador.” The company has also benefited from rental sales and company leases in some quarters , as TechCrunch previously reported. The company is also increasingly looking to Saudi Arabia — which owns around 60% of the publicly traded company through its sovereign wealth fund — as a market for its vehicles. On Monday, Lucid Motors said it built more than 1,000 vehicles specifically for the Saudi market. (The company currently operates an assembly facility in the Kingdom and plans to open a full-fledged factory there.) Lucid has also locked in future demand from an unlikely customer: Uber. Uber announced last month plans to buy at least 20,000 Gravity SUVs over the next six years and use them as robotaxis on its network. For that deal, Lucid Motors will work to integrate autonomous vehicle company Nuro’s technology into the vehicles. Sean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane. You can contact or verify outreach from Sean by emaili..."
    },
    {
      "title": "Taylor Swift fans accuse singer of using AI in her Google scavenger hunt videos",
      "description": "Swifties love a puzzle, but some were rubbed the wrong way by a promotional scavenger hunt which appeared to use AI-generated videos.",
      "url": "https://techcrunch.com/2025/10/06/taylor-swift-fans-accuse-singer-of-using-ai-in-her-google-scavenger-hunt-videos/",
      "source": "techcrunch.com",
      "category": "Corporate Advisory",
      "published_date": "Mon, 06 Oct 2025 20:50:16 +0000",
      "author": "Amanda Silberling",
      "content": "For the release of her twelfth album, “The Life of a Showgirl,” Taylor Swift sent fans on an online scavenger hunt this weekend, which began by searching for “Taylor Swift” on Google. But as fans unveiled secret videos as part of the campaign, some fretted that the clips looked like they were AI-generated — and they were not pleased. A Google search for the singer’s name yields a cryptic message: “12 cities, 12 doors, 1 video to unlock.” Fans had to figure out the location of the doors, then physically find them and scan a QR code, which surfaced 12 unique videos that contained the clues needed to solve the puzzle. When fans Googled the correct phrase, another orange door appeared, which fans had to collectively “knock” on by clicking 12 million times. Finally, the door “opened,” revealing a lyric video for “ The Fate of Ophelia ,” which has its own orange door progress bar on YouTube. YouTube had scored the video exclusive for the track , as well as the lyric videos from the remaining songs on the new album. Google initially announced the scavenger hunt in a video on Instagram . The video begins with an aerial view of Earth, then quickly zooms in on a hilly, bejeweled landscape, until we see an orange door, overlayed with a Google search bar. A post shared by Google (@google) While Swifties love a puzzle, some were rubbed the wrong way by the 12 clue-containing videos, which looked to be AI-generated. Instead of searching for clues to unveil Swift’s new lyric video, as Swift intended, some fans began to scour the video clips like detectives, looking for signs that the scenes were synthetic. However, while there are clips that look computer-generated, it’s unclear if they were made using AI, and if so, to what extent. It would make sense if these videos were generated using Google’s AI products. As OpenAI shows off its new Sora 2 video generator , this Taylor Swift collaboration would be a serendipitous opportunity for Google to show millions of Swifties what its Veo 3 model can do. Google did not respond to TechCrunch’s request for comment on how these videos were generated or if Swift and Google worked together on this activation by using Google’s own AI technology. But Swift’s team and Google have teamed up for similar promotional activities in the past, we should note. Taylor Swift is using AI-generated videos to promote her new album 🤯 The future is here faster than you think… pic.twitter.com/yXV8YjtzzC The use of AI in creative works is a sensitive subject. Some artists think these tools can help them, while others have protested the manner in which large language models are trained on their work without consent , effectively using artists’ own work to create the technology that could threaten their livelihoods . Even Swift herself spoke out about the dangers of AI after President Donald Trump shared an AI-generated image of her showing support for his campaign last year; the incident spurred her to post an endorsement for former Vice Presi..."
    },
    {
      "title": "Microsoft buys another 100 MW of solar, this time in Japan",
      "description": "The new deal covers output from four different solar projects. Microsoft has said it will spend $2.9 billion to expand its infrastructure in Japan.",
      "url": "https://techcrunch.com/2025/10/06/microsoft-buys-another-100-mw-of-solar-this-time-in-japan/",
      "source": "techcrunch.com",
      "category": "Corporate Advisory",
      "published_date": "Mon, 06 Oct 2025 19:19:13 +0000",
      "author": "Tim De Chant",
      "content": "Microsoft is buying 100 megawatts of solar capacity from Japanese developer Shizen Energy, the latest in a string of renewable energy deals designed to power the tech company’s growing compute needs. The agreement , which the companies announced late last week, covers four different solar developments; one is already operating and three are under construction. The deal covers output from the plants for 20 years. Seattle-based Microsoft already operates two data centers in Japan. Microsoft’s compute capacity is slated to expand as the company invests $2.9 billion in the country over the next year. Solar has become a favored source of power for tech companies and data center operators in recent years because it is quick and cheap to build. Solar is among the cheapest forms of new generating capacity, and projects are generally completed within 18 months. Plus, users can begin drawing power before the entire project is complete. Microsoft has been a big buyer of solar in recent months. Since the year began, the company has contracted more than 1 gigawatt of solar capacity. Founders: Your next big connection and investor are here . Investors: Meet startups that align with your investment goals. Innovators & Visionaries: See the future of tech before everyone else. Register now and save up to $444 (or up to 30% on groups). Subscribe for the industry’s biggest tech news Every weekday and Sunday, you can get the best of TechCrunch’s coverage. TechCrunch Mobility is your destination for transportation news and insight. Startups are the core of TechCrunch, so get our best coverage delivered weekly. Provides movers and shakers with the info they need to start their day. By submitting your email, you agree to our Terms and Privacy Notice ."
    },
    {
      "title": "OpenAI ramps up developer push with more powerful models in its API",
      "description": "The updates were part of a series of announcements geared toward wooing developers to OpenAI’s ecosystem, including the launch of an agent-building tool and the ability to build apps in ChatGPT.",
      "url": "https://techcrunch.com/2025/10/06/openai-ramps-up-developer-push-with-more-powerful-models-in-its-api/",
      "source": "techcrunch.com",
      "category": "Corporate Advisory",
      "published_date": "Mon, 06 Oct 2025 19:10:27 +0000",
      "author": "Rebecca Bellan",
      "content": "OpenAI unveiled new API updates at its Dev Day on Monday, introducing GPT-5 Pro, its latest language model, its new video generation model Sora 2, and a smaller, cheaper voice model. The updates were part of a series of announcements geared toward wooing developers to OpenAI’s ecosystem, including the launch of an agent-building tool and the ability to build apps in ChatGPT . The addition of GPT-5 Pro might appeal to developers building applications in finance, legal, and healthcare — industries that need “high accuracy and depth of reasoning,” per OpenAI CEO Sam Altman. Altman also noted that voice capabilities will be essential in the future as it quickly becomes one of the primary ways people use to interact with AI. To that end, OpenAI is launching “gpt-realtime mini,” a smaller, cheaper voice model in API that supports low-latency streaming interactions for audio and speech. The new model is 70% cheaper than OpenAI’s previous advanced voice model but promises the “same voice quality and expressiveness.” Finally, creators involved in OpenAI’s developer ecosystem can now tap into Sora 2 in preview in the API. OpenAI released Sora 2, its latest audio and video generator, last week alongside the Sora app, a TikTok competitor filled with short AI-generated videos. The Sora app allows users to generate videos of themselves, friends, or anything based on a prompt, and share it via a TikTok-style algorithmic feed. “[Developers] now have access to the same model that powers Sora 2’s stunning video outputs right in your own app,” Altman said. Sora 2 builds on its previous generation with more realistic, physically consistent scenes with synchronized sound and greater creative control — from detailed camera direction to stylized visuals. “For example, you can take the iPhone view and prompt Sora to expand it into a sweeping, cinematic wide shot,” Altman said. “But one of the most exciting things that we’ve been working on is how well this new model pairs sound with visuals, not just speech, but rich soundscapes, ambient audio, synchronized effects that are grounded in what you’re seeing.” Sora 2 is pitched as a tool for concept development, whether it’s a visual starting point for an ad based on the general vibe of a product, or a Mattel designer turning a sketch into a toy concept — an example Altman provided at Dev Day that sheds light on OpenAI’s deal with the Barbie-maker to bring generative AI into the toy-making pipeline. Rebecca Bellan is a senior reporter at TechCrunch where she covers the business, policy, and emerging trends shaping artificial intelligence. Her work has also appeared in Forbes, Bloomberg, The Atlantic, The Daily Beast, and other publications. You can contact or verify outreach from Rebecca by emailing rebecca.bellan@techcrunch.com or via encrypted message at rebeccabellan.491 on Signal. Founders: Your next big connection and investor are here . Investors: Meet startups that align with your investment goals. Innovators & Visio..."
    },
    {
      "title": "North American Startup Funding Held High In Q3",
      "description": "In total, investors put $63.1 billion into reported seed through growth-stage rounds for U.S. and Canadian companies in Q3, per Crunchbase data; up incrementally from the prior quarter and far above year-ago levels.",
      "url": "https://news.crunchbase.com/venture/n-america-vc-funding-big-deals-q3-2025-ai-exits-data/",
      "source": "news.crunchbase.com",
      "category": "Corporate Advisory",
      "published_date": "Tue, 07 Oct 2025 11:00:13 +0000",
      "author": "Joanna Glasner",
      "content": "North American startup funding held strong in the third quarter, boosted by investors’ still-voracious appetite for artificial intelligence. In total, investors put $63.1 billion into reported seed through growth-stage rounds for U.S. and Canadian companies in Q3, per Crunchbase data. That’s up incrementally from the prior quarter. However, it’s far above year-ago levels, with more than $20 billion in additional funding. The high funding level was the result of bigger rounds, not more of them. For Q3, 2,276 reported rounds got added to the Crunchbase dataset 1 , down a bit from the prior quarter and far below year-ago levels. Round counts were down at all stages except later stage. In addition to being more highly concentrated, the past quarter’s dealmaking was heavily AI-centric. Per Crunchbase data, roughly 57% of all North American funding went to companies in AI-related categories. This included the quarter’s largest round, a $13 billion Series F for Anthropic , which alone accounted for more than a fifth of total startup investment in the region last quarter. Of course, headline-grabbing gargantuan rounds weren’t the only trends to watch. We also saw an uptick in funding at early stage, and exit activity was reasonably strong, lifted by Figma ’s splashy market debut in late July. Below, we look at funding for each stage in greater detail, and also take a look at AI-related investment and standout exits. Late-stage dealmaking was up sequentially in Q3, so we’ll start there. Altogether, an estimated $42.9 billion went to late-stage and technology growth financings last quarter. As charted below, it was the third-highest tally in the past five quarters. The aforementioned Anthropic megaround went a long way to boosting the totals. And while no other deal came close in size, there were also some other big rounds in mix. Cerebras , a developer of AI processors, closed out the quarter by raising $1.1 billion in Series G funding, later withdrawing plans for an anticipated IPO. Next were humanoid robotics startup Figure and quantum computing company PsiQuantum , both of which secured $1 billion financings. It was also a pretty good quarter for early-stage fundraising. Companies at Series A and Series B stage pulled in $15.6 billion in Q3 — the highest tally of the past five quarters, as charted below. The rise in funding resulted from larger average round sizes, however, not more deals. In fact, the number of reported deals actually hit a low point for the year this past quarter. Moreover, not every round classified as early stage goes to an immature startup. This is the case, for example, for the largest early-stage Q3 round, Commonwealth Fusion Systems ’ $863 million Series B2. Although technically an early-stage round, it’s worth noting that the company was founded in 2017 and closed its initial Series B tranche nearly four years ago. Other standout early-stage rounds for the quarter hailed from sectors such as quantum computing, AI and biotech. ..."
    },
    {
      "title": "Startups And The Shutdown: When Your Primary Customer Folds Overnight",
      "description": "For thousands of early-stage companies working on AI, biotech, climate tech and more, the U.S. government shutdown is an existential crisis. It doesn’t matter how brilliant their tech is or how slick their pitch deck looks. What matters is whether they’ve built a company resilient enough to survive the silence until Washington switches back on, writes regular columnist Aron Solomon.",
      "url": "https://news.crunchbase.com/policy-regulation/shutdown-affecting-startups-solomon-amplify/",
      "source": "news.crunchbase.com",
      "category": "Corporate Advisory",
      "published_date": "Mon, 06 Oct 2025 18:49:39 +0000",
      "author": "Judy Rider",
      "content": "Government shutdowns usually land in the headlines as political theater: national parks closed, passport offices jammed, TSA lines stretching into eternity. Annoying, sure, but not existential for most people. For startups, though, this October’s shutdown is different. When your primary customer is Uncle Sam and he suddenly closes his checkbook, that isn’t politics — it’s survival. The U.S. government is the client for thousands of young companies, especially those in defense tech, climate tech, biotech and AI. A Pentagon pilot program, an NIH grant, an EPA loan guarantee — these aren’t just contracts. They’re lifelines that validate your product, unlock venture funding and keep the team paid. But contracts don’t mean much without appropriations. If the agency you’re working with doesn’t have authority to spend, the invoices sit in limbo. The most dangerous thing about a shutdown is that startups can do everything right — sign the deal, hit the milestones, file the paperwork — and still get left holding the bag. That plays out in the one metric founders obsess over: runway. Most early-stage startups don’t have a year of cash just sitting there. If a big federal payment is frozen, it’s not just an accounting hiccup. It can cut months off survival time. Payroll suddenly looks dicey, milestones start slipping and investors get jumpy. One defense tech founder told me, “We can survive a late-paying Fortune 500 client. We can’t survive a silent Pentagon.” That’s the difference: Corporate clients might be slow, but they don’t disappear overnight because Congress got stuck in neutral. And this isn’t just about cash flow. The government is also a gatekeeper. Need an FDA green light for your trial? Need the SBA to guarantee your loan? Need the SEC to review your filing? If staff are furloughed, those processes stall. That delay ripples. A biotech waiting on an FDA sign-off can lose an entire quarter of momentum. A climate startup waiting on a loan guarantee can watch investors walk. A fintech can’t move forward with an unanswered SEC question. In the startup world, where speed is survival, three months of dead air can be terminal. If this all sounds familiar, that’s because it is. Back in 2018–2019, when the shutdown dragged on for 35 days, NASA suspended small aerospace projects, NIH froze grants and the SBA stopped processing loans . Startups that leaned heavily on federal programs got walloped. A few pulled through by grabbing bridge financing or deferring expenses, but a lot of promising young companies simply ran out of oxygen. The ones that survived weren’t necessarily the best products — they were the ones whose founders had already gamed out what a shutdown meant for their business. That’s the reality investors are grilling founders on right now. If you’re pitching in October 2025, you’re going to get one question before anyone cares about your TAM or your roadmap: “How exposed are you to the shutdown?” Hand-waving won’t cut it. VCs want to see the..."
    },
    {
      "title": "Cerebras Systems Pulls Plug On Its IPO Days After Big Fundraise",
      "description": "Just days after raising $1.1 billion in funding, AI processor developer Cerebras Systems has filed to withdraw its hotly anticipated initial public offering.",
      "url": "https://news.crunchbase.com/public/ipo/cerebras-systems-halts-ipo-ai-semiconductors/",
      "source": "news.crunchbase.com",
      "category": "Corporate Advisory",
      "published_date": "Mon, 06 Oct 2025 18:18:57 +0000",
      "author": "Judy Rider",
      "content": "Just days after raising $1.1 billion in funding, AI processor developer Cerebras Systems has filed to withdraw its hotly anticipated initial public offering. The Sunnyvale, California-based company announced on Sept. 30 a Series G funding round that valued it at $8.1 billion post-money. Fidelity and Atreides Management led the financing. Then on Oct. 3, the startup submitted a letter to the U.S. Securities and Exchange Commission , formally requesting to withdraw its IPO registration because it “does not intend to conduct the proposed offering … at this time.” Cerebras originally filed to go public in September of 2024. At that time, the company was “ramping up to take on Nvidia in an effort to create processors for running generative AI models,” CNBC reports . In its filing, Cerebras noted its dependence on a single customer, Group 42, a subsidiary of its investor G42 , responsible for more than 80% of revenue in 2023 and the first half of 2024. Cerebras has built a larger chip that is 10x faster for AI training and inference compared to leading GPU solutions, according to the company . Its customers include Mistral AI and the Mayo Clinic . The company has reportedly shifted its focus since that initial filing from selling systems toward more of being a cloud service provider for accepting incoming queries to models that use its chips underneath, according to CNBC . CEO Andrew Feldman told the publication that he thought last year’s prospectus was “out of date” considering developments in AI. Cerebras has raised a known $1.8 billion in funding since its 2016 founding by Feldman, per Crunchbase data . It raised $250 million in a Series F round led by Alpha Wave Ventures in November 2021 that valued the company at just over $4 billion. Other backers include Sequoia Capital , Valor Equity Partners , Eclipse Ventures , Benchmark and Coatue . Stay up to date with recent funding rounds, acquisitions, and more with the Crunchbase Daily. In total, investors put $63.1 billion into reported seed through growth-stage rounds for U.S. and Canadian companies in Q3, per Crunchbase data; up... Discover and act on private market opportunities with predictive company intelligence."
    },
    {
      "title": "Exclusive: Fintech Decacorn Ramp Acquires Jolt AI to Help Its Engineers ‘Build Faster’",
      "description": "Expense management startup Ramp has acquired the team of an AI startup, with the intent of making its engineers “as productive as possible,” the company tells Crunchbase News exclusively.",
      "url": "https://news.crunchbase.com/fintech/ramp-jolt-ai-acquisition-fintech-ai-ma/",
      "source": "news.crunchbase.com",
      "category": "Corporate Advisory",
      "published_date": "Mon, 06 Oct 2025 13:00:27 +0000",
      "author": "Marlize van Romburgh",
      "content": "Expense management startup Ramp has acquired the team of a three-person startup called Jolt AI with the intent of making its engineers “as productive as possible,” the company tells Crunchbase News exclusively. While a relatively small acquisition, the deal is significant in that it’s representative of the role that artificial intelligence is playing in many of the fastest-growing venture-backed startups — even those that aren’t necessarily strictly AI companies. New York-based fintech Ramp is definitely among that rapidly growing bunch, having achieved a valuation of $22.5 billion , as well as annualized revenue of $1 billion, in 2025. That’s up from a valuation of $13 billion just a few months earlier in March, as well as an increase from annualized revenue of $700 million as of January. The company says it began “generating cash flow” earlier this year. Jolt AI has raised just under $2.5 million in funding since its 2022 inception from investors such as Alumni Ventures , 8-Bit Capital and Engineering Capital . The startup initially was a load-testing platform before pivoting in 2024 to launch an AI coding assistant for large production-scale code, according to CEO and founder Yev Spektor . Besides being strategic for Ramp, the acquisition is also representative of an uptick in the number of startups buying other startups . In the first three quarters of 2025, there were 647 reported M&A deals globally in which startups bought other startups, according to Crunchbase data . That compares to 539 in the same period last year, a 20% increase. For comparison’s sake, in the full years 2021 and 2022, there were nearly 1,000 deals in which startups bought other startups, per Crunchbase data. “The need for both of those is even more important now with AI and agentic work taking hold in finance,” he said. He claims that thanks in part to AI, Ramp customers can get 3x more done in Ramp today than they could just two years ago. “And in the next two years we want that to be 30x,” Atiyeh said. “We think the way to get there is by focusing on AI and agentic workflows, making Ramp’s platform dramatically more powerful. We’re focused on hiring the best engineering talent there is to make this happen and then, importantly, making our engineers as productive as possible.” That’s what got him so excited about the Jolt team. Their entire focus, Atiyeh said, “is on making engineers radically more productive — helping them ship faster.” Jolt AI’s 2024 pivot proved to be the right move. So much so in fact that the CEO of one of its early customers introduced the small startup to Atiyeh and Ramp earlier this year. And the rest, as they say, is history. Ramp’s purchase, notably, involved only the company’s three-person team, and not its product. “Jolt is a team of world-class engineers who have spent years solving some of the hardest problems in developer productivity,” Atiyeh said. “They’re now bringing that expertise to Ramp’s developer tools and beyond. I’m most exci..."
    },
    {
      "title": "Q3 Venture Funding Jumps 38% As More Massive Rounds Go To AI Giants And Exits Gain Steam",
      "description": "Global venture funding gained significantly in Q3 2025, closing up 38% year over year, Crunchbase data shows, as massive funding deals, particularly for giants in the AI sector, continued to lead.",
      "url": "https://news.crunchbase.com/venture/global-vc-funding-biggest-deals-q3-2025-ai-ma-data/",
      "source": "news.crunchbase.com",
      "category": "Corporate Advisory",
      "published_date": "Mon, 06 Oct 2025 11:00:16 +0000",
      "author": "Gené Teare",
      "content": "Global venture funding gained significantly in Q3 2025, closing up 38% year over year, Crunchbase data shows, as massive funding deals, particularly for giants in the AI sector, continued to lead. All told, Q3 venture investment reached $97 billion, up from $70 billion in Q3 2024, per Crunchbase data. Quarter-over-quarter funding was up slightly from $92 billion in Q2. In each of the past four quarters, global startup funding has been above $90 billion — quarterly amounts not seen since Q3 2022 — Crunchbase data shows. Startup investment has also now posted a year-over-year increase for the past four quarters, driven by megarounds of $500 million or more, largely to AI-related companies. As funding has increased this year, so has capital concentration. Over the past four quarters, venture investment has concentrated into rounds of $500 million or more, an analysis of Crunchbase data shows, with more than 30% of funding each quarter going toward such megarounds. The three largest venture rounds in Q3 2025 were raised by foundation model companies Anthropic ($13 billion), xAI ($5.3 billion) and Mistral AI ($2 billion). Billion-dollar-plus funding deals also went to Princeton Digital Group , Nscale , Cerebras Systems , Figure , Databricks and PsiQuantum . All in all, a third of all venture investment in Q3 went to just 18 companies that raised funding rounds of $500 million or more each. That is well above historical proportions before Q4 2024. Megaround funding also gained steam as the quarter progressed, with 11 of the 18 companies raising funding in September. In another blockbuster quarter for AI funding, $45 billion — or around 46% of global venture funding — went to the sector, with 29% invested in a single company, Anthropic. Hardware was the second-largest sector, with large rounds raised by robotic, semiconductor, quantum and data infrastructure companies in the third quarter totaling $16.2 billion, per Crunchbase data. The healthcare and biotech sector raised $15.8 billion in venture funding in Q3, making it the third-largest sector for the quarter. Financial services, the fourth-largest sector, raised $12 billion in total. Along with a greater concentration of capital in larger companies, the U.S. predominated, with $60 billion — or just under two-thirds of global venture capital — going to U.S.-based companies in Q3. Most of the third quarter’s year over year gains were in late-stage funding. Late-stage investment in Q3 totaled $58 billion, up more than 66% year over year, and slightly higher quarter over quarter, Crunchbase data shows. (The peak quarter for late-stage funding in 2025 was Q1, with the $40 billion round for OpenAI significantly boosting the numbers.) Early-stage funding totaled nearly $30 billion for more than 1,700 companies in Q3, Crunchbase data shows. That’s up just over 10% quarter over quarter and year over year. Larger Series A and B rounds were raised by companies working on AI data workloads, energy, quantum, rob..."
    },
    {
      "title": "The Week’s 10 Biggest Funding Rounds: Another Big Week For AI And California Startups",
      "description": "AI startups and California-based companies have been scooping up an outsized share of venture funding for a while now, and this past week was no exception.",
      "url": "https://news.crunchbase.com/venture/biggest-funding-rounds-cerebras-periodic-labs-vercel/",
      "source": "news.crunchbase.com",
      "category": "Corporate Advisory",
      "published_date": "Fri, 03 Oct 2025 18:48:53 +0000",
      "author": "Joanna Glasner",
      "content": "Want to keep track of the largest startup funding deals in 2025 with our curated list of $100 million-plus venture deals to U.S.-based companies? Check out The Crunchbase Megadeals Board . This is a weekly feature that runs down the week’s top 10 announced funding rounds in the U.S. Check out last week’s biggest funding rounds here . AI startups and California-based companies have been scooping up an outsized share of venture funding for a while now, and this past week was no exception. Leading the ranks was Cerebras Systems , as the AI processor developer and potential IPO candidate picked up $1.1 in fresh funding. Other large rounds went to companies in areas including AI, enterprise software, cybersecurity, blockchain and biotech. 1. Cerebras Systems , $1.1B, AI hardware: Cerebras Systems, a developer of AI processors, announced that it raised $1.1 billion in Series G funding at an $8.1 billion post-money valuation. Fidelity and Atreides Management led the financing for the Sunnyvale, California-based company, which filed to go public last year. 2. (tied) Periodic Labs , $300M, AI: Silicon Valley-based Periodic Labs launched with $300 million in initial funding to develop AI models for science. Venture backers include Andreessen Horowitz , Felicis 1 , DST , NVentures and Accel . 2. (tied) Vercel , $300M, cloud infrastructure: Vercel, a developer of tools and cloud infrastructure to build websites, secured $300 million in a Series F round co-led by Accel and GIC . The financing sets a $9.3 billion valuation for the 10-year-old company. 4. Crystalys Therapeutics , $205M, biopharma: San Diego-based Crystalys Therapeutics launched with $205 million in Series A financing to support its mission of addressing the unmet medical needs of people living with gout. Novo Holdings , SR One and Catalys Pacific led the financing. 5. Flying Tulip , $200M, blockchain: Flying Tulip, a provider of blockchain financial products, said it raised $200 million in a private funding round. Backers included CoinFund , DWF Labs , FalconX , Hypersphere and Selini . 6. CyberCube , $180M, cybersecurity: CyberCube, a provider of cyber risk management tools, said it locked up more than $180 million in an investment from Spectrum Equity . Founded in 2015, San Francisco-based CyberCube has raised at least $285 million to date, per Crunchbase data. 7. Star Therapeutics , $125M, antibody therapies: South San Francisco, California-based Star Therapeutics, a developer of antibodies for bleeding disorders and other diseases, picked up $125 million in Series D financing co-led by Sanofi Ventures and Viking Global Investors . 8. Eve , $103M, legal tech: Eve, a San Francisco-based AI platform for plaintiff law firms, landed $103 million in Series B funding at over a $1 billion valuation. Spark Capital led the financing, with participation from existing investors Andreessen Horowitz, Lightspeed Venture Partners and Menlo Ventures . 9. Supabase , $100M, database technology: Postgres devel..."
    },
    {
      "title": "The MVPs Of The Startup World Are Still Getting More Valuable",
      "description": "OpenAI's new $500 billion valuation is the most dramatic example of a broader trend: Hot private companies posting huge and often sharply rising valuations.",
      "url": "https://news.crunchbase.com/business/most-valuable-private-companies-unicorns-openai-spacex-anthropic-stripe-xai/",
      "source": "news.crunchbase.com",
      "category": "Corporate Advisory",
      "published_date": "Fri, 03 Oct 2025 15:34:29 +0000",
      "author": "Joanna Glasner",
      "content": "At $500 billion, OpenAI ’s latest valuation is higher than the individual GDPs of more than three-fourths of all nations on Earth. We won’t opine on whether the business’ fundamentals merit that pricetag. However, we will note that it’s the most dramatic example of a broader trend: Hot private companies posting huge and often sharply rising valuations. For now, OpenAI has clinched first place as the most valuable private company. But, per Crunchbase data, there are also at least five more private, venture-backed U.S. companies with valuations exceeding $100 billion. Below, we’ve ranked the top five other companies, including a look at how their valuations have risen in recent quarters Given that many large-cap public tech companies have seen large share-price hikes in recent months, particularly for those perceived as leaders in AI, it’s not entirely a shocker to see the most high-profile private companies getting valuation boosts as well. Still, it’s worth noting that these are unusually large gains in the space of a few months, particularly for GenAI leaders. At current levels, they’re certainly priced with high expectations for future performance. Stay up to date with recent funding rounds, acquisitions, and more with the Crunchbase Daily. In total, investors put $63.1 billion into reported seed through growth-stage rounds for U.S. and Canadian companies in Q3, per Crunchbase data; up... For thousands of early-stage companies working on AI, biotech, climate tech and more, the U.S. government shutdown is an existential crisis. It... Just days after raising $1.1 billion in funding, AI processor developer Cerebras Systems has filed to withdraw its hotly anticipated initial public... Expense management startup Ramp has acquired the team of an AI startup, with the intent of making its engineers “as productive as possible,” the... Discover and act on private market opportunities with predictive company intelligence."
    },
    {
      "title": "A Growing Backlog Of Biotechs Haven’t Raised Funding Since The Boom",
      "description": "More than 200 private U.S. biotechs with $50 million or more in funding to date secured their last reported financing between three and five years ago. The list includes at least 15 biotech unicorns and emerging unicorns.",
      "url": "https://news.crunchbase.com/health-wellness-biotech/biotech-unicorn-startups-funding-havent-raised-since-2022-data/",
      "source": "news.crunchbase.com",
      "category": "Corporate Advisory",
      "published_date": "Fri, 03 Oct 2025 11:00:43 +0000",
      "author": "Joanna Glasner",
      "content": "As biotech startup funding continues to decline , the backlog of funded, private companies that haven’t raised capital in several years has grown quite large. Per Crunchbase data, more than 200 private U.S. biotechs with $50 million or more in funding to date secured their last reported financing between three and five years ago. The list includes at least 15 biotech unicorns and emerging unicorns that haven’t raised known funding for at least the past three years. Part of the reason for the backlog of companies with long funding lags is the shift in investor appetite for biotech. During the boom years from 2020 through 2022, startup investors put an average of $40 billion per year into the space — well above current levels. Some of those were truly huge financings as well. The largest, in early 2022, went to Altos Labs , a San Francisco startup focused on cellular rejuvenation that launched with $3 billion in committed capital. The biotech IPO market was also quite happening then compared to now . This offered companies yet another avenue to raise capital to fund research and clinical trials. This year, by contrast, is on track to come in much lower. So far in 2025, only about $17 billion has gone to U.S. biotechs, per Crunchbase data . And of that, roughly half has gone to seed and early stage startups — leaving a smaller portion for late-stage financings for well-funded companies. A number of the companies that have gone three-plus years without a round were fairly high-profile startups as well. Many are still chugging along, likely helped by having secured large commitments when funding flowed more freely. For example Insitro , a startup focused on applying machine learning to drug discovery and development, raised $643 million between 2018 and 2021 but hasn’t raised a known round since. This spring, the company announced a 22% workforce cut in a move it said “extends our runway into 2027.” Agtech unicorn Pivot Bio , which develops microbial nitrogen for farms, also hasn’t secured known financing in more than four years, per Crunchbase data. However, it should be noted that its last round — a $430 million Series D in 2021 — was pretty big. The company has a number of open positions and this spring announced plans to relocate a significant portion of its operations from Berkeley, California, to the Midwest. Ultima Genomics , developer of a low-cost sequencing platform, is another company that had a big round a few years ago and hasn’t raised since. The Newark, California-based startup launched in May 2022 with $300 in initial funding from backers including Andreessen Horowitz and Khosla Ventures . Of late, it’s been steadily announcing new partnerships. If we look at all the well-funded biotechs in our query, they’ve collectively raised a tremendous amount of money. In total, the 204 companies in our sample 1 that haven’t raised for three-plus years previously pulled in $17.9 billion. That’s roughly equivalent to all the venture money that’s g..."
    },
    {
      "title": "Yahoo News: Latest and Breaking News, Headlines, Live Updates, and More",
      "description": "The latest news and headlines from Yahoo News. Get breaking news stories and in-depth coverage with videos and photos.",
      "url": "https://www.yahoo.com/news/",
      "source": "finance.yahoo.com",
      "category": "Corporate Advisory",
      "published_date": null,
      "author": "",
      "content": "President Trump reiterated the layoff threat Monday but some Democrats say the hardball tactic isn't likely to break the shutdown impasse. Sanchez allegedly smelled of alcohol and slurred his speech as he confronted a 69-year-old truck driver. Officials say the \"record-setting\" operation targeted gang members, drug traffickers, child predators, and bank robbers. Waymo's self-driving cars are all around San Francisco. I rode in one and compared the price to the same trip on Uber and Lyft. As Trump ramps up his retribution campaign on perceived enemies, two new MSNBC reports reveal federal prosecutors pushing back, refusing to go to trial against Fmr. FBI Dir. James Comey and vowing not to buckle to pressure to charge New York Attorney General Letitia James. Fmr. Federal prosecutor Ankush Khardori and Angelo Carusone, President and CEO of Media Matters, join the conversation. This case isn’t an isolated issue. \"A permit is issued only after inspection.\" Long-range Ukrainian drones and missiles hit a major Russian ammunition plant, a key oil terminal and an important weapons depot behind the front line, Ukraine's president and military said Monday, as Kyiv cranked up pressure on Moscow’s military logistics. The Sverdlov ammunition plant in the Nizhny Novgorod region of western Russia was struck overnight, causing multiple explosions and a fire, the Ukrainian General Staff said."
    },
    {
      "title": "US | Yahoo News - Latest News & Headlines",
      "description": "The latest news and headlines from Yahoo News. Get breaking news stories and in-depth coverage with videos and photos.",
      "url": "https://www.yahoo.com/news/us/",
      "source": "finance.yahoo.com",
      "category": "Corporate Advisory",
      "published_date": null,
      "author": "",
      "content": ""
    },
    {
      "title": "Latest Political News, Updates, and Analysis - Yahoo News",
      "description": "The latest political news and headlines from Yahoo News, including national and state level updates, breaking stories and coverage",
      "url": "https://www.yahoo.com/news/politics/",
      "source": "finance.yahoo.com",
      "category": "Corporate Advisory",
      "published_date": null,
      "author": "",
      "content": ""
    },
    {
      "title": "World News - Latest and Breaking Coverage - Yahoo News",
      "description": "The latest world news and headlines from Yahoo News and international publishers, breaking stories, ongoing events, and coverage",
      "url": "https://www.yahoo.com/news/world/",
      "source": "finance.yahoo.com",
      "category": "Corporate Advisory",
      "published_date": null,
      "author": "",
      "content": ""
    },
    {
      "title": "Nordelta, Argentina - Weather Forecasts | Maps | News - Yahoo Weather",
      "description": "View the latest weather forecasts, maps, news and alerts on Yahoo Weather. Find local weather forecasts for Nordelta, Argentina throughout the world",
      "url": "https://www.yahoo.com/news/weather/",
      "source": "finance.yahoo.com",
      "category": "Corporate Advisory",
      "published_date": null,
      "author": "",
      "content": "Sunny with a high of 74 °F (23.3 °C). Winds from WNW to W at 11 to 13 mph (17.7 to 20.9 kph). Night - Clear. Winds variable at 6 to 9 mph (9.7 to 14.5 kph). The overnight low will be 51 °F (10.6 °C). Sunny today with a high of 78 °F (25.6 °C) and a low of 49 °F (9.4 °C). Sunny today with a high of 80 °F (26.7 °C) and a low of 55 °F (12.8 °C). Partly cloudy today with a high of 82 °F (27.8 °C) and a low of 59 °F (15 °C). Partly cloudy today with a high of 76 °F (24.4 °C) and a low of 56 °F (13.3 °C). There is a 75% chance of precipitation. Rain today with a high of 68 °F (20 °C) and a low of 50 °F (10 °C). There is a 76% chance of precipitation. Partly cloudy today with a high of 75 °F (23.9 °C) and a low of 48 °F (8.9 °C). Sunny today with a high of 73 °F (22.8 °C) and a low of 54 °F (12.2 °C). Cloudy today with a high of 75 °F (23.9 °C) and a low of 56 °F (13.3 °C). There is a 44% chance of precipitation. Rain today with a high of 74 °F (23.3 °C) and a low of 57 °F (13.9 °C). There is a 60% chance of precipitation. Sunny today with a high of 75 °F (23.9 °C) and a low of 52 °F (11.1 °C). Today - Sunny with a high of 74 °F (23.3 °C). Winds from WNW to W at 11 to 13 mph (17.7 to 20.9 kph). Tonight - Clear. Winds variable at 6 to 9 mph (9.7 to 14.5 kph). The overnight low will be 51 °F (10.6 °C)."
    },
    {
      "title": "Yahoo News: Latest and Breaking News, Headlines, Live Updates, and More",
      "description": "The latest news and headlines from Yahoo News. Get breaking news stories and in-depth coverage with videos and photos.",
      "url": "https://www.yahoo.com/news/health/",
      "source": "finance.yahoo.com",
      "category": "Corporate Advisory",
      "published_date": null,
      "author": "",
      "content": "Most states require childhood vaccinations for measles, mumps, tetanus, rubella, chickenpox and whooping cough. Michaela Del Barrio was worried about her family's history with breast cancer, but she didn't expect an early assessment to find anything. A breast cancer treatment known as IORT has numerous benefits, surgeons say, but generates less money for hospitals and radiation oncologists. STOCKHOLM (Reuters) -Nobel medicine prize winner Fred Ramsdell thought his wife had spotted a grizzly bear in the backcountry of Wyoming when she suddenly let out a yell on Monday - only to discover he had won the most coveted award in science. Ramsdell shared the 2025 award with Mary Brunkow and Shimon Sakaguchi for work shedding light on how the immune system spares healthy cells, but the Nobel Assembly could not reach him as he was on a camping and hiking trip with his wife. Thomas Perlmann -Younger Europeans are drinking less alcohol because of the way it tastes and concern over their health, a market research firm said on Tuesday, suggesting slow sales are a result of changing preferences rather than just a financial squeeze. Alcohol sales have been falling in developed countries in recent years, prompting debate over what has driven the declines. Circana, a U.S. market research company, said its survey pointed to a generational shift in Europe, where it found 71% of consumers LONDON/COPENHAGEN (Reuters) -Wegovy-maker Novo Nordisk has laid off dozens of employees at the largest U.S. manufacturing site for its blockbuster obesity and diabetes drugs, a Reuters review of LinkedIn posts showed, a signal of where it is making cuts in a major restructuring under new CEO Mike Doustdar. The previously unreported cuts included staff in manufacturing roles, from quality control to production line technicians, at Novo's major Clayton, North Carolina, plant and other facilities DHAKA (Reuters) -Bangladesh’s dengue outbreak is worsening rapidly with infections and deaths climbing sharply across the country, health experts have said, warning the disease could spiral if urgent and coordinated mosquito control efforts are not launched. According to the Directorate General of Health Services (DGHS), 50,689 dengue cases and 215 deaths have been reported nationwide this year as of October 6. Professor Kabirul Bashar, an entomologist at Jahangirnagar University, said the out"
    },
    {
      "title": "Latest Science News and Updates on Space, Climate Change and More - Yahoo News",
      "description": "The latest science news and headlines from Yahoo News, focusing on space, climate change and health-related breaking stories and coverage",
      "url": "https://www.yahoo.com/news/science/",
      "source": "finance.yahoo.com",
      "category": "Corporate Advisory",
      "published_date": null,
      "author": "",
      "content": ""
    },
    {
      "title": "Latest Trending and Live Original Coverage from Yahoo News",
      "description": "Yahoo News' award-winning original coverage of politics, science, weather, and health, plus explainers and FAQs on the current events.",
      "url": "https://news.yahoo.com/originals/",
      "source": "finance.yahoo.com",
      "category": "Corporate Advisory",
      "published_date": null,
      "author": "",
      "content": "Squishmallows is tapping into the beauty world with a new fragrance line. Experts say that the tween-focused brand is a smart move. Busy Philipps talks about the \"Dawson's Creek\" reunion (plus that Joshua Jackson kiss) and how, at 46, she's all about owning who she is. Erin LaVoie is at the top of her game. But being a female lumberjack doesn't pay the bills. Here, she shares how she balances side hustles to keep her dream alive. Here's how to purchase tickets for Yungblud's 2026 world tour. The stalemate drags on with no clear progress toward a deal to reopen the government. Zelda Williams, daughter of the late Robin Williams, opened up about people sending her AI videos of her father. The new trailer for \"Die My Love\" shows Robert Pattinson and Jennifer Lawrence struggling to make their marriage work."
    }
  ]
}